{
    "150154": {
        "name_en": "nginx 0.6.x < 1.20.1 1-Byte Memory Overwrite RCE",
        "name_cn": "nginx 0.6。x<1.20.1 1字节内存覆盖RCE",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its Server response header, the installed version of nginx is 0.6.18 prior to 1.20.1. It is, therefore, affected by a remote code execution vulnerability. A security issue in nginx resolver was identified, which might allow an unauthenticated remote attacker to cause 1-byte memory overwrite by using a specially crafted DNS response, resulting in worker process crash or, potentially, in arbitrary code execution. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其服务器响应头，nginx的安装版本是1.20.1之前的0.6.18。因此，它受到远程代码执行漏洞的影响。nginx resolver中发现了一个安全问题，未经验证的远程攻击者可能会通过使用特制的DNS响应导致1字节内存覆盖，从而导致工作进程崩溃，或可能导致任意代码执行。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to nginx 1.20.1 or later.",
        "solution_cn": "升级至nginx 1.20.1或更高版本。",
        "cve": "CVE-2021-23017"
    },
    "152102": {
        "name_en": "Microsoft Windows EFSRPC NTLM Reflection Elevation of Privilege (PetitPotam) (Remote)",
        "name_cn": "Microsoft Windows EFSRPC NTLM反射权限提升（PetitPotam）（远程）",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host is affected by an NTLM reflection elevation of privilege vulnerability known as 'PetitPotam'. An unauthenticated, remote attacker can exploit this, by sending a specially-crafted EFSRPC request, to cause the affected host to connect to a malicious server. An attacker can then utilize an NTLM relay to impersonate the target host and authenticate against remote services. One attack scenario, described within KB5005413, uses this exploit to initiate an NTLM session as a domain controller's machine account. This session is then relayed to an Active Directory Certificate Services (AD CS) host to obtain a certificate. This certificate could be then used to move laterally within the domain environment.",
        "describe_cn": "远程主机受到名为“PetitPotam”的NTLM反射权限提升漏洞的影响。未经验证的远程攻击者可以通过发送精心编制的EFSRPC请求，利用此漏洞，使受影响的主机连接到恶意服务器。然后，攻击者可以利用NTLM中继模拟目标主机并针对远程服务进行身份验证。KB5005413中描述的一种攻击场景使用此漏洞作为域控制器的计算机帐户启动NTLM会话。然后将该会话中继到Active Directory证书服务（AD CS）主机以获取证书。然后可以使用该证书在域环境中横向移动。",
        "solution_en": "Apply the updates supplied by the vendor. Optionally, refer to Microsoft's KB5005413 for mitigation guidance. RPC filters may also be implemented to block remote access to the interface UUIDs necessary for this exploit.",
        "solution_cn": "应用供应商提供的更新。或者，参考微软的KB5005413以获取缓解指南。还可以实现RPC过滤器，以阻止对该漏洞攻击所需的接口UUID的远程访问。",
        "cve": "CVE-2021-36942"
    },
    "150962": {
        "name_en": "CodeMeter Runtime Buffer Over-read (WIBU-210423-01)",
        "name_cn": "码表运行时缓冲区超读（WIBU-210423-01）",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The remote CodeMeter runtime network server is affected by a buffer over-read vulnerability due to insufficient validation of user-supplied data. An unauthenticated, remote attacker can exploit this, via a specially crafted message, to disclose heap memory contents or crash the server.",
        "describe_cn": "由于未充分验证用户提供的数据，远程CodeMeter运行时网络服务器受到缓冲区过度读取漏洞的影响。未经验证的远程攻击者可以通过特制的消息利用此漏洞泄露堆内存内容或使服务器崩溃。",
        "solution_en": "Upgrade CodeMeter Runtime to version 7.21a or later.",
        "solution_cn": "将CodeMeter Runtime升级至7.21a或更高版本。",
        "cve": "CVE-2021-20093"
    },
    "83765": {
        "name_en": "Apache Tomcat 8.0.x < 8.0.17 Security Manager Bypass",
        "name_cn": "ApacheTomcat 8.0。x<8.0.17安全管理器旁路",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its self-reported version number, the Apache Tomcat server listening on the remote host is 8.0.x prior to 8.0.17. It is, therefore, affected by a security bypass vulnerability due to a flaw that occurs when handling expression language. A remote attacker can exploit this, via a crafted web application, to bypass the security manager protection and execute arbitrary code. Note that Nessus has not attempted to exploit this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，在远程主机上监听的Apache Tomcat服务器是8.0。x在8.0.17之前。因此，它受到安全绕过漏洞的影响，该漏洞是由于在处理表达式语言时出现的缺陷造成的。远程攻击者可以通过特制的web应用程序利用此漏洞绕过security manager保护并执行任意代码。请注意，Nessus并未试图利用此问题，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 8.0.17 or later.",
        "solution_cn": "升级至Apache Tomcat 8.0.17或更高版本。",
        "cve": "CVE-2014-7810"
    },
    "88937": {
        "name_en": "Apache Tomcat 8.0.0.RC1 < 8.0.32 Multiple Vulnerabilities",
        "name_cn": "ApacheTomcat 8.0.0。RC1<8.0.32多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its self-reported version number, the Apache Tomcat service running on the remote host is 8.0.x prior to 8.0.32. It is, therefore, affected by multiple vulnerabilities : - A flaw exists due to a failure to invalidate a previous session ID when assigning an ID to a new session. An attacker can exploit this, via a crafted request that uses the requestedSessionSSL field to fixate the session ID, to ensure that the user authenticates with a known session ID, allowing the session to be subsequently hijacked. (CVE-2015-5346) - An information disclosure vulnerability exists in the Manager and Host Manager web applications due to a flaw in the index page when issuing redirects in response to unauthenticated requests for the root directory of the application. An unauthenticated, remote attacker can exploit this to gain access to the XSRF token information stored in the index page. (CVE-2015-5351) - An information disclosure vulnerability exists that allows a specially crafted web application to load the StatusManagerServlet. An attacker can exploit this to gain unauthorized access to a list of all deployed applications and a list of the HTTP request lines for all requests currently being processed. (CVE-2016-0706) - A security bypass vulnerability exists due to a flaw in the StandardManager, PersistentManager, and cluster implementations that is triggered when handling persistent sessions. An unauthenticated, remote attacker can exploit this, via a crafted object in a session, to bypass the security manager and execute arbitrary code. (CVE-2016-0714) - A flaw exists due to the setGlobalContext() method of ResourceLinkFactory being accessible to web applications even when run under a security manager. An unauthenticated, remote attacker can exploit this to inject malicious global context, allowing data owned by other web applications to be read or written to. (CVE-2016-0763) Note that Nessus has not attempted to exploit these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，在远程主机上运行的Apache Tomcat服务是8.0。x在8.0.32之前。因此，它受到多个漏洞的影响：-在为新会话分配ID时，由于未能使以前的会话ID无效而存在漏洞。攻击者可以通过使用requestedSessionSSL字段修复会话ID的精心编制的请求利用此漏洞进行攻击，以确保用户使用已知会话ID进行身份验证，从而允许会话随后被劫持。（CVE-2015-5346）-Manager和Host Manager web应用程序中存在信息泄露漏洞，这是因为在响应未经验证的应用程序根目录请求时，在索引页中存在缺陷。未经验证的远程攻击者可以利用此漏洞访问存储在索引页中的XSRF令牌信息。（CVE-2015-5351）-存在一个信息泄露漏洞，允许精心编制的web应用程序加载StatusManagerServlet。攻击者可以利用此漏洞获得对所有已部署应用程序列表和当前正在处理的所有请求的HTTP请求行列表的未经授权访问。（CVE-2016-0706）-由于处理持久会话时触发的StandardManager、PersistentManager和群集实现中的漏洞，存在安全绕过漏洞。未经验证的远程攻击者可以通过会话中的特制对象利用此漏洞绕过安全管理器并执行任意代码。（CVE-2016-0714）-由于ResourceLinkFactory的setGlobalContext（）方法即使在安全管理器下运行，web应用程序也可以访问该方法，因此存在缺陷。未经验证的远程攻击者可以利用此漏洞注入恶意全局上下文，从而允许读取或写入其他web应用程序拥有的数据。（CVE-2016-0763）请注意，Nessus并未试图利用这些问题，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Although version 8.0.31 fixes these issues, that version was not officially released, and the vendor recommends upgrading to 8.0.32 or later.",
        "solution_cn": "尽管版本8.0.31解决了这些问题，但该版本尚未正式发布，供应商建议升级到8.0.32或更高版本。",
        "cve": "CVE-2015-5346"
    },
    "102588": {
        "name_en": "Apache Tomcat 8.0.0.RC1 < 8.0.45 Cache Poisoning",
        "name_cn": "ApacheTomcat 8.0.0。RC1<8.0.45缓存中毒",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of Apache Tomcat installed on the remote host is 8.0.0.RC1 or later but prior to 8.0.45. It is, therefore, affected by a flaw in the CORS filter where the HTTP Vary header is not properly added. This allows a remote attacker to conduct client-side and server-side cache poisoning attacks. Note that Nessus has not attempted to exploit this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache Tomcat版本为8.0.0。RC1或更高版本，但在8.0.45之前。因此，它受到CORS筛选器中的一个缺陷的影响，该漏洞未正确添加HTTP Vary头。这使得远程攻击者能够进行客户端和服务器端缓存中毒攻击。请注意，Nessus并未试图利用此问题，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 8.0.45 or later.",
        "solution_cn": "升级至Apache Tomcat 8.0.45或更高版本。",
        "cve": "CVE-2017-7674"
    },
    "103697": {
        "name_en": "Apache Tomcat 8.0.0.RC1 < 8.0.47 Multiple Vulnerabilities",
        "name_cn": "ApacheTomcat 8.0.0。RC1<8.0.47多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Apache Tomcat installed on the remote host is 8.0.0.RC1 or later but prior to 8.0.47. It is, therefore, affected by an unspecified vulnerability when running with HTTP PUTs enabled (e.g. via setting the readonly initialization parameter of the Default to false) that makes it possible to upload a JSP file to the server via a specially crafted request. This JSP could then be requested and any code it contained would be executed by the server. Note that Nessus has not attempted to exploit this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache Tomcat版本为8.0.0。RC1或更高版本，但在8.0.47之前。因此，当在启用HTTP PUTs的情况下运行时（例如，通过将默认值的只读初始化参数设置为false），它会受到一个未指明的漏洞的影响，从而可以通过精心编制的请求将JSP文件上载到服务器。然后可以请求这个JSP，服务器将执行它包含的任何代码。请注意，Nessus并未试图利用此问题，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 8.0.47 or later.",
        "solution_cn": "升级到Apache Tomcat 8.0.47或更高版本。",
        "cve": "CVE-2017-12617"
    },
    "121123": {
        "name_en": "Apache Tomcat < 8.0.30 Directory Disclosure",
        "name_cn": "Apache Tomcat<8.0.30目录公开",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the Apache Tomcat instance listening on the remote host is prior to 8.0.30. It is, therefore, affected by an information disclosure vulnerability: - An information disclosure vulnerability exists due to a failure to enforce access restrictions when handling directory requests that are missing trailing slashes. An unauthenticated, remote attacker can exploit this to enumerate valid directories. (CVE-2015-5345) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，在远程主机上侦听的Apache Tomcat实例早于8.0.30。因此，它受到信息泄露漏洞的影响：-信息泄露漏洞的存在是因为在处理缺少尾部斜杠的目录请求时未能强制执行访问限制。未经验证的远程攻击者可以利用此漏洞枚举有效目录。（CVE-2015-5345）请注意，Nessus没有针对这些问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 8.0.30 or later.",
        "solution_cn": "升级至Apache Tomcat 8.0.30或更高版本。",
        "cve": "CVE-2015-5345"
    },
    "11071": {
        "name_en": "Multiple Web Server Encoded Space (%20) Request ASP Source Disclosure",
        "name_cn": "多个Web服务器编码空间（%20）请求ASP源公开",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "It appears possible to get the source code of the remote ASP scripts by appending a '%20' to the request. ASP source code usually contains sensitive information such as logins and passwords. This has been reported in Simple HTTPD (shttpd), Mono XSP for ASP.NET and vWebServer. This type of request may affect other web servers as well.",
        "describe_cn": "似乎可以通过向请求添加“%20”来获取远程ASP脚本的源代码。ASP源代码通常包含登录名和密码等敏感信息。这已经在Simple HTTPD（shttpd）和Mono XSP for ASP中报道过。NET和vWebServer。这种类型的请求也可能会影响其他web服务器。",
        "solution_en": "There is no known solution at this time.",
        "solution_cn": "目前还没有已知的解决方案。",
        "cve": "CVE-2001-1248"
    },
    "144050": {
        "name_en": "Apache Tomcat 9.x < 9.0.40 Information Disclosure",
        "name_cn": "Apache Tomcat 9。x<9.0.40信息披露",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.40. It is, therefore, affected by multiple vulnerabilities as referenced in the fixed_in_apache_tomcat_9.0.40_security-9 advisory. - When serving resources from a network location using the NTFS file system, Apache Tomcat versions 10.0.0-M1 to 10.0.0-M9, 9.0.0.M1 to 9.0.39, 8.5.0 to 8.5.59 and 7.0.0 to 7.0.106 were susceptible to JSP source code disclosure in some configurations. The root cause was the unexpected behaviour of the JRE API File.getCanonicalPath() which in turn was caused by the inconsistent behaviour of the Windows API (FindFirstFileW) in some circumstances. (CVE-2021-24122) - While investigating bug 64830 it was discovered that Apache Tomcat 10.0.0-M1 to 10.0.0-M9, 9.0.0-M1 to 9.0.39 and 8.5.0 to 8.5.59 could re-use an HTTP request header value from the previous stream received on an HTTP/2 connection for the request associated with the subsequent stream. While this would most likely lead to an error and the closure of the HTTP/2 connection, it is possible that information could leak between requests. (CVE-2020-17527) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.40。因此，它受到apache tomcat 9.0.40_security-9咨询中提到的多个漏洞的影响。-当使用NTFS文件系统从网络位置提供资源时，Apache Tomcat版本10.0.0-M1到10.0.0-M9，9.0.0。M1至9.0.39、8.5.0至8.5.59和7.0.0至7.0.106在某些配置中易受JSP源代码泄露的影响。根本原因是JRE API文件的意外行为。getCanonicalPath（），这反过来又是由Windows API（FindFirstFileW）在某些情况下的不一致行为引起的。（CVE-2021-24122）-在调查错误64830时，发现Apache Tomcat 10.0.0-M1至10.0.0-M9、9.0.0-M1至9.0.39和8.5.0至8.5.59可以将HTTP/2连接上收到的前一个流中的HTTP请求头值重新用于与后续流关联的请求。虽然这很可能会导致错误并关闭HTTP/2连接，但请求之间可能会泄漏信息。（CVE-2020-17527）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.40 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.40或更高版本。",
        "cve": "CVE-2020-17527"
    },
    "147164": {
        "name_en": "Apache Tomcat 9.0.0.M1 < 9.0.43 Multiple Vulnerabilities",
        "name_cn": "ApacheTomcat 9.0.0。M1<9.0.43多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.43. It is, therefore, affected by multiple vulnerabilities as referenced in the vendor advisory. - An information disclosure vulnerability exists when responding to new h2c connection requests, Apache Tomcat versions 9.0.0.M1 to 9.0.41 could duplicate request headers and a limited amount of request body from one request to another meaning user A and user B could both see the results of user A's request. (CVE-2021-25122) - when using Apache Tomcat 10.0.0-M1 to 10.0.0, 9.0.0.M1 to 9.0.41, 8.5.0 to 8.5.61 or 7.0.0. to 7.0.107 with a configuration edge case that was highly unlikely to be used, the Tomcat instance was still vulnerable to CVE-2020-9494. Note that both the previously published prerequisites for CVE-2020-9484 and the previously published mitigations for CVE-2020-9484 also apply to this issue. (CVE-2021-25329) - A remote code execution vulnerability via deserialization exists when using Apache Tomcat 9.0.0.M1 to 9.0.41 with a configuration edge case that was highly unlikely to be used, the Tomcat instance was still vulnerable to CVE-2020-9494. Note that both the previously published prerequisites for CVE-2020-9484 and the previously published mitigations for CVE-2020-9484 also apply to this issue. (CVE-2021-25329) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.43。因此，它受到供应商建议中提到的多个漏洞的影响。-在响应新的h2c连接请求（Apache Tomcat 9.0.0版）时，存在信息泄露漏洞。M1到9.0.41可能会在一个请求到另一个请求之间复制请求头和数量有限的请求体，这意味着用户a和用户B都可以看到用户a请求的结果。（CVE-2021-25122）-当使用Apache Tomcat 10.0.0-M1到10.0.0，9.0.0时。M1至9.0.41、8.5.0至8.5.61或7.0.0。到7.0.107，配置边缘情况极不可能被使用，Tomcat实例仍然容易受到CVE-2020-9494的攻击。请注意，之前发布的CVE-2020-9484先决条件和之前发布的CVE-2020-9484缓解措施也适用于本期。（CVE-2021-25329）-使用Apache Tomcat 9.0.0时，存在通过反序列化的远程代码执行漏洞。M1到9.0.41由于配置边缘情况极不可能被使用，Tomcat实例仍然容易受到CVE-2020-9494的攻击。请注意，之前发布的CVE-2020-9484先决条件和之前发布的CVE-2020-9484缓解措施也适用于本期。（CVE-2021-25329）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.43 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.43或更高版本。",
        "cve": "CVE-2021-25122"
    },
    "152182": {
        "name_en": "Apache Tomcat 9.0.0.M1 < 9.0.48 vulnerability",
        "name_cn": "ApacheTomcat 9.0.0。M1<9.0.48脆弱性",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.48. It is, therefore, affected by a vulnerability as referenced in the fixed_in_apache_tomcat_9.0.48_security-9 advisory. - Apache Tomcat 10.0.0-M1 to 10.0.6, 9.0.0.M1 to 9.0.46 and 8.5.0 to 8.5.66 did not correctly parse the HTTP transfer-encoding request header in some circumstances leading to the possibility to request smuggling when used with a reverse proxy. Specifically: - Tomcat incorrectly ignored the transfer encoding header if the client declared it would only accept an HTTP/1.0 response; - Tomcat honoured the identify encoding; and - Tomcat did not ensure that, if present, the chunked encoding was the final encoding. (CVE-2021-33037) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.48。因此，它受到apache_tomcat_9.0.48_security-9 advisory中的fixed_中引用的漏洞的影响。-ApacheTomcat 10.0.0-M1到10.0.6,9.0.0。M1至9.0.46和8.5.0至8.5.66在某些情况下未正确解析HTTP传输编码请求头，导致在与反向代理一起使用时可能会请求走私。具体来说：-如果客户端声明只接受HTTP/1.0响应，Tomcat错误地忽略了传输编码头；-Tomcat尊重身份编码；和-Tomcat没有确保，如果存在，分块编码就是最终编码。（CVE-2021-33037）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.48 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.48或更高版本。",
        "cve": "CVE-2021-33037"
    },
    "153953": {
        "name_en": "SSH Weak Key Exchange Algorithms Enabled",
        "name_cn": "启用SSH弱密钥交换算法",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The remote SSH server is configured to allow key exchange algorithms which are considered weak. This is based on the IETF draft document Key Exchange (KEX) Method Updates and Recommendations for Secure Shell (SSH) draft-ietf-curdle-ssh-kex-sha2-20. Section 4 lists guidance on key exchange algorithms that SHOULD NOT and MUST NOT be enabled. This includes: diffie-hellman-group-exchange-sha1 diffie-hellman-group1-sha1 gss-gex-sha1-* gss-group1-sha1-* gss-group14-sha1-* rsa1024-sha1 Note that this plugin only checks for the options of the SSH server, and it does not check for vulnerable software versions.",
        "describe_cn": "远程SSH服务器被配置为允许密钥交换算法被认为很弱。这是基于IETF草稿文档密钥交换（KEX）方法更新和安全Shell（SSH）建议草稿-IETF-curdle-SSH-KEX-sha2-20。第4节列出了不应该也不应该启用的密钥交换算法指南。这包括：diffie-hellman-group-exchange-sha1 diffie-hellman-group1-sha1 gss-gex-sha1-*gss-group1-sha1-*gss-group14-sha1-*rsa1024-sha1请注意，该插件只检查SSH服务器的选项，不检查易受攻击的软件版本。",
        "solution_en": "Contact the vendor or consult product documentation to disable the weak algorithms.",
        "solution_cn": "联系供应商或查阅产品文档以禁用弱算法。",
        "cve": ""
    },
    "152183": {
        "name_en": "Apache Tomcat 8.5.0 < 8.5.68 vulnerability",
        "name_cn": "Apache Tomcat 8.5.0<8.5.68漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 8.5.68. It is, therefore, affected by a vulnerability as referenced in the fixed_in_apache_tomcat_8.5.68_security-8 advisory. - Apache Tomcat 10.0.0-M1 to 10.0.6, 9.0.0.M1 to 9.0.46 and 8.5.0 to 8.5.66 did not correctly parse the HTTP transfer-encoding request header in some circumstances leading to the possibility to request smuggling when used with a reverse proxy. Specifically: - Tomcat incorrectly ignored the transfer encoding header if the client declared it would only accept an HTTP/1.0 response; - Tomcat honoured the identify encoding; and - Tomcat did not ensure that, if present, the chunked encoding was the final encoding. (CVE-2021-33037) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于8.5.68。因此，它受到apache_tomcat_8.5.68_security-8咨询中提到的漏洞的影响。-ApacheTomcat 10.0.0-M1到10.0.6,9.0.0。M1至9.0.46和8.5.0至8.5.66在某些情况下未正确解析HTTP传输编码请求头，导致在与反向代理一起使用时可能会请求走私。具体来说：-如果客户端声明只接受HTTP/1.0响应，Tomcat错误地忽略了传输编码头；-Tomcat尊重身份编码；和-Tomcat没有确保，如果存在，分块编码就是最终编码。（CVE-2021-33037）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 8.5.68 or later.",
        "solution_cn": "升级至Apache Tomcat 8.5.68或更高版本。",
        "cve": "CVE-2021-33037"
    },
    "126245": {
        "name_en": "Apache Tomcat 9.0.0.M1 < 9.0.20 DoS",
        "name_cn": "ApacheTomcat 9.0.0。M1<9.0.20 DoS",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.20. It is, therefore, affected by a vulnerability as referenced in the fixed_in_apache_tomcat_9.0.20_security-9 advisory. - The fix for CVE-2019-0199 was incomplete and did not address HTTP/2 connection window exhaustion on write. By not sending WINDOW_UPDATE messages for the connection window (stream 0) clients were able to cause server-side threads to block eventually leading to thread exhaustion and a DoS. (CVE-2019-10072) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.20。因此，它受到apache_tomcat_9.0.20_security-9 advisory中的fixed_中引用的漏洞的影响。-CVE-2019-0199的修复程序不完整，未解决写入时HTTP/2连接窗口耗尽的问题。通过不为连接窗口（流0）发送窗口更新消息，客户端能够导致服务器端线程阻塞，最终导致线程耗尽和DoS。（CVE-2019-10072）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.20 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.20或更高版本。",
        "cve": "CVE-2019-0199"
    },
    "132419": {
        "name_en": "Apache Tomcat 9.0.0.M1 < 9.0.30 Privilege Escalation Vulnerability",
        "name_cn": "ApacheTomcat 9.0.0。M1<9.0.30权限升级漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.30. It is, therefore, affected by a privilege escalation vulnerability as referenced in the 'Fixed in Apache Tomcat 9.0.30' advisory. - When using FORM authentication there was a narrow window where an attacker could perform a session fixation attack. The window was considered too narrow for an exploit to be practical but, erring on the side of caution, this issue has been treated as a security vulnerability. (CVE-2019-17563) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.30。因此，它受到“在Apache Tomcat 9.0.30中修复”建议中提到的权限升级漏洞的影响。-使用表单身份验证时，存在一个狭窄的窗口，攻击者可以在其中执行会话固定攻击。该窗口被认为太窄，无法进行实用的攻击，但出于谨慎，该问题已被视为安全漏洞。（CVE-2019-17563）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.30 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.30或更高版本。",
        "cve": "CVE-2019-17563"
    },
    "136806": {
        "name_en": "Apache Tomcat 9.0.0 < 9.0.35 Remote Code Execution",
        "name_cn": "Apache Tomcat 9.0.0<9.0.35远程代码执行",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.35. It is, therefore, affected by a remote code execution vulnerability as referenced in the fixed_in_apache_tomcat_9.0.35_security-9 advisory. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.35。因此，它受到apache tomcat 9.0.35_security-9建议中提到的远程代码执行漏洞的影响。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.35 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.35或更高版本。",
        "cve": "CVE-2020-9484"
    },
    "138098": {
        "name_en": "Apache Tomcat 9.0.0.M1 < 9.0.36 DoS",
        "name_cn": "ApacheTomcat 9.0.0。M1<9.0.36 DoS",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.36. It is, therefore, affected by a vulnerability as referenced in the fixed_in_apache_tomcat_9.0.36_security-9 advisory. - A specially crafted sequence of HTTP/2 requests could trigger high CPU usage for several seconds. If a sufficient number of such requests were made on concurrent HTTP/2 connections, the server could become unresponsive. (CVE-2020-11996) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.36。因此，它受到apache_tomcat_9.0.36_security-9 advisory中的fixed_中引用的漏洞的影响。-精心编制的HTTP/2请求序列可能会在几秒钟内触发高CPU使用率。如果在并发HTTP/2连接上发出足够数量的此类请求，服务器可能会失去响应。（CVE-2020-11996）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.36 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.36或更高版本。",
        "cve": "CVE-2020-11996"
    },
    "138591": {
        "name_en": "Apache Tomcat 9.0.0.M1 < 9.0.37 Multiple Vulnerabilities",
        "name_cn": "ApacheTomcat 9.0.0。M1<9.0.37多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.37. It is, therefore, affected by multiple vulnerabilities as referenced in the fixed_in_apache_tomcat_9.0.37_security-9 advisory. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.37。因此，它受到多个漏洞的影响，如apache_tomcat_9.0.37_security-9咨询中所述。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.37 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.37或更高版本。",
        "cve": "CVE-2020-13934"
    },
    "83527": {
        "name_en": "Apache Tomcat 8.0.x < 8.0.21 Multiple Vulnerabilities (FREAK)",
        "name_cn": "ApacheTomcat 8.0。x<8.0.21多个漏洞（畸形）",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its self-reported version number, the Apache Tomcat server listening on the remote host is 8.0.x prior to 8.0.21. It is, therefore, affected by the following vulnerabilities : - A NULL pointer dereference flaw exists when the SSLv3 option isn't enabled and an SSLv3 ClientHello is received. This allows a remote attacker, using an unexpected handshake, to crash the daemon, resulting in a denial of service. (CVE-2014-3569) - The BIGNUM squaring (BN_sqr) implementation does not properly calculate the square of a BIGNUM value. This allows remote attackers to defeat cryptographic protection mechanisms. (CVE-2014-3570) - A NULL pointer dereference flaw exists with dtls1_get_record() when handling DTLS messages. A remote attacker, using a specially crafted DTLS message, can cause a denial of service. (CVE-2014-3571) - A flaw exists with ECDH handshakes when using an ECDSA certificate without a ServerKeyExchange message. This allows a remote attacker to trigger a loss of forward secrecy from the ciphersuite. (CVE-2014-3572) - A flaw exists when accepting non-DER variations of certificate signature algorithms and signature encodings due to a lack of enforcement of matches between signed and unsigned portions. A remote attacker, by including crafted data within a certificate's unsigned portion, can bypass fingerprint-based certificate-blacklist protection mechanisms. (CVE-2014-8275) - A security feature bypass vulnerability, known as FREAK (Factoring attack on RSA-EXPORT Keys), exists due to the support of weak EXPORT_RSA cipher suites with keys less than or equal to 512 bits. A man-in-the-middle attacker may be able to downgrade the SSL/TLS connection to use EXPORT_RSA cipher suites which can be factored in a short amount of time, allowing the attacker to intercept and decrypt the traffic. (CVE-2015-0204) - A flaw exists when accepting DH certificates for client authentication without the CertificateVerify message. This allows a remote attacker to authenticate to the service without a private key. (CVE-2015-0205) - A memory leak occurs in dtls1_buffer_record() when handling a saturation of DTLS records containing the same number sequence but for the next epoch. This allows a remote attacker to cause a denial of service. (CVE-2015-0206) - A use-after-free condition exists in the d2i_ECPrivateKey() function due to improper processing of malformed EC private key files during import. A remote attacker can exploit this to dereference or free already freed memory, resulting in a denial of service or other unspecified impact. (CVE-2015-0209) - An invalid read flaw exists in the ASN1_TYPE_cmp() function due to improperly performed boolean-type comparisons. A remote attacker can exploit this, via a crafted X.509 certificate to an endpoint that uses the certificate-verification feature, to cause an invalid read operation, resulting in a denial of service. (CVE-2015-0286) - A flaw exists in the ASN1_item_ex_d2i() function due to a failure to reinitialize 'CHOICE' and 'ADB' data structures when reusing a structure in ASN.1 parsing. This allows a remote attacker to cause an invalid write operation and memory corruption, resulting in a denial of service. (CVE-2015-0287) - A NULL pointer dereference flaw exists in the X509_to_X509_REQ() function due to improper processing of certificate keys. This allows a remote attacker, via a crafted X.509 certificate, to cause a denial of service. (CVE-2015-0288) - A NULL pointer dereference flaw exists in the PKCS#7 parsing code due to incorrect handling of missing outer ContentInfo. This allows a remote attacker, using an application that processes arbitrary PKCS#7 data and providing malformed data with ASN.1 encoding, to cause a denial of service. (CVE-2015-0289) - A flaw exists in servers that both support SSLv2 and enable export cipher suites due to improper implementation of SSLv2. A remote attacker can exploit this, via a crafted CLIENT-MASTER-KEY message, to cause a denial of service. (CVE-2015-0293) Note that Nessus has not attempted to exploit these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，在远程主机上监听的Apache Tomcat服务器是8.0。x在8.0.21之前。因此，它受到以下漏洞的影响：-当未启用SSLv3选项且收到SSLv3 ClientHello时，存在空指针解引用漏洞。这允许远程攻击者使用意外握手使守护程序崩溃，从而导致拒绝服务。（CVE-2014-3569）-BIGNUM平方（BN_sqr）实现无法正确计算BIGNUM值的平方。这使得远程攻击者能够破坏加密保护机制。（CVE-2014-3570）-处理DTLS消息时，dtls1_get_record（）存在空指针解引用缺陷。远程攻击者使用精心编制的DTLS消息可导致拒绝服务。（CVE-2014-3571）-使用没有ServerKeyExchange消息的ECDSA证书时，ECDH握手存在缺陷。这允许远程攻击者触发密码套件的前向保密性丢失。（CVE-2014-3572）-在接受证书签名算法和签名编码的非顺序变体时，由于签名和未签名部分之间缺乏匹配的强制执行，存在缺陷。远程攻击者通过在证书的未签名部分包含精心编制的数据，可以绕过基于指纹的证书黑名单保护机制。（CVE-2014-8275）-由于支持密钥小于或等于512位的弱导出RSA密码套件，存在一个安全功能绕过漏洞，称为FREAK（对RSA-EXPORT密钥的因式分解攻击）。中间人攻击者可能会降级SSL/TLS连接，以使用可在短时间内分解的导出RSA密码套件，从而允许攻击者拦截和解密流量。（CVE-2015-0204）-在没有CertificateVerify消息的情况下接受用于客户端身份验证的DH证书时存在缺陷。这允许远程攻击者在没有私钥的情况下对服务进行身份验证。（CVE-2015-0205）-当处理包含相同数字序列但用于下一个历元的DTLS记录饱和时，dtls1_buffer_record（）中发生内存泄漏。这允许远程攻击者造成拒绝服务。（CVE-2015-0206）-由于导入过程中对格式错误的EC私钥文件处理不当，d2i_ECPrivateKey（）函数中存在释放后使用的情况。远程攻击者可以利用此漏洞解除引用或释放已释放的内存，从而导致拒绝服务或其他未指明的影响。（CVE-2015-0209）-由于未正确执行布尔类型比较，ASN1_TYPE_cmp（）函数中存在无效读取缺陷。远程攻击者可以通过特制的X.509证书攻击使用证书验证功能的端点，从而导致无效的读取操作，从而导致拒绝服务。（CVE-2015-0286）-ASN1_item_ex_d2i（）函数中存在缺陷，原因是在ASN中重用结构时未能重新初始化“CHOICE”和“ADB”数据结构。1.解析。这使得远程攻击者能够导致无效的写入操作和内存损坏，从而导致拒绝服务。（CVE-2015-0287）-由于证书密钥处理不当，X509_to_X509_REQ（）函数中存在空指针解引用缺陷。这允许远程攻击者通过特制的X.509证书造成拒绝服务。（CVE-2015-0288）-PKCS#7解析代码中存在一个空指针解引用缺陷，原因是对缺少的外部ContentInfo的错误处理。这允许远程攻击者使用处理任意PKCS#7数据的应用程序，并使用ASN提供格式错误的数据。1编码，导致拒绝服务。（CVE-2015-0289）-由于SSLv2的不当实现，支持SSLv2并启用导出密码套件的服务器中存在一个缺陷。远程攻击者可以通过特制的CLIENT-MASTER-KEY消息利用此漏洞造成拒绝服务。（CVE-2015-0293）请注意，Nessus并未试图利用这些问题，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 8.0.21 or later.",
        "solution_cn": "升级至Apache Tomcat 8.0.21或更高版本。",
        "cve": "CVE-2014-3569"
    },
    "105291": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2n Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2<1.0.2n多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.x prior to 1.0.2n. It is, therefore, affected by multiple vulnerabilities that allow potential recovery of private key information or failure to properly encrypt data.",
        "describe_cn": "根据它的横幅，在远程主机上运行的OpenSSL版本是1.0。x在1.0.2n之前。因此，它受到多个漏洞的影响，这些漏洞可能会导致私钥信息恢复或数据无法正确加密。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2n or later.",
        "solution_cn": "升级至OpenSSL 1.0.2n或更高版本。",
        "cve": "CVE-2017-3737"
    },
    "128115": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2t Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2<1.0.2t多个漏洞",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The version of tested product installed on the remote host is prior to tested version. It is, therefore, affected by multiple vulnerabilities : - Normally in OpenSSL EC groups always have a co-factor present and this is used in side channel resistant code paths. However, in some cases, it is possible to construct a group using explicit parameters (instead of using a named curve). In those cases it is possible that such a group does not have the cofactor present. This can occur even where all the parameters match a known named curve. If such a curve is used then OpenSSL falls back to non-side channel resistant code paths which may result in full key recovery during an ECDSA signature operation. In order to be vulnerable an attacker would have to have the ability to time the creation of a large number of signatures where explicit parameters with no co-factor present are in use by an application using libcrypto. For the avoidance of doubt libssl is not vulnerable because explicit parameters are never used. OpenSSL versions 1.1.1, 1.1.0 and 1.0.2 are affected by this issue. (CVE-2019-1547) - OpenSSL has internal defaults for a directory tree where it can find a configuration file as well as certificates used for verification in TLS. This directory is most commonly referred to as OPENSSLDIR, and is configurable with the --prefix / --openssldir configuration options. For OpenSSL versions 1.1.0 and 1.1.1, the mingw configuration targets assume that resulting programs and libraries are installed in a Unix-like environment and the default prefix for program installation as well as for OPENSSLDIR should be '/usr/local'. However, mingw programs are Windows programs, and as such, find themselves looking at sub-directories of 'C:/usr/local', which may be world writable, which enables untrusted users to modify OpenSSL's default configuration, insert CA certificates, modify (or even replace) existing engine modules, etc. For OpenSSL 1.0.2, '/usr/local/ssl' is used as default for OPENSSLDIR on all Unix and Windows targets, including Visual C builds. However, some build instructions for the diverse Windows targets on 1.0.2 encourage you to specify your own --prefix. OpenSSL versions 1.1.1, 1.1.0 and 1.0.2 are affected by this issue. Due to the limited scope of affected deployments this has been assessed as low severity and therefore we are not creating new releases at this time. (CVE-2019-1552) - In situations where an attacker receives automated notification of the success or failure of a decryption attempt an attacker, after sending a very large number of messages to be decrypted, can recover a CMS/PKCS7 transported encryption key or decrypt any RSA encrypted message that was encrypted with the public RSA key, using a Bleichenbacher padding oracle attack. Applications are not affected if they use a certificate together with the private RSA key to the CMS_decrypt or PKCS7_decrypt functions to select the correct recipient info to decrypt. (CVE-2019-1563) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的测试产品版本早于测试版本。因此，它受到多个漏洞的影响：-通常在OpenSSL EC组中，总是存在一个共同因素，这用于抗侧通道的代码路径。但是，在某些情况下，可以使用显式参数（而不是使用命名曲线）构造组。在这些情况下，这类群体可能不存在辅因子。即使所有参数都与已知的命名曲线匹配，也可能发生这种情况。如果使用这种曲线，那么OpenSSL会退回到非侧通道抗代码路径，这可能会导致ECDSA签名操作期间的完整密钥恢复。为了容易受到攻击，攻击者必须能够在使用libcrypto的应用程序使用显式参数且不存在辅因子的情况下，对大量签名的创建进行计时。为避免疑问，libssl不易受攻击，因为从未使用显式参数。OpenSSL版本1.1.1、1.1.0和1.0.2受此问题影响。（CVE-2019-1547）-OpenSSL具有目录树的内部默认值，在目录树中可以找到配置文件以及用于TLS中验证的证书。该目录通常被称为OPENSSLDIR，可以通过--prefix/--OPENSSLDIR配置选项进行配置。对于OpenSSL版本1.1.0和1.1.1，mingw配置目标假定生成的程序和库安装在类似Unix的环境中，程序安装和OPENSSLDIR的默认前缀应为“/usr/local”。然而，mingw程序是Windows程序，因此，他们发现自己正在查看“C:/usr/local”的子目录，这可能是世界范围内可写的，这使不受信任的用户能够修改OpenSSL的默认配置、插入CA证书、修改（甚至替换）现有引擎模块，等等。对于OpenSSL 1.0.2，“/usr/local/ssl”被用作所有Unix和Windows目标（包括Visual C构建）上OPENSSLDIR的默认值。然而，1.0.2上针对不同Windows目标的一些构建说明鼓励您指定自己的--prefix。OpenSSL版本1.1.1、1.1.0和1.0.2受此问题影响。由于受影响部署的范围有限，这已被评估为低严重性，因此我们目前不创建新版本。（CVE-2019-1552）-在攻击者收到解密尝试成功或失败的自动通知的情况下，攻击者在发送大量要解密的消息后，可以恢复CMS/PKCS7传输的加密密钥或解密任何使用RSA公钥加密的RSA加密消息，使用Bleichenbacher填充oracle攻击。如果应用程序将证书与专用RSA密钥一起用于CMS_decrypt或PKCS7_decrypt函数，以选择要解密的正确收件人信息，则不会受到影响。（CVE-2019-1563）请注意，Nessus没有针对这些问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2t or later.",
        "solution_cn": "升级至OpenSSL 1.0.2t或更高版本。",
        "cve": "CVE-2019-1547"
    },
    "132726": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2u Procedure Overflow Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2u过程溢出漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2u. It is, therefore, affected by a vulnerability as referenced in the 1.0.2u advisory. - There is an overflow bug in the x64_64 Montgomery squaring procedure used in exponentiation with 512-bit moduli. No EC algorithms are affected. Analysis suggests that attacks against 2-prime RSA1024, 3-prime RSA1536, and DSA1024 as a result of this defect would be very difficult to perform and are not believed likely. Attacks against DH512 are considered just feasible. However, for an attack the target would have to re-use the DH512 private key, which is not recommended anyway. Also applications directly using the low level API BN_mod_exp may be affected if they use BN_FLG_CONSTTIME. Fixed in OpenSSL 1.1.1e-dev (Affected 1.1.1-1.1.1d). Fixed in OpenSSL 1.0.2u-dev (Affected 1.0.2-1.0.2t). (CVE-2019-1551) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2u。因此，它受到1.0.2u建议中提到的漏洞的影响。-x64_64 Montgomery平方过程中存在溢出错误，该过程用于512位模的幂运算。没有EC算法受到影响。分析表明，由于该缺陷，对2-prime RSA1024、3-prime RSA1536和DSA1024的攻击将非常难以执行，而且据信不太可能。针对DH512的攻击被认为是可行的。但是，对于攻击，目标必须重新使用DH512私钥，无论如何都不建议这样做。此外，如果直接使用低级API BN_mod_exp的应用程序使用BN_FLG_CONSTTIME，可能会受到影响。在OpenSSL 1.1.1e-dev中修复（受影响1.1.1-1.1.1d）。在OpenSSL 1.0.2u-dev中修复（受影响1.0.2-1.0.2t）。（CVE-2019-1551）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2u or later.",
        "solution_cn": "升级至OpenSSL 1.0.2u或更高版本。",
        "cve": "CVE-2019-1551"
    },
    "144053": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2x Null Pointer Dereference Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2x空指针解引用漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of tested product installed on the remote host is prior to tested version. It is, therefore, affected by a vulnerability as referenced in the 1.0.2x advisory. - The X.509 GeneralName type is a generic type for representing different types of names. One of those name types is known as EDIPartyName. OpenSSL provides a function GENERAL_NAME_cmp which compares different instances of a GENERAL_NAME to see if they are equal or not. This function behaves incorrectly when both GENERAL_NAMEs contain an EDIPARTYNAME. A NULL pointer dereference and a crash may occur leading to a possible denial of service attack. OpenSSL itself uses the GENERAL_NAME_cmp function for two purposes: 1) Comparing CRL distribution point names between an available CRL and a CRL distribution point embedded in an X509 certificate 2) When verifying that a timestamp response token signer matches the timestamp authority name (exposed via the API functions TS_RESP_verify_response and TS_RESP_verify_token) If an attacker can control both items being compared then that attacker could trigger a crash. For example if the attacker can trick a client or server into checking a malicious certificate against a malicious CRL then this may occur. Note that some applications automatically download CRLs based on a URL embedded in a certificate. This checking happens prior to the signatures on the certificate and CRL being verified. OpenSSL's s_server, s_client and verify tools have support for the -crl_download option which implements automatic CRL downloading and this attack has been demonstrated to work against those tools. Note that an unrelated bug means that affected versions of OpenSSL cannot parse or construct correct encodings of EDIPARTYNAME. However it is possible to construct a malformed EDIPARTYNAME that OpenSSL's parser will accept and hence trigger this attack. All OpenSSL 1.1.1 and 1.0.2 versions are affected by this issue. Other OpenSSL releases are out of support and have not been checked. Fixed in OpenSSL 1.1.1i (Affected 1.1.1-1.1.1h). Fixed in OpenSSL 1.0.2x (Affected 1.0.2-1.0.2w). (CVE-2020-1971) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的测试产品版本早于测试版本。因此，它受到1.0.2x建议中提到的漏洞的影响。-X.509 GeneralName类型是一种泛型类型，用于表示不同类型的名称。其中一种名称类型称为EdPartyName。OpenSSL提供了一个函数GENERAL_NAME_cmp，它比较GENERAL_NAME的不同实例，看看它们是否相等。当两个通用名称都包含EDIPARTYNAME时，此函数的行为不正确。可能会发生空指针解引用和崩溃，从而导致可能的拒绝服务攻击。OpenSSL本身使用GENERAL_NAME_cmp函数有两个目的：1）比较可用CRL和X509证书中嵌入的CRL分发点之间的CRL分发点名称2）验证时间戳响应令牌签名者是否与时间戳权限名称匹配（通过API函数TS_RESP_verify_response和TS_RESP_verify_token公开）如果攻击者可以控制正在比较的两个项目，则攻击者可能会触发崩溃。例如，如果攻击者可以诱使客户端或服务器根据恶意CRL检查恶意证书，则可能会发生这种情况。请注意，有些应用程序会根据证书中嵌入的URL自动下载CRL。该检查在验证证书和CRL上的签名之前进行。OpenSSL的_服务器、s_客户端和验证工具都支持-crl_下载选项，该选项实现了自动crl下载，并且已证明该攻击可针对这些工具。请注意，一个不相关的错误意味着受影响的OpenSSL版本无法解析或构造正确的EDIPARTYNAME编码。然而，有可能构造一个格式错误的ePartyName，OpenSSL的解析器将接受它，从而触发此攻击。所有OpenSSL 1.1.1和1.0.2版本都受此问题影响。其他OpenSSL版本不受支持，尚未检查。在OpenSSL 1.1.1i中修复（受1.1.1-1.1.1h影响）。在OpenSSL 1.0.2x中修复（受影响1.0.2-1.0.2w）。（CVE-2020-1971）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2x or later.",
        "solution_cn": "升级至OpenSSL 1.0.2x或更高版本。",
        "cve": "CVE-2020-1971"
    },
    "146374": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2w Information Disclosure",
        "name_cn": "OpenSSL 1.0.2<1.0.2w信息披露",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The version of OpenSSL installed on the remote host is 1.0.2 prior to 1.0.2w. It is, therefore, affected by a vulnerability as referenced in the 1.0.2w advisory. The Raccoon attack exploits a flaw in the TLS specification which can lead to an attacker being able to compute the pre-master secret in connections which have used a Diffie-Hellman (DH) based ciphersuite. In such a case this would result in the attacker being able to eavesdrop on all encrypted communications sent over that TLS connection. The attack can only be exploited if an implementation re-uses a DH secret across multiple TLS connections. Note that this issue only impacts DH ciphersuites and not ECDH ciphersuites. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本是1.0.2之前的1.0.2w。因此，它受到1.0.2w建议中提到的漏洞的影响。浣熊攻击利用TLS规范中的一个漏洞，该漏洞可能导致攻击者能够在使用基于Diffie Hellman（DH）的密码套件的连接中计算主密钥前的秘密。在这种情况下，这将导致攻击者能够窃听通过该TLS连接发送的所有加密通信。只有在实现跨多个TLS连接重新使用DH机密时，才能利用该攻击。请注意，此问题仅影响DH ciphersuites，而不影响ECDH ciphersuites。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2w or later.",
        "solution_cn": "升级至OpenSSL版本1.0.2w或更高版本。",
        "cve": "CVE-2020-1968"
    },
    "146591": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2y Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2<1.0.2y多个漏洞",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The version of tested product installed on the remote host is prior to tested version. It is, therefore, affected by multiple vulnerabilities as referenced in the 1.0.2y advisory. - The OpenSSL public API function X509_issuer_and_serial_hash() attempts to create a unique hash value based on the issuer and serial number data contained within an X509 certificate. However it fails to correctly handle any errors that may occur while parsing the issuer field (which might occur if the issuer field is maliciously constructed). This may subsequently result in a NULL pointer deref and a crash leading to a potential denial of service attack. The function X509_issuer_and_serial_hash() is never directly called by OpenSSL itself so applications are only vulnerable if they use this function directly and they use it on certificates that may have been obtained from untrusted sources. OpenSSL versions 1.1.1i and below are affected by this issue. Users of these versions should upgrade to OpenSSL 1.1.1j. OpenSSL versions 1.0.2x and below are affected by this issue. However OpenSSL 1.0.2 is out of support and no longer receiving public updates. Premium support customers of OpenSSL 1.0.2 should upgrade to 1.0.2y. Other users should upgrade to 1.1.1j. Fixed in OpenSSL 1.1.1j (Affected 1.1.1-1.1.1i). Fixed in OpenSSL 1.0.2y (Affected 1.0.2-1.0.2x). (CVE-2021-23841) - Calls to EVP_CipherUpdate, EVP_EncryptUpdate and EVP_DecryptUpdate may overflow the output length argument in some cases where the input length is close to the maximum permissable length for an integer on the platform. In such cases the return value from the function call will be 1 (indicating success), but the output length value will be negative. This could cause applications to behave incorrectly or crash. OpenSSL versions 1.1.1i and below are affected by this issue. Users of these versions should upgrade to OpenSSL 1.1.1j. OpenSSL versions 1.0.2x and below are affected by this issue. However OpenSSL 1.0.2 is out of support and no longer receiving public updates. Premium support customers of OpenSSL 1.0.2 should upgrade to 1.0.2y. Other users should upgrade to 1.1.1j. Fixed in OpenSSL 1.1.1j (Affected 1.1.1-1.1.1i). Fixed in OpenSSL 1.0.2y (Affected 1.0.2-1.0.2x). (CVE-2021-23840) - OpenSSL 1.0.2 supports SSLv2. If a client attempts to negotiate SSLv2 with a server that is configured to support both SSLv2 and more recent SSL and TLS versions then a check is made for a version rollback attack when unpadding an RSA signature. Clients that support SSL or TLS versions greater than SSLv2 are supposed to use a special form of padding. A server that supports greater than SSLv2 is supposed to reject connection attempts from a client where this special form of padding is present, because this indicates that a version rollback has occurred (i.e. both client and server support greater than SSLv2, and yet this is the version that is being requested). The implementation of this padding check inverted the logic so that the connection attempt is accepted if the padding is present, and rejected if it is absent. This means that such as server will accept a connection if a version rollback attack has occurred. Further the server will erroneously reject a connection if a normal SSLv2 connection attempt is made. Only OpenSSL 1.0.2 servers from version 1.0.2s to 1.0.2x are affected by this issue. In order to be vulnerable a 1.0.2 server must: 1) have configured SSLv2 support at compile time (this is off by default), 2) have configured SSLv2 support at runtime (this is off by default), 3) have configured SSLv2 ciphersuites (these are not in the default ciphersuite list) OpenSSL 1.1.1 does not have SSLv2 support and therefore is not vulnerable to this issue. The underlying error is in the implementation of the RSA_padding_check_SSLv23() function. This also affects the RSA_SSLV23_PADDING padding mode used by various other functions. Although 1.1.1 does not support SSLv2 the RSA_padding_check_SSLv23() function still exists, as does the RSA_SSLV23_PADDING padding mode. Applications that directly call that function or use that padding mode will encounter this issue. However since there is no support for the SSLv2 protocol in 1.1.1 this is considered a bug and not a security issue in that version. OpenSSL 1.0.2 is out of support and no longer receiving public updates. Premium support customers of OpenSSL 1.0.2 should upgrade to 1.0.2y. Other users should upgrade to 1.1.1j. Fixed in OpenSSL 1.0.2y (Affected 1.0.2s-1.0.2x). (CVE-2021-23839) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的测试产品版本早于测试版本。因此，它受到1.0.2y咨询中提到的多个漏洞的影响。-OpenSSL公共API函数X509_issuer_和_serial_hash（）尝试基于X509证书中包含的颁发者和序列号数据创建唯一的哈希值。但是，它无法正确处理解析issuer字段时可能发生的任何错误（如果issuer字段是恶意构造的，则可能会发生错误）。这可能会导致空指针失效和崩溃，从而导致潜在的拒绝服务攻击。OpenSSL本身从未直接调用函数X509_issuer_和_serial_hash（），因此只有当应用程序直接使用该函数，并在可能从不受信任的来源获取的证书上使用该函数时，应用程序才会受到攻击。OpenSSL版本1.1.1i及以下版本受此问题影响。这些版本的用户应该升级到OpenSSL 1.1.1j。OpenSSL 1.0.2x及以下版本受此问题影响。然而，OpenSSL 1.0.2已不受支持，不再接收公共更新。OpenSSL 1.0.2的高级支持客户应升级到1.0.2y。其他用户应升级至1.1.1j。在OpenSSL 1.1.1j中修复（受1.1.1-1.1.1i影响）。在OpenSSL 1.0.2y中修复（受影响1.0.2-1.0.2x）。（CVE-2021-23841）-在某些情况下，对EVP_CipherUpdate、EVP_EncryptUpdate和EVP_DecryptUpdate的调用可能会使输出长度参数溢出，其中输入长度接近平台上整数的最大允许长度。在这种情况下，函数调用的返回值将为1（表示成功），但输出长度值将为负值。这可能会导致应用程序行为不正确或崩溃。OpenSSL版本1.1.1i及以下版本受此问题影响。这些版本的用户应该升级到OpenSSL 1.1.1j。OpenSSL 1.0.2x及以下版本受此问题影响。然而，OpenSSL 1.0.2已不受支持，不再接收公共更新。OpenSSL 1.0.2的高级支持客户应升级到1.0.2y。其他用户应升级至1.1.1j。在OpenSSL 1.1.1j中修复（受1.1.1-1.1.1i影响）。在OpenSSL 1.0.2y中修复（受影响1.0.2-1.0.2x）。（CVE-2021-23840）-OpenSSL 1.0.2支持SSLv2。如果客户机试图与配置为同时支持SSLv2和更新的SSL和TLS版本的服务器协商SSLv2，则在添加RSA签名时会检查版本回滚攻击。支持SSL或TLS版本大于SSLv2的客户端应该使用特殊形式的填充。支持大于SSLv2的服务器应该拒绝来自存在这种特殊填充形式的客户端的连接尝试，因为这表明发生了版本回滚（即客户端和服务器都支持大于SSLv2的版本，但这是被请求的版本）。这种填充检查的实现颠倒了逻辑，因此，如果存在填充，连接尝试将被接受，如果不存在填充，连接尝试将被拒绝。这意味着，如果发生版本回滚攻击，例如服务器将接受连接。此外，如果尝试正常的SSLv2连接，服务器将错误地拒绝连接。只有版本1.0.2s到1.0.2x的OpenSSL 1.0.2服务器受此问题影响。为了使1.0.2服务器易受攻击，必须：1）在编译时配置了SSLv2支持（默认为关闭），2）在运行时配置了SSLv2支持（默认为关闭），3）已配置SSLv2密码套件（这些不在默认密码套件列表中）OpenSSL 1.1.1不支持SSLv2，因此不易受到此问题的攻击。基本错误是在RSA_padding_check_SSLv23（）函数的实现中。这也会影响其他各种函数使用的RSA_SSLV23_填充模式。尽管1.1.1不支持SSLv2，但RSA_padding_check_SSLv23（）函数仍然存在，RSA_SSLv23_padding模式也是如此。直接调用该函数或使用该填充模式的应用程序将遇到此问题。但是，由于1.1.1中不支持SSLv2协议，因此在该版本中，这被视为一个错误，而不是安全问题。OpenSSL 1.0.2已不受支持，不再接收公共更新。OpenSSL 1.0.2的高级支持客户应升级到1.0.2y。其他用户应升级至1.1.1j。在OpenSSL 1.0.2y中修复（受影响1.0.2s-1.0.2x）。（CVE-2021-23839）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2y or later.",
        "solution_cn": "升级至OpenSSL版本1.0.2y或更高版本。",
        "cve": "CVE-2021-23839"
    },
    "150280": {
        "name_en": "Apache 2.4.x < 2.4.47 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4。x<2.4.47多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.47. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.47 changelog: - Unexpected <Location> section matching with 'MergeSlashes OFF' (CVE-2021-30641) - mod_auth_digest: possible stack overflow by one nul byte while validating the Digest nonce. (CVE-2020-35452) - mod_session: Fix possible crash due to NULL pointer dereference, which could be used to cause a Denial of Service with a malicious backend server and SessionHeader. (CVE-2021-26691) - mod_session: Fix possible crash due to NULL pointer dereference, which could be used to cause a Denial of Service. (CVE-2021-26690) - mod_proxy_http: Fix possible crash due to NULL pointer dereference, which could be used to cause a Denial of Service. (CVE-2020-13950) - Windows: Prevent local users from stopping the httpd process (CVE-2020-13938) - mod_proxy_wstunnel, mod_proxy_http: Handle Upgradable protocols end-to-end negotiation. (CVE-2019-17567) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.47。因此，它受到2.4.47变更日志中引用的多个漏洞的影响：-与“MergeSlashes OFF”（CVE-2021-30641）匹配的意外<Location>部分-mod_auth_digest:验证摘要nonce时，堆栈可能溢出一个nul字节。（CVE-2020-35452）-mod_session：修复由于空指针解引用导致的可能崩溃，该故障可用于导致恶意后端服务器和SessionHeader的拒绝服务。（CVE-2021-26691）-mod_会话：修复可能由于空指针解引用而导致的崩溃，这可能会导致拒绝服务。（CVE-2021-26690）-mod_proxy_http：修复可能因空指针解引用而导致的崩溃，该故障可用于导致拒绝服务。（CVE-2020-13950）-Windows：防止本地用户停止httpd进程（CVE-2020-13938）-mod_proxy_wstunnel，mod_proxy_http：处理可升级的协议端到端协商。（CVE-2019-17567）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.47 or later.",
        "solution_cn": "升级至Apache 2.4.47或更高版本。",
        "cve": "CVE-2019-17567"
    },
    "152780": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2za Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2za漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2za. It is, therefore, affected by a vulnerability as referenced in the 1.0.2za advisory. - ASN.1 strings are represented internally within OpenSSL as an ASN1_STRING structure which contains a buffer holding the string data and a field holding the buffer length. This contrasts with normal C strings which are repesented as a buffer for the string data which is terminated with a NUL (0) byte. Although not a strict requirement, ASN.1 strings that are parsed using OpenSSL's own d2i functions (and other similar parsing functions) as well as any string whose value has been set with the ASN1_STRING_set() function will additionally NUL terminate the byte array in the ASN1_STRING structure. However, it is possible for applications to directly construct valid ASN1_STRING structures which do not NUL terminate the byte array by directly setting the data and length fields in the ASN1_STRING array. This can also happen by using the ASN1_STRING_set0() function. Numerous OpenSSL functions that print ASN.1 data have been found to assume that the ASN1_STRING byte array will be NUL terminated, even though this is not guaranteed for strings that have been directly constructed. Where an application requests an ASN.1 structure to be printed, and where that ASN.1 structure contains ASN1_STRINGs that have been directly constructed by the application without NUL terminating the data field, then a read buffer overrun can occur. The same thing can also occur during name constraints processing of certificates (for example if a certificate has been directly constructed by the application instead of loading it via the OpenSSL parsing functions, and the certificate contains non NUL terminated ASN1_STRING structures). It can also occur in the X509_get1_email(), X509_REQ_get1_email() and X509_get1_ocsp() functions. If a malicious actor can cause an application to directly construct an ASN1_STRING and then process it through one of the affected OpenSSL functions then this issue could be hit. This might result in a crash (causing a Denial of Service attack). It could also result in the disclosure of private memory contents (such as private keys, or sensitive plaintext). Fixed in OpenSSL 1.0.2za (Affected 1.0.2-1.0.2y). (CVE-2021-3712) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2za。因此，它受到1.0.2za建议中提到的漏洞的影响。-ASN。1字符串在OpenSSL内部表示为ASN1_字符串结构，其中包含一个保存字符串数据的缓冲区和一个保存缓冲区长度的字段。这与普通的C字符串形成对比，后者作为字符串数据的缓冲区，以NUL（0）字节结尾。虽然不是严格的要求，ASN。1使用OpenSSL自己的d2i函数（和其他类似的解析函数）解析的字符串，以及使用ASN1_string_set（）函数设置值的任何字符串，将额外NUL终止ASN1_字符串结构中的字节数组。但是，应用程序可以通过直接设置ASN1_字符串数组中的数据和长度字段，直接构造有效的ASN1_字符串结构，而不会以NUL终止字节数组。这也可以通过使用ASN1_STRING_set0（）函数实现。许多打印ASN的OpenSSL函数。1已发现数据假设ASN1_字符串字节数组将以NUL结尾，尽管直接构造的字符串不能保证这一点。其中应用程序请求ASN。1要打印的结构，以及ASN的位置。1结构包含由应用程序直接构造的ASN1_字符串，无需NUL终止数据字段，则可能发生读取缓冲区溢出。在证书的名称约束处理过程中也可能发生同样的情况（例如，如果证书是由应用程序直接构造的，而不是通过OpenSSL解析函数加载的，并且证书包含以非NUL结尾的ASN1_字符串结构）。它也可以出现在X509_get1_email（）、X509_REQ_get1_email（）和X509_get1_ocsp（）函数中。如果恶意参与者可以导致应用程序直接构造ASN1_字符串，然后通过受影响的OpenSSL函数之一对其进行处理，那么这个问题可能会受到影响。这可能会导致崩溃（导致拒绝服务攻击）。它还可能导致私密内存内容（如私钥或敏感明文）的泄露。在OpenSSL 1.0.2za中修复（受影响1.0.2-1.0.2y）。（CVE-2021-3712）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2za or later.",
        "solution_cn": "升级至OpenSSL 1.0.2za或更高版本。",
        "cve": "CVE-2021-3712"
    },
    "152853": {
        "name_en": "PHP < 7.3.28 Email Header Injection",
        "name_cn": "PHP<7.3.28电子邮件头插入",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the version of PHP running on the remote web server is prior to 7.3.28. It is, therefore affected by an email header injection vulnerability, due to a failure to properly handle CR-LF sequences in header fields. An unauthenticated, remote attacker can exploit this, by inserting line feed characters into email headers, to gain full control of email header content.",
        "describe_cn": "根据其自我报告的版本号，在远程web服务器上运行的PHP版本早于7.3.28。因此，由于未能正确处理标头字段中的CR-LF序列，它会受到电子邮件标头注入漏洞的影响。未经验证的远程攻击者可以通过在电子邮件头中插入换行符来利用此漏洞，以获得对电子邮件头内容的完全控制。",
        "solution_en": "Upgrade to PHP version 7.3.28 or later.",
        "solution_cn": "升级至PHP 7.3.28或更高版本。",
        "cve": ""
    },
    "153583": {
        "name_en": "Apache < 2.4.49 Multiple Vulnerabilities",
        "name_cn": "Apache<2.4.49多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.49. It is, therefore, affected by a vulnerability as referenced in the 2.4.49 changelog. - A crafted request uri-path can cause mod_proxy to forward the request to an origin server choosen by the remote user. (CVE-2021-40438) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.49。因此，它受到2.4.49变更日志中引用的漏洞的影响。-精心编制的请求uri路径可能会导致mod_proxy将请求转发到远程用户选择的源服务器。（CVE-2021-40438）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.49 or later.",
        "solution_cn": "升级至Apache 2.4.49或更高版本。",
        "cve": "CVE-2021-40438"
    },
    "153584": {
        "name_en": "Apache < 2.4.49 Multiple Vulnerabilities",
        "name_cn": "Apache<2.4.49多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.49. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.49 changelog. - ap_escape_quotes() may write beyond the end of a buffer when given malicious input. No included modules pass untrusted data to these functions, but third-party / external modules may. (CVE-2021-39275) - Malformed requests may cause the server to dereference a NULL pointer. (CVE-2021-34798) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.49。因此，它受到2.4.49变更日志中引用的多个漏洞的影响。-当给定恶意输入时，ap_escape_quotes（）可能会写入缓冲区之外的内容。没有包含的模块将不受信任的数据传递给这些功能，但第三方/外部模块可能会。（CVE-2021-39275）-格式错误的请求可能会导致服务器取消对空指针的引用。（CVE-2021-34798）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.49 or later.",
        "solution_cn": "升级至Apache 2.4.49或更高版本。",
        "cve": "CVE-2021-34798"
    },
    "153585": {
        "name_en": "Apache >= 2.4.17 < 2.4.49 mod_http2",
        "name_cn": "Apache>=2.4.17<2.4.49 mod_http2",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Apache httpd installed on the remote host is greater than 2.4.17 and prior to 2.4.49. It is, therefore, affected by a vulnerability as referenced in the 2.4.49 changelog. A crafted method sent through HTTP/2 will bypass validation and be forwarded by mod_proxy, which can lead to request splitting or cache poisoning. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的Apache httpd版本高于2.4.17，低于2.4.49。因此，它受到2.4.49变更日志中引用的漏洞的影响。通过HTTP/2发送的特制方法将绕过验证，并由mod_代理转发，这可能会导致请求拆分或缓存中毒。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.49 or later.",
        "solution_cn": "升级至Apache 2.4.49或更高版本。",
        "cve": "CVE-2021-33193"
    },
    "156255": {
        "name_en": "Apache 2.4.x < 2.4.52 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4。x<2.4.52多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.52. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.52 advisory. - A crafted URI sent to httpd configured as a forward proxy (ProxyRequests on) can cause a crash (NULL pointer dereference) or, for configurations mixing forward and reverse proxy declarations, can allow for requests to be directed to a declared Unix Domain Socket endpoint (Server Side Request Forgery). This issue affects Apache HTTP Server 2.4.7 up to 2.4.51 (included). (CVE-2021-44224) - A carefully crafted request body can cause a buffer overflow in the mod_lua multipart parser (r:parsebody() called from Lua scripts). The Apache httpd team is not aware of an exploit for the vulnerabilty though it might be possible to craft one. This issue affects Apache HTTP Server 2.4.51 and earlier. (CVE-2021-44790) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.52。因此，它受到2.4.52建议中提到的多个漏洞的影响。-发送到配置为转发代理（ProxyRequests on）的httpd的精心编制的URI可能会导致崩溃（空指针取消引用），或者，对于混合了转发和反向代理声明的配置，可以允许将请求定向到已声明的Unix域套接字端点（服务器端请求伪造）。此问题影响Apache HTTP服务器2.4.7至2.4.51（包括）。（CVE-2021-44224）-精心编制的请求正文可能会导致mod_lua多部分解析器中的缓冲区溢出（从lua脚本调用r:parsebody（））。Apache httpd团队不知道有人利用该漏洞进行攻击，尽管可能会设计一个漏洞。此问题影响Apache HTTP Server 2.4.51及更早版本。（CVE-2021-44790）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.52 or later.",
        "solution_cn": "升级至Apache 2.4.52或更高版本。",
        "cve": "CVE-2021-44224"
    },
    "74247": {
        "name_en": "Apache Tomcat 7.0.x < 7.0.54 XML Parser Information Disclosure",
        "name_cn": "Apache Tomcat 7.0。x<7.0.54 XML解析器信息披露",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the instance of Apache Tomcat 7.0.x listening on the remote host is prior to 7.0.54. It is, therefore, affected by an information disclosure vulnerability. An error exists that allows undesired XML parsers to be injected into the application by a malicious web application, allows the bypassing of security controls, and allows the processing of external XML entities. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，Apache Tomcat 7.0的实例。x在远程主机上监听的时间早于7.0.54。因此，它受到信息披露漏洞的影响。存在一个错误，该错误允许恶意web应用程序将不需要的XML解析器注入应用程序，允许绕过安全控制，并允许处理外部XML实体。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 7.0.54 or later.",
        "solution_cn": "升级至Apache Tomcat 7.0.54或更高版本。",
        "cve": "CVE-2014-0119"
    },
    "66428": {
        "name_en": "Apache Tomcat 7.0.x < 7.0.40 Multiple Vulnerabilities",
        "name_cn": "Apache Tomcat 7.0。x<7.0.40多个漏洞",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "According to its self-reported version number, the instance of Apache Tomcat 7.0 listening on the remote host is prior to 7.0.40. It is, therefore, affected by multiple vulnerabilities : - An error exists related to 'AsyncListeners' that throw 'RuntimeExceptions' that allow elements of certain requests to be disclosed in responses to other requests. (CVE-2013-2071) - It is possible to upload a malicious JSP to a Tomcat server and subsequently trigger execution of that JSP. (CVE-2013-4444) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，在远程主机上侦听的Apache Tomcat 7.0实例早于7.0.40。因此，它受到多个漏洞的影响：-存在与“AsyncListeners”相关的错误，该错误引发“RuntimeExceptions”，允许在响应其他请求时披露某些请求的元素。（CVE-2013-2071）-可以将恶意JSP上传到Tomcat服务器，然后触发该JSP的执行。（CVE-2013-4444）请注意，Nessus没有针对这些问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Update to Apache Tomcat version 7.0.40 or later.",
        "solution_cn": "更新至Apache Tomcat 7.0.40或更高版本。",
        "cve": "CVE-2013-2071"
    },
    "72691": {
        "name_en": "Apache Tomcat 7.0.x < 7.0.50 Multiple Vulnerabilities",
        "name_cn": "Apache Tomcat 7.0。x<7.0.50多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the instance of Apache Tomcat 7.0.x listening on the remote host is prior to 7.0.50. It is, therefore, affected by the following vulnerabilities : - The fix for CVE-2012-3544 was not complete and limits are not properly applied to chunk extensions and whitespaces in certain trailing headers. This error could allow denial of service attacks. (CVE-2013-4322) - The application allows XML External Entity (XXE) processing that could disclose sensitive information. (CVE-2013-4590) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，Apache Tomcat 7.0的实例。x在远程主机上监听的时间早于7.0.50。因此，它受到以下漏洞的影响：-CVE-2012-3544的修复程序不完整，限制未正确应用于某些尾部标题中的块扩展和空白。此错误可能允许拒绝服务攻击。（CVE-2013-4322）-该应用程序允许对可能泄露敏感信息的XML外部实体（XXE）进行处理。（CVE-2013-4590）请注意，Nessus没有针对这些问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Update to Apache Tomcat version 7.0.50 or later.",
        "solution_cn": "更新至Apache Tomcat 7.0.50或更高版本。",
        "cve": "CVE-2013-4322"
    },
    "72692": {
        "name_en": "Apache Tomcat 7.0.x < 7.0.52 Content-Type DoS",
        "name_cn": "Apache Tomcat 7.0。x<7.0.52内容类型DoS",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the instance of Apache Tomcat 7.0.x listening on the remote host is prior to 7.0.52. It is, therefore, affected by an error related to handling 'Content-Type' HTTP headers and multipart requests such as file uploads. Note that this error exists because of the bundled version of Apache Commons FileUpload. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，Apache Tomcat 7.0的实例。在远程主机上监听的x早于7.0.52。因此，它会受到与处理“内容类型”HTTP头和多部分请求（如文件上载）相关的错误的影响。请注意，此错误的存在是因为Apache Commons FileUpload的捆绑版本。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Update to Apache Tomcat version 7.0.52 or later.",
        "solution_cn": "更新至Apache Tomcat 7.0.52或更高版本。",
        "cve": "CVE-2014-0050"
    },
    "74246": {
        "name_en": "Apache Tomcat 7.0.x < 7.0.53 Multiple Vulnerabilities",
        "name_cn": "Apache Tomcat 7.0。x<7.0.53多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the instance of Apache Tomcat 7.0.x listening on the remote host is prior to 7.0.53. It is, therefore, affected by the following vulnerabilities : - An error exists related to chunk size and chunked requests that allow denial of service attacks. (CVE-2014-0075) - An error exists related to XSLT handling and security managers that allows security bypass related to external XML entities. (CVE-2014-0096) - An error exists related to content length header handling and using the application behind a reverse proxy that allows a security bypass. (CVE-2014-0099) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，Apache Tomcat 7.0的实例。在远程主机上侦听的x早于7.0.53。因此，它受到以下漏洞的影响：-存在与允许拒绝服务攻击的块大小和块请求相关的错误。（CVE-2014-0075）-存在一个与XSLT处理和安全管理器相关的错误，该错误允许绕过与外部XML实体相关的安全性。（CVE-2014-0096）-存在一个与内容长度头处理和在允许安全绕过的反向代理后面使用应用程序相关的错误。（CVE-2014-0099）请注意，Nessus没有针对这些问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 7.0.53 or later.",
        "solution_cn": "升级至Apache Tomcat 7.0.53或更高版本。",
        "cve": "CVE-2014-0075"
    },
    "121116": {
        "name_en": "Apache Tomcat 7.0.x < 7.0.47 / 8.0.x < 8.0.0-RC3 Information Disclosure",
        "name_cn": "Apache Tomcat 7.0。x<7.0.47/8.0。x<8.0.0-RC3信息披露",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the Apache Tomcat instance listening on the remote host is 7.0.x prior to 7.0.47 or 8.0.x prior to 8.0.0-RC3. It is, therefore, affected by the following vulnerability: - An information disclosure vulnerability exists in Tomcat due to improper handling of content-length headers. An unauthenticated, remote attacker can exploit this to disclose potentially sensitive information. Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "根据其自我报告的版本号，在远程主机上侦听的Apache Tomcat实例是7.0。x在7.0.47或8.0之前。8.0.0-RC3之前的x。因此，它受到以下漏洞的影响：-Tomcat中存在一个信息泄露漏洞，这是由于对内容长度头的不当处理造成的。未经验证的远程攻击者可以利用此漏洞泄露潜在的敏感信息。请注意，Nessus没有针对这些问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 7.0.47 / 8.0.0-RC3 or later.",
        "solution_cn": "升级至Apache Tomcat 7.0.47/8.0.0-RC3或更高版本。",
        "cve": "CVE-2013-4286"
    },
    "107265": {
        "name_en": "nginx < 1.8.1 / 1.9.x < 1.9.10 Multiple Vulnerabilities",
        "name_cn": "nginx<1.8.1/1.9。x<1.9.10多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to the self-reported version in its response header, the version of nginx hosted on the remote web server is less than 1.8.1 or 1.9.x prior to 1.9.10. It is, therefore, affected by multiple vulnerabilities as noted in the vendor advisory.",
        "describe_cn": "根据其响应头中的自我报告版本，远程web服务器上托管的nginx版本低于1.8.1或1.9。x在1.9.10之前。因此，它受到供应商咨询中指出的多个漏洞的影响。",
        "solution_en": "Upgrade to nginx version 1.8.1 / 1.9.10 or later.",
        "solution_cn": "升级至nginx版本1.8.1/1.9.10或更高版本。",
        "cve": "CVE-2016-0742"
    },
    "148367": {
        "name_en": "Python Unsupported Version Detection",
        "name_cn": "Python不支持的版本检测",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The remote host contains one or more unsupported versions of Python. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "远程主机包含一个或多个不受支持的Python版本。缺乏支持意味着供应商不会发布产品的新安全补丁。因此，它可能包含安全漏洞。",
        "solution_en": "Upgrade to a version of Python that is currently supported.",
        "solution_cn": "升级到当前受支持的Python版本。",
        "cve": ""
    },
    "154150": {
        "name_en": "Apache Tomcat 9.0.40 < 9.0.54 vulnerability",
        "name_cn": "Apache Tomcat 9.0.40<9.0.54漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 9.0.54. It is, therefore, affected by a vulnerability as referenced in the fixed_in_apache_tomcat_9.0.54_security-9 advisory. - The fix for bug 63362 present in Apache Tomcat 10.1.0-M1 to 10.1.0-M5, 10.0.0-M1 to 10.0.11, 9.0.40 to 9.0.53 and 8.5.60 to 8.5.71 introduced a memory leak. The object introduced to collect metrics for HTTP upgrade connections was not released for WebSocket connections once the connection was closed. This created a memory leak that, over time, could lead to a denial of service via an OutOfMemoryError. (CVE-2021-42340) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于9.0.54。因此，它受到apache_tomcat_9.0.54_security-9 advisory中的fixed_中引用的漏洞的影响。-Apache Tomcat 10.1.0-M1至10.1.0-M5、10.0.0-M1至10.0.11、9.0.40至9.0.53和8.5.60至8.5.71中存在的缺陷63362的修复引入了内存泄漏。为收集HTTP升级连接的指标而引入的对象在连接关闭后未针对WebSocket连接发布。这造成了内存泄漏，随着时间的推移，可能会通过OutOfMemory错误导致拒绝服务。（CVE-2021-42340）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 9.0.54 or later.",
        "solution_cn": "升级至Apache Tomcat 9.0.54或更高版本。",
        "cve": "CVE-2021-42340"
    },
    "111068": {
        "name_en": "Apache Tomcat 8.5.0 < 8.5.32 Multiple Vulnerabilities",
        "name_cn": "Apache Tomcat 8.5.0<8.5.32多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache Tomcat installed on the remote host is 8.5.x prior to 8.5.32. It is, therefore, affected by multiple vulnerabilities.",
        "describe_cn": "远程主机上安装的Apache Tomcat版本为8.5。x在8.5.32之前。因此，它受到多个漏洞的影响。",
        "solution_en": "Upgrade to Apache Tomcat version 8.5.32 or later.",
        "solution_cn": "升级至Apache Tomcat 8.5.32或更高版本。",
        "cve": "CVE-2018-8014"
    },
    "118036": {
        "name_en": "Apache Tomcat 8.5.x < 8.5.34 Open Redirect Weakness",
        "name_cn": "ApacheTomcat 8.5。x<8.5.34开放性重定向弱点",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of Apache Tomcat installed on the remote host is 8.5.x prior to 8.5.34. It is, therefore, affected by a open redirect vulnerability.",
        "describe_cn": "远程主机上安装的Apache Tomcat版本为8.5。x在8.5.34之前。因此，它受到开放重定向漏洞的影响。",
        "solution_en": "Upgrade to Apache Tomcat version 8.5.34 or later.",
        "solution_cn": "升级至Apache Tomcat 8.5.34或更高版本。",
        "cve": "CVE-2018-11784"
    },
    "154147": {
        "name_en": "Apache Tomcat 8.5.60 < 8.5.72 vulnerability",
        "name_cn": "Apache Tomcat 8.5.60<8.5.72漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Tomcat installed on the remote host is prior to 8.5.72. It is, therefore, affected by a vulnerability as referenced in the fixed_in_apache_tomcat_8.5.72_security-8 advisory. - The fix for bug 63362 present in Apache Tomcat 10.1.0-M1 to 10.1.0-M5, 10.0.0-M1 to 10.0.11, 9.0.40 to 9.0.53 and 8.5.60 to 8.5.71 introduced a memory leak. The object introduced to collect metrics for HTTP upgrade connections was not released for WebSocket connections once the connection was closed. This created a memory leak that, over time, could lead to a denial of service via an OutOfMemoryError. (CVE-2021-42340) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Tomcat版本早于8.5.72。因此，它受到apache_tomcat_8.5.72_security-8咨询中提到的漏洞的影响。-Apache Tomcat 10.1.0-M1至10.1.0-M5、10.0.0-M1至10.0.11、9.0.40至9.0.53和8.5.60至8.5.71中存在的缺陷63362的修复引入了内存泄漏。为收集HTTP升级连接的指标而引入的对象在连接关闭后未针对WebSocket连接发布。这造成了内存泄漏，随着时间的推移，可能会通过OutOfMemory错误导致拒绝服务。（CVE-2021-42340）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache Tomcat version 8.5.72 or later.",
        "solution_cn": "升级至Apache Tomcat 8.5.72或更高版本。",
        "cve": "CVE-2021-42340"
    }
}