{
    "11213": {
        "name_en": "HTTP TRACE / TRACK Methods Allowed",
        "name_cn": "HTTP TRACE / TRAC方法未禁用",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote web server supports the TRACE and/or TRACK methods. TRACE and TRACK are HTTP methods that are used to debug web server connections.",
        "describe_cn": "主机支持TRACE和/或TRACK方法。 TRACE和TRACK是HTTP用来调试web服务器连接的方法。",
        "solution_en": "Disable these HTTP methods. Refer to the plugin output for more information.",
        "solution_cn": "禁用TRACE / TRAC方法，参考如下： 1、IIS下：IIS信息服务－web服务扩展：禁止\"WebDAV； 2、apache下：修改httpd.conf配置文件中\"TraceEnable on\"为\"TraceEnable off\"",
        "cve": "",
        "plugin_id": "11213"
    },
    "11229": {
        "name_en": "Web Server info.php / phpinfo.php Detection",
        "name_cn": "Web服务器info.php/phpinfo.php检测",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "Many PHP installation tutorials instruct the user to create a PHP file that calls the PHP function 'phpinfo()' for debugging purposes. Various PHP applications may also include such a file. By accessing such a file, a remote attacker can discover a large amount of information about the remote web server, including : - The username of the user who installed PHP and if they are a SUDO user. - The IP address of the host. - The version of the operating system. - The web server version. - The root directory of the web server. - Configuration information about the remote PHP installation.",
        "describe_cn": "许多PHP安装教程指导用户创建一个PHP文件，该文件调用PHP函数“phpinfo（）”进行调试。各种PHP应用程序也可能包含这样的文件。通过访问这样的文件，远程攻击者可以发现有关远程web服务器的大量信息，包括：-安装PHP的用户的用户名，如果他们是SUDO用户。-主机的IP地址。-操作系统的版本。-web服务器版本。-web服务器的根目录。-有关远程PHP安装的配置信息。",
        "solution_en": "Remove the affected file(s).",
        "solution_cn": "删除受影响的文件。",
        "cve": "",
        "plugin_id": "11229"
    },
    "26194": {
        "name_en": "Web Server Transmits Cleartext Credentials",
        "name_cn": "Web服务器传输明文凭证",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The remote web server contains several HTML form fields containing an input of type 'password' which transmit their information to a remote web server in cleartext. An attacker eavesdropping the traffic between web browser and server may obtain logins and passwords of valid users.",
        "describe_cn": "远程web服务器包含几个HTML表单字段，其中包含“password”类型的输入，这些输入以明文形式将其信息传输到远程web服务器。窃听web浏览器和服务器之间通信的攻击者可能获得有效用户的登录名和密码。",
        "solution_en": "Make sure that every sensitive form transmits content over HTTPS.",
        "solution_cn": "确保每个敏感表单都通过HTTPS传输内容。",
        "cve": "",
        "plugin_id": "26194"
    },
    "45411": {
        "name_en": "SSL Certificate with Wrong Hostname",
        "name_cn": "SSL证书主机名不匹配",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The 'commonName' (CN) attribute of the SSL certificate presented for this service is for a different machine.",
        "describe_cn": "SSL现有认证的commonName (CN)是供其它主机使用的。",
        "solution_en": "Purchase or generate a proper SSL certificate for this service.",
        "solution_cn": "为此项服务购买或生产一个合适的证书",
        "cve": "",
        "plugin_id": "45411"
    },
    "46803": {
        "name_en": "PHP expose_php Information Disclosure",
        "name_cn": "PHP expose.PHP信息泄漏",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The PHP install on the remote server is configured in a way that allows disclosure of potentially sensitive information to an attacker through a special URL. Such a URL triggers an Easter egg built into PHP itself. Other such Easter eggs likely exist, but Nessus has not checked for them.",
        "describe_cn": "远程服务器上的PHP安装以允许通过特殊URL向攻击者泄露潜在敏感信息的方式进行配置。这样的URL会触发PHP本身内置的复活节彩蛋。其他类似的复活节彩蛋也可能存在，但奈索斯没有检查过。",
        "solution_en": "In the PHP configuration file, php.ini, set the value for 'expose_php' to 'Off' to disable this behavior. Restart the web server daemon to put this change into effect.",
        "solution_cn": "在PHP配置文件PHP.ini中，将“expose.PHP”的值设置为“Off”以禁用此行为。重新启动web服务器守护程序以使此更改生效。",
        "cve": "",
        "plugin_id": "46803"
    },
    "51192": {
        "name_en": "SSL Certificate Cannot Be Trusted",
        "name_cn": "SSL证书不被信任",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The server's X.509 certificate cannot be trusted. This situation can occur in three different ways, in which the chain of trust can be broken, as stated below : - First, the top of the certificate chain sent by the server might not be descended from a known public certificate authority. This can occur either when the top of the chain is an unrecognized, self-signed certificate, or when intermediate certificates are missing that would connect the top of the certificate chain to a known public certificate authority. - Second, the certificate chain may contain a certificate that is not valid at the time of the scan. This can occur either when the scan occurs before one of the certificate's 'notBefore' dates, or after one of the certificate's 'notAfter' dates. - Third, the certificate chain may contain a signature that either didn't match the certificate's information or could not be verified. Bad signatures can be fixed by getting the certificate with the bad signature to be re-signed by its issuer. Signatures that could not be verified are the result of the certificate's issuer using a signing algorithm that Nessus either does not support or does not recognize. If the remote host is a public host in production, any break in the chain makes it more difficult for users to verify the authenticity and identity of the web server. This could make it easier to carry out man-in-the-middle attacks against the remote host.",
        "describe_cn": "此项服务的SSL证书不被信任。",
        "solution_en": "Purchase or generate a proper SSL certificate for this service.",
        "solution_cn": "为此项服务购买或生成合适的证书",
        "cve": "",
        "plugin_id": "51192"
    },
    "57582": {
        "name_en": "SSL Self-Signed Certificate",
        "name_cn": "SSL自签名证书",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The X.509 certificate chain for this service is not signed by a recognized certificate authority. If the remote host is a public host in production, this nullifies the use of SSL as anyone could establish a man-in-the-middle attack against the remote host. Note that this plugin does not check for certificate chains that end in a certificate that is not self-signed, but is signed by an unrecognized certificate authority.",
        "describe_cn": "服务器所使用的X.509签署的证书链不是权威的证书颁发机构所颁发的。这削弱了使用SSL的效果，因为任何人都可以建立一个中间人攻击远程主机。",
        "solution_en": "Purchase or generate a proper SSL certificate for this service.",
        "solution_cn": "购买或者生成被认可的证书",
        "cve": "",
        "plugin_id": "57582"
    },
    "57608": {
        "name_en": "SMB Signing Required",
        "name_cn": "SMB数字签名通信禁用",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "Signing is not required on the remote SMB server. An unauthenticated, remote attacker can exploit this to conduct man-in-the-middle attacks against the SMB server.",
        "describe_cn": "SMB 协议为 Microsoft 文件和打印共享以及许多其他网络操作（例如远程 Windows 管理）提供基础。为了防止在传输过程中修改 SMB 数据包的拦截攻击，SMB 协议支持对 SMB 数据包的数字签名。 主机禁用了SMB数字签名通信，这可能导致潜在攻击者针对SMB通信服务进行中间人攻击。",
        "solution_en": "Enforce message signing in the host's configuration. On Windows, this is found in the policy setting 'Microsoft network server: Digitally sign communications (always)'. On Samba, the setting is called 'server signing'. See the 'see also' links for further details.",
        "solution_cn": "在本地策略中--安全选项设置如下： Microsoft 网络客户端：对通信进行数字签名（若服务器同意）（启用） Microsoft 网络服务器：对通信进行数字签名（若客户同意）（启用）",
        "cve": "",
        "plugin_id": "57608"
    },
    "58987": {
        "name_en": "PHP Unsupported Version Detection",
        "name_cn": "当前PHP版本厂商已不支持",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its version, the installation of PHP on the remote host is no longer supported. Lack of support implies that no new security patches for the product will be released by the vendor. As a result, it is likely to contain security vulnerabilities.",
        "describe_cn": "根据现有版本，远程主机安装的PHP版本不再被厂商支持，意味着不再发布相关的安全补丁包，结果可能存在多个安全漏洞。",
        "solution_en": "Upgrade to a version of PHP that is currently supported.",
        "solution_cn": "升级至当前的支持版本 http://php.net/eol.php https://wiki.php.net/rfc/releaseprocess",
        "cve": "",
        "plugin_id": "58987"
    },
    "85582": {
        "name_en": "Web Application Potentially Vulnerable to Clickjacking",
        "name_cn": "Web应用程序可能容易受到点击劫持",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote web server does not set an X-Frame-Options response header or a Content-Security-Policy 'frame-ancestors' response header in all content responses. This could potentially expose the site to a clickjacking or UI redress attack, in which an attacker can trick a user into clicking an area of the vulnerable page that is different than what the user perceives the page to be. This can result in a user performing fraudulent or malicious transactions. X-Frame-Options has been proposed by Microsoft as a way to mitigate clickjacking attacks and is currently supported by all major browser vendors. Content-Security-Policy (CSP) has been proposed by the W3C Web Application Security Working Group, with increasing support among all major browser vendors, as a way to mitigate clickjacking and other attacks. The 'frame-ancestors' policy directive restricts which sources can embed the protected resource. Note that while the X-Frame-Options and Content-Security-Policy response headers are not the only mitigations for clickjacking, they are currently the most reliable methods that can be detected through automation. Therefore, this plugin may produce false positives if other mitigation strategies (e.g., frame-busting JavaScript) are deployed or if the page does not perform any security-sensitive transactions.",
        "describe_cn": "远程Web服务器不会在所有内容响应中设置X-Frame-Options响应标头或Content-Security-Policy“frame-ancestors”响应标头。这可能会使网站遭受点击劫持或UI补救攻击，攻击者可以欺骗用户点击与用户感知页面不同的易受攻击页面区域。这可能会导致用户进行欺诈或恶意交易。 微软已经提出X-Frame-Options作为缓解点击劫持攻击的一种方法，并且目前被所有主流浏览器厂商所支持。 W3C网络应用安全工作组已经提出了内容安全策略（CSP），并加强了所有主要浏览器厂商的支持，以此来缓解点击劫持和其他攻击。 “框架 - 祖先”政策指令限制哪些来源可以嵌入受保护的资源。 请注意，尽管X-Frame-Options和Content-Security-Policy响应头并不是clickjacking的唯一缓解措施，它们是目前最可靠的方法，可以通过自动化进行检测。因此，如果部署了其他缓解策略（例如，框架抽取JavaScript）或者页面不执行任何安全敏感的事务，该插件可能会产生误报。",
        "solution_en": "Return the X-Frame-Options or Content-Security-Policy (with the 'frame-ancestors' directive) HTTP header with the page's response. This prevents the page's content from being rendered by another site when using the frame or iframe HTML tags.",
        "solution_cn": "返回带有页面响应的X-Frame-Options或Content-Security-Policy（带有“frame-ancestors”指令）HTTP头。 这可以防止使用框架或iframe HTML标记时页面内容被其他站点呈现。",
        "cve": "",
        "plugin_id": "85582"
    },
    "96451": {
        "name_en": "Apache 2.4.x < 2.4.25 Multiple Vulnerabilities (httpoxy)",
        "name_cn": "Apache 2.4.x <2.4.25多个漏洞（httpoxy）",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.25. It is, therefore, affected by the following vulnerabilities : - A flaw exists in the mod_session_crypto module due to encryption for data and cookies using the configured ciphers with possibly either CBC or ECB modes of operation (AES256-CBC by default). An unauthenticated, remote attacker can exploit this, via a padding oracle attack, to decrypt information without knowledge of the encryption key, resulting in the disclosure of potentially sensitive information. (CVE-2016-0736) - A denial of service vulnerability exists in the mod_auth_digest module during client entry allocation. An unauthenticated, remote attacker can exploit this, via specially crafted input, to exhaust shared memory resources, resulting in a server crash. (CVE-2016-2161) - The Apache HTTP Server is affected by a man-in-the-middle vulnerability known as 'httpoxy' due to a failure to properly resolve namespace conflicts in accordance with RFC 3875 section 4.1.18. The HTTP_PROXY environment variable is set based on untrusted user data in the 'Proxy' header of HTTP requests. The HTTP_PROXY environment variable is used by some web client libraries to specify a remote proxy server. An unauthenticated, remote attacker can exploit this, via a crafted 'Proxy' header in an HTTP request, to redirect an application's internal HTTP traffic to an arbitrary proxy server where it may be observed or manipulated. (CVE-2016-5387) - A denial of service vulnerability exists in the mod_http2 module due to improper handling of the LimitRequestFields directive. An unauthenticated, remote attacker can exploit this, via specially crafted CONTINUATION frames in an HTTP/2 request, to inject unlimited request headers into the server, resulting in the exhaustion of memory resources. (CVE-2016-8740) - A flaw exists due to improper handling of whitespace patterns in user-agent headers. An unauthenticated, remote attacker can exploit this, via a specially crafted user-agent header, to cause the program to incorrectly process sequences of requests, resulting in interpreting responses incorrectly, polluting the cache, or disclosing the content from one request to a second downstream user-agent. (CVE-2016-8743) - A CRLF injection allowing HTTP response splitting attacks for sites which use mod_userdir (CVE-2016-4975) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程Web服务器受多个漏洞的影响",
        "solution_en": "Upgrade to Apache version 2.4.25 or later. Note that the 'httpoxy' vulnerability can be mitigated by applying the workarounds or patches as referenced in the vendor advisory asf-httpoxy-response.txt. Furthermore, to mitigate the other vulnerabilities, ensure that the affected modules (mod_session_crypto, mod_auth_digest, and mod_http2) are not in use.",
        "solution_cn": "升级到Apache版本2.4.25或更高版本",
        "cve": "",
        "plugin_id": "96451"
    },
    "96873": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2k Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2 <1.0.2k多种漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.2 prior to 1.0.2k. It is, therefore, affected by multiple vulnerabilities : - A carry propagation error exists in the Broadwell-specific Montgomery multiplication procedure when handling input lengths divisible by but longer than 256 bits. This can result in transient authentication and key negotiation failures or reproducible erroneous outcomes of public-key operations with specially crafted input. A man-in-the-middle attacker can possibly exploit this issue to compromise ECDH key negotiations that utilize Brainpool P-512 curves. (CVE-2016-7055) - An out-of-bounds read error exists when handling packets using the CHACHA20/POLY1305 or RC4-MD5 ciphers. An unauthenticated, remote attacker can exploit this, via specially crafted truncated packets, to cause a denial of service condition. (CVE-2017-3731) - A carry propagating error exists in the x86_64 Montgomery squaring implementation that may cause the BN_mod_exp() function to produce incorrect results. An unauthenticated, remote attacker with sufficient resources can exploit this to obtain sensitive information regarding private keys. Note that this issue is very similar to CVE-2015-3193. Moreover, the attacker would additionally need online access to an unpatched system using the target private key in a scenario with persistent DH parameters and a private key that is shared between multiple clients. For example, this can occur by default in OpenSSL DHE based SSL/TLS cipher suites. (CVE-2017-3732)",
        "describe_cn": "在远程主机上运行的服务受多个影响 漏洞",
        "solution_en": "Upgrade to OpenSSL version 1.0.2k or later.",
        "solution_cn": "升级到OpenSSL版本1.0.2k或更高版本。",
        "cve": "",
        "plugin_id": "96873"
    },
    "100995": {
        "name_en": "Apache 2.2.x < 2.2.33-dev / 2.4.x < 2.4.26 Multiple Vulnerabilities",
        "name_cn": "Apache 2.2.x < 2.2.33-dev / 2.4.x < 2.4.26 多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.2.x prior to 2.2.33-dev or 2.4.x prior to 2.4.26. It is, therefore, affected by the following vulnerabilities : - An authentication bypass vulnerability exists due to third-party modules using the ap_get_basic_auth_pw() function outside of the authentication phase. An unauthenticated, remote attacker can exploit this to bypass authentication requirements. (CVE-2017-3167) - A NULL pointer dereference flaw exists due to third-party module calls to the mod_ssl ap_hook_process_connection() function during an HTTP request to an HTTPS port. An unauthenticated, remote attacker can exploit this to cause a denial of service condition. (CVE-2017-3169) - A NULL pointer dereference flaw exists in mod_http2 that is triggered when handling a specially crafted HTTP/2 request. An unauthenticated, remote attacker can exploit this to cause a denial of service condition. Note that this vulnerability does not affect 2.2.x. (CVE-2017-7659) - An out-of-bounds read error exists in the ap_find_token() function due to improper handling of header sequences. An unauthenticated, remote attacker can exploit this, via a specially crafted header sequence, to cause a denial of service condition. (CVE-2017-7668) - An out-of-bounds read error exists in mod_mime due to improper handling of Content-Type response headers. An unauthenticated, remote attacker can exploit this, via a specially crafted Content-Type response header, to cause a denial of service condition or the disclosure of sensitive information. (CVE-2017-7679) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "此版本受到以下漏洞影响： - httpd中存在身份验证绕过漏洞 由于第三方模块使用 ap_get_basic_auth_pw（）函数之外 验证阶段。远程攻击者可以利用此来绕过身份验证 要求。 （CVE-2017-3167） - httpd由于存在拒绝服务漏洞 一个NULL指针解除引用的缺陷，当 第三方模块调用mod_ssl 一个HTTP期间的ap_hook_process_connection（）函数 请求HTTPS端口。远程攻击者可以利用这一点导致拒绝服务 条件。 （CVE-2017-3169） - httpd由于存在拒绝服务漏洞 ap_find_token（）中的out-of-bounds读取错误 在特殊处理时触发的功能 制作的请求头序列。 远程攻击者可以利用这个来破坏它 服务或强制ap_find_token（）返回一个不正确的 值。 （CVE-2017-7668） - httpd由于存在拒绝服务漏洞 mod_mime中出现超出范围的读取错误 在处理特制Content-Type时触发 响应头。远程攻击者可以 利用这一点来披露敏感信息或原因 拒绝服务条件。 （CVE-2017-7679） - httpd由于存在拒绝服务漏洞 无法初始化或重置值占位符 在[代理 - ]授权标题类型'Digest'之前 或在连续的键=值分配之间 mod_auth_digest的。远程攻击者可以 利用这个，通过提供没有'='的初始密钥 转让，披露敏感信息或导致 拒绝服务条件。 （CVE-2017-9788）",
        "solution_en": "Upgrade to Apache version 2.2.33-dev / 2.4.26 or later.",
        "solution_cn": "升级Apache版本至2.2.33-dev / 2.4.26或之后的版本",
        "cve": "",
        "plugin_id": "100995"
    },
    "101788": {
        "name_en": "Apache 2.4.x < 2.4.27 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4.x <2.4.27多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.27. It is, therefore, affected by the following vulnerabilities : - A denial of service vulnerability exists in httpd due to a failure to initialize or reset the value placeholder in [Proxy-]Authorization headers of type 'Digest' before or between successive key=value assignments by mod_auth_digest. An unauthenticated, remote attacker can exploit this, by providing an initial key with no '=' assignment, to disclose sensitive information or cause a denial of service condition. (CVE-2017-9788) - A read-after-free error exists in httpd that is triggered when closing a large number of connections. An unauthenticated, remote attacker can exploit this to have an unspecified impact. (CVE-2017-9789) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程Web服务器受多个漏洞的影响",
        "solution_en": "Upgrade to Apache version 2.4.27 or later.",
        "solution_cn": "升级到Apache版本2.4.27或更高版本",
        "cve": "",
        "plugin_id": "101788"
    },
    "103838": {
        "name_en": "Apache 2.4.x < 2.4.28 HTTP Vulnerability (OptionsBleed)",
        "name_cn": "“Optionsbleed”-Apache HTTP OPTIONS方法内存泄露漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.28. It is, therefore, affected by an HTTP vulnerability related to the <Limit {method}> directive in an .htaccess file. Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "2017年9月18日，Apache被爆存在高安全风险漏洞，漏洞CVE编号:CVE-2017-9798,该漏洞发现于Apache HTTP 软件 2.2.34/2.4.27版本，该漏洞Limit指令的函数ap_limit_section所触发，如果网站管理员尝试使用无效的 HTTP 方法进行 “Limit” 指令HTTP请求时，会导致内存信息泄露，目前该漏洞证明已经公开，存在安全风险。",
        "solution_en": "Upgrade to Apache version 2.4.28 or later.",
        "solution_cn": "建议升级到最新版本",
        "cve": "",
        "plugin_id": "103838"
    },
    "104408": {
        "name_en": "OpenSSL 1.0.x < 1.0.2m RSA/DSA Unspecified Carry Issue",
        "name_cn": "OpenSSL安全功能绕过漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.x prior to 1.0.2m. It is, therefore, affected by an unspecified carry vulnerability.",
        "describe_cn": "OpenSSL 1.1.0、1.0.2版本解析X.509证书的畸形IPAddressFamily扩展时，存在单字节缓冲区溢出漏洞，可导致证书以文本格式显示时出现错误。(CVE-2017-3735)",
        "solution_en": "Upgrade to OpenSSL version 1.0.2m or later.",
        "solution_cn": "OpenSSL Project已经为此发布了一个安全公告（FreeBSD-SA-17:11.openssl）以及相应补丁: FreeBSD-SA-17:11.openssl：OpenSSL multiple vulnerabilities 链接：https://security.FreeBSD.org/advisories/FreeBSD-SA-17:11.openssl.asc",
        "cve": "",
        "plugin_id": "104408"
    },
    "105291": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2n Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2<1.0.2n多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.x prior to 1.0.2n. It is, therefore, affected by multiple vulnerabilities that allow potential recovery of private key information or failure to properly encrypt data.",
        "describe_cn": "根据它的横幅，在远程主机上运行的OpenSSL版本是1.0。x在1.0.2n之前。因此，它受到多个漏洞的影响，这些漏洞可能会导致私钥信息恢复或数据无法正确加密。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2n or later.",
        "solution_cn": "升级至OpenSSL 1.0.2n或更高版本。",
        "cve": "CVE-2017-3737",
        "plugin_id": "105291"
    },
    "109945": {
        "name_en": "OpenSSL 1.0.x < 1.0.2o Multiple Vulnerabilities",
        "name_cn": "OpenSSL 资源管理错误漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.x prior to 1.0.2o. It is, therefore, affected by a remote DoS vulnerability.",
        "describe_cn": "OpenSSL是OpenSSL团队的一个开源的能够实现安全套接层（SSLv2/v3）和安全传输层（TLSv1）协议的通用加密库。该产品支持多种加密算法，包括对称密码、哈希算法、安全散列算法等。 OpenSSL 1.1.0版本至1.1.0g版本和1.0.2b版本至1.0.2n版本中存在资源管理错误漏洞。该漏洞源于网络系统或产品对系统资源（如内存、磁盘空间、文件等）的管理不当。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2o or later.",
        "solution_cn": "厂商已发布升级补丁以修复漏洞，补丁获取链接： https://www.openssl.org/news/secadv/20180327.txt",
        "cve": "",
        "plugin_id": "109945"
    },
    "111788": {
        "name_en": "Apache 2.4.x < 2.4.34 Multiple Vulnerabilities",
        "name_cn": "Apache HTTP Server 资源管理错误漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.34. It is, therefore, affected by the following vulnerabilities: - By specially crafting HTTP/2 requests, workers would be allocated 60 seconds longer than necessary, leading to worker exhaustion and a denial of service. (CVE-2018-1333) - By specially crafting HTTP requests, the mod_md challenge handler would dereference a NULL pointer and cause the child process to segfault. This could be used to DoS the server. (CVE-2018-8011) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "Apache HTTP Server中存在拒绝服务漏洞。远程攻击者可通过发送特制的HTTP/2请求利用该漏洞造成拒绝服务。以下版本受到影响：Apache HTTP Server 2.4.18版本，2.4.20版本，2.4.23版本，2.4.29版本，2.4.33版本，2.4.30版本。",
        "solution_en": "Upgrade to Apache version 2.4.34 or later.",
        "solution_cn": "目前厂商已发布升级补丁以修复漏洞，补丁获取链接: https://httpd.apache.org/security/vulnerabilities_24.html",
        "cve": "",
        "plugin_id": "111788"
    },
    "112119": {
        "name_en": "OpenSSL 1.0.x < 1.0.2p Multiple Vulnerabilities",
        "name_cn": "OpenSSL 加密问题漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.x prior to 1.0.2p. It is, therefore, affected by a denial of service vulnerability and a cache timing side channel vulnerability.",
        "describe_cn": "OpenSSL 1.1.0版本至1.1.0h版本和1.0.2版本至1.0.2o版本中存在加密问题漏洞。该漏洞源于网络系统或产品未正确使用相关密码算法，导致内容未正确加密、弱加密、明文存储敏感信息等。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2p or later.",
        "solution_cn": "厂商已发布升级补丁以修复漏洞，补丁获取链接： https://www.openssl.org/news/secadv/20180612.txt",
        "cve": "",
        "plugin_id": "112119"
    },
    "117807": {
        "name_en": "Apache 2.4.x < 2.4.35 DoS",
        "name_cn": "Apache HTTP Server 安全漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.35. It is, therefore, affected by the following vulnerability: - By sending continuous SETTINGS frames of maximum size an ongoing HTTP/2 connection could be kept busy and would never time out. This can be abused for a DoS on the server. This only affect a server that has enabled the h2 protocol. Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "Apache HTTP Server 2.4.17版本至2.4.34版本中存在安全漏洞。攻击者可通过持续发送较大的SETTINGS帧利用该漏洞在客户端占据连接，服务器线程和CPU时间时造成连接超时失效，导致拒绝服务。",
        "solution_en": "Upgrade to Apache version 2.4.35 or later.",
        "solution_cn": "目前厂商已发布升级补丁以修复漏洞，补丁获取链接： https://httpd.apache.org/security/vulnerabilities_24.html",
        "cve": "",
        "plugin_id": "117807"
    },
    "121355": {
        "name_en": "Apache 2.4.x < 2.4.38 Multiple Vulnerabilities",
        "name_cn": "Apache HTTP Server 资源管理错误漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.38. It is, therefore, affected by multiple vulnerabilities: - A denial of service (DoS) vulnerability exists in HTTP/2 steam handling. An unauthenticated, remote attacker can exploit this issue, via sending request bodies in a slow loris way to plain resources, to occupy a server thread. (CVE-2018-17189) - A vulnerability exists in mod_sesion_cookie, as it does not properly check the expiry time of cookies. (CVE-2018-17199) - A denial of service (DoS) vulnerability exists in mod_ssl when used with OpenSSL 1.1.1 due to an interaction in changes to handling of renegotiation attempts. An unauthenticated, remote attacker can exploit this issue to cause mod_ssl to stop responding. (CVE-2019-0190) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "Apache HTTP Server 2.4.17版本至2.4.37版本中存在资源管理错误漏洞。该漏洞源于网络系统或产品对系统资源（如内存、磁盘空间、文件等）的管理不当。",
        "solution_en": "Upgrade to Apache version 2.4.38 or later.",
        "solution_cn": "目前厂商已发布升级补丁以修复漏洞，补丁获取链接： https://httpd.apache.org/security/vulnerabilities_24.html",
        "cve": "",
        "plugin_id": "121355"
    },
    "121383": {
        "name_en": "OpenSSL 1.0.x < 1.0.2q Multiple Vulnerabilities",
        "name_cn": "OpenSSL 信息泄露漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.x prior to 1.0.2q. It is, therefore, affected by a denial of service vulnerability and a cache timing side channel vulnerability.",
        "describe_cn": "OpenSSL是OpenSSL团队的一个开源的能够实现安全套接层（SSLv2/v3）和安全传输层（TLSv1）协议的通用加密库。该产品支持多种加密算法，包括对称密码、哈希算法、安全散列算法等。 OpenSSL中存在信息泄露漏洞。该漏洞源于网络系统或产品在运行过程中存在配置等错误。未授权的攻击者可利用漏洞获取受影响组件敏感信息。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2q or later.",
        "solution_cn": "厂商暂未发布修复措施解决此安全问题，建议使用此软件的用户随时关注厂商主页或参考网址以获取解决办法： https://github.com/bbbrumley/portsmash",
        "cve": "",
        "plugin_id": "121383"
    },
    "122060": {
        "name_en": "Apache 2.4.x < 2.4.33 Multiple Vulnerabilities",
        "name_cn": "Apache httpd 安全漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.33. It is, therefore, affected by multiple vulnerabilities: - An out of bounds write vulnerability exists in mod_authnz_ldap with AuthLDAPCharsetConfig enabled. An unauthenticated, remote attacker can exploit this, via the Accept-Language header value, to cause the application to stop responding. (CVE-2017-15710) - An arbitrary file upload vulnerability exists in the FilesMatch component where a malicious filename can be crafted to match the expression check for a newline character. An unauthenticated, remote attacker can exploit this, via newline character, to upload arbitrary files on the remote host subject to the privileges of the user. (CVE-2017-15715) - A session management vulnerability exists in the mod_session component due to SessionEnv being enabled and forwarding it's session data to the CGI Application. An unauthenticated, remote attacker can exploit this, via tampering the HTTP_SESSION and using a session header, to influence content. (CVE-2018-1283) - An out of bounds access vulnerability exists when the size limit is reached. An unauthenticated, remote attacker can exploit this, to cause the Apache HTTP Server to crash. (CVE-2018-1301) - A write after free vulnerability exists in HTTP/2 stream due to a NULL pointer being written to an area of freed memory. An unauthenticated, remote attacker can exploit this to execute arbitrary code. (CVE-2018-1302) - An out of bounds read vulnerability exists in mod_cache_socache. An unauthenticated, remote attacker can exploit this, via a specially crafted HTTP request header to cause the application to stop responding. (CVE-2018-1303) - A weak digest vulnerability exists in the HTTP digest authentication challenge. An unauthenticated, remote attacker can exploit this in a cluster of servers configured to use a common digest authentication, to replay HTTP requests across servers without being detected. (CVE-2018-1312) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "Apache httpd 2.0.23版本至2.0.65版本、2.2.0版本至2.2.34和2.4.0版本至2.4.29版本中的mod_authnz_ldap存在安全漏洞。攻击者可利用该漏洞造成拒绝服务（崩溃和越边界写入）。",
        "solution_en": "Upgrade to Apache version 2.4.33 or later.",
        "solution_cn": "目前厂商已发布升级补丁以修复漏洞，补丁获取链接： https://httpd.apache.org/security/vulnerabilities_24.html",
        "cve": "",
        "plugin_id": "122060"
    },
    "122504": {
        "name_en": "OpenSSL 1.0.x < 1.0.2r Information Disclosure Vulnerability",
        "name_cn": "OpenSSL 信息泄露漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its banner, the version of OpenSSL running on the remote host is 1.0.x prior to 1.0.2r. It is, therefore, affected by an information disclosure vulnerability due to the decipherable way a application responds to a 0 byte record. An unauthenticated, remote attacker could exploit this vulnerability, via a padding oracle attack, to potentially disclose sensitive information. Note: Only 'non-stitched' ciphersuites are exploitable.",
        "describe_cn": "OpenSSL是OpenSSL团队的一个开源的能够实现安全套接层（SSLv2/v3）和安全传输层（TLSv1）协议的通用加密库。该产品支持多种加密算法，包括对称密码、哈希算法、安全散列算法等。 OpenSSL 1.0.2版本中存在信息泄露漏洞。攻击者可利用该漏洞绕过访问限制，获取敏感信息。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2r or later.",
        "solution_cn": "厂商已发布升级补丁以修复漏洞，补丁获取链接： https://www.openssl.org/news/secadv/20190226.txt",
        "cve": "",
        "plugin_id": "122504"
    },
    "123642": {
        "name_en": "Apache 2.4.x < 2.4.39 Multiple Vulnerabilities",
        "name_cn": "Apache httpd 安全漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its banner, the version of Apache running on the remote host is 2.4.x prior to 2.4.39. It is, therefore, affected by multiple vulnerabilities: - A privilege escalation vulnerability exists in module scripts due to an ability to execute arbitrary code as the parent process by manipulating the scoreboard. (CVE-2019-0211) - An access control bypass vulnerability exists in mod_auth_digest due to a race condition when running in a threaded server. An attacker with valid credentials could authenticate using another username. (CVE-2019-0217) - An access control bypass vulnerability exists in mod_ssl when using per-location client certificate verification with TLSv1.3. (CVE-2019-0215) In addition, Apache httpd is also affected by several additional vulnerabilities including a denial of service, read-after-free and URL path normalization inconsistencies. Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "Apache httpd 2.4.18版本至2.4.38版本中存在安全漏洞。",
        "solution_en": "Upgrade to Apache version 2.4.39 or later.",
        "solution_cn": "目前厂商已发布升级补丁以修复漏洞，补丁获取链接： https://httpd.apache.org/security/vulnerabilities_24.html",
        "cve": "",
        "plugin_id": "123642"
    },
    "128033": {
        "name_en": "Apache 2.4.x < 2.4.41 Multiple Vulnerabilities",
        "name_cn": "HTTP/2 资源管理错误漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.41. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.41 advisory, including the following: - A limited cross-site scripting issue was reported affecting the mod_proxy error page. An attacker could cause the link on the error page to be malformed and instead point to a page of their choice. This would only be exploitable where a server was set up with proxying enabled but was misconfigured in such a way that the Proxy Error page was displayed. (CVE-2019-10092) - HTTP/2 (2.4.20 through 2.4.39) very early pushes, for example configured with H2PushResource, could lead to an overwrite of memory in the pushing request's pool, leading to crashes. The memory copied is that of the configured push link header values, not data supplied by the client. (CVE-2019-10081) - Some HTTP/2 implementations are vulnerable to unconstrained internal data buffering, potentially leading to a denial of service. The attacker opens the HTTP/2 window so the peer can send without constraint; however, they leave the TCP window closed so the peer cannot actually write (many of) the bytes on the wire. The attacker then sends a stream of requests for a large response object. Depending on how the servers queue the responses, this can consume excess memory, CPU, or both. (CVE-2019-9517) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "HTTP/2中存在资源管理错误漏洞。攻击者可利用该漏洞导致拒绝服务。",
        "solution_en": "Upgrade to Apache version 2.4.41 or later.",
        "solution_cn": "厂商已发布升级补丁以修复漏洞，详情请关注厂商主页： https://http2.github.io/",
        "cve": "",
        "plugin_id": "128033"
    },
    "128115": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2t Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2<1.0.2t多个漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of tested product installed on the remote host is prior to tested version. It is, therefore, affected by multiple vulnerabilities : - Normally in OpenSSL EC groups always have a co-factor present and this is used in side channel resistant code paths. However, in some cases, it is possible to construct a group using explicit parameters (instead of using a named curve). In those cases it is possible that such a group does not have the cofactor present. This can occur even where all the parameters match a known named curve. If such a curve is used then OpenSSL falls back to non-side channel resistant code paths which may result in full key recovery during an ECDSA signature operation. In order to be vulnerable an attacker would have to have the ability to time the creation of a large number of signatures where explicit parameters with no co-factor present are in use by an application using libcrypto. For the avoidance of doubt libssl is not vulnerable because explicit parameters are never used. OpenSSL versions 1.1.1, 1.1.0 and 1.0.2 are affected by this issue. (CVE-2019-1547) - OpenSSL has internal defaults for a directory tree where it can find a configuration file as well as certificates used for verification in TLS. This directory is most commonly referred to as OPENSSLDIR, and is configurable with the --prefix / --openssldir configuration options. For OpenSSL versions 1.1.0 and 1.1.1, the mingw configuration targets assume that resulting programs and libraries are installed in a Unix-like environment and the default prefix for program installation as well as for OPENSSLDIR should be '/usr/local'. However, mingw programs are Windows programs, and as such, find themselves looking at sub-directories of 'C:/usr/local', which may be world writable, which enables untrusted users to modify OpenSSL's default configuration, insert CA certificates, modify (or even replace) existing engine modules, etc. For OpenSSL 1.0.2, '/usr/local/ssl' is used as default for OPENSSLDIR on all Unix and Windows targets, including Visual C builds. However, some build instructions for the diverse Windows targets on 1.0.2 encourage you to specify your own --prefix. OpenSSL versions 1.1.1, 1.1.0 and 1.0.2 are affected by this issue. Due to the limited scope of affected deployments this has been assessed as low severity and therefore we are not creating new releases at this time. (CVE-2019-1552) - In situations where an attacker receives automated notification of the success or failure of a decryption attempt an attacker, after sending a very large number of messages to be decrypted, can recover a CMS/PKCS7 transported encryption key or decrypt any RSA encrypted message that was encrypted with the public RSA key, using a Bleichenbacher padding oracle attack. Applications are not affected if they use a certificate together with the private RSA key to the CMS_decrypt or PKCS7_decrypt functions to select the correct recipient info to decrypt. (CVE-2019-1563) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的测试产品版本早于测试版本。因此，它受到多个漏洞的影响：-通常在OpenSSL EC组中，总是存在一个共同因素，这用于抗侧通道的代码路径。但是，在某些情况下，可以使用显式参数（而不是使用命名曲线）构造组。在这些情况下，这类群体可能不存在辅因子。即使所有参数都与已知的命名曲线匹配，也可能发生这种情况。如果使用这种曲线，那么OpenSSL会退回到非侧通道抗代码路径，这可能会导致ECDSA签名操作期间的完整密钥恢复。为了容易受到攻击，攻击者必须能够在使用libcrypto的应用程序使用显式参数且不存在辅因子的情况下，对大量签名的创建进行计时。为避免疑问，libssl不易受攻击，因为从未使用显式参数。OpenSSL版本1.1.1、1.1.0和1.0.2受此问题影响。（CVE-2019-1547）-OpenSSL具有目录树的内部默认值，在目录树中可以找到配置文件以及用于TLS中验证的证书。该目录通常被称为OPENSSLDIR，可以通过--prefix/--OPENSSLDIR配置选项进行配置。对于OpenSSL版本1.1.0和1.1.1，mingw配置目标假定生成的程序和库安装在类似Unix的环境中，程序安装和OPENSSLDIR的默认前缀应为“/usr/local”。然而，mingw程序是Windows程序，因此，他们发现自己正在查看“C:/usr/local”的子目录，这可能是世界范围内可写的，这使不受信任的用户能够修改OpenSSL的默认配置、插入CA证书、修改（甚至替换）现有引擎模块，等等。对于OpenSSL 1.0.2，“/usr/local/ssl”被用作所有Unix和Windows目标（包括Visual C构建）上OPENSSLDIR的默认值。然而，1.0.2上针对不同Windows目标的一些构建说明鼓励您指定自己的--prefix。OpenSSL版本1.1.1、1.1.0和1.0.2受此问题影响。由于受影响部署的范围有限，这已被评估为低严重性，因此我们目前不创建新版本。（CVE-2019-1552）-在攻击者收到解密尝试成功或失败的自动通知的情况下，攻击者在发送大量要解密的消息后，可以恢复CMS/PKCS7传输的加密密钥或解密任何使用RSA公钥加密的RSA加密消息，使用Bleichenbacher填充oracle攻击。如果应用程序将证书与专用RSA密钥一起用于CMS_decrypt或PKCS7_decrypt函数，以选择要解密的正确收件人信息，则不会受到影响。（CVE-2019-1563）请注意，Nessus没有针对这些问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2t or later.",
        "solution_cn": "升级至OpenSSL 1.0.2t或更高版本。",
        "cve": "CVE-2019-1547",
        "plugin_id": "128115"
    },
    "132726": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2u Procedure Overflow Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2u过程溢出漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2u. It is, therefore, affected by a vulnerability as referenced in the 1.0.2u advisory. - There is an overflow bug in the x64_64 Montgomery squaring procedure used in exponentiation with 512-bit moduli. No EC algorithms are affected. Analysis suggests that attacks against 2-prime RSA1024, 3-prime RSA1536, and DSA1024 as a result of this defect would be very difficult to perform and are not believed likely. Attacks against DH512 are considered just feasible. However, for an attack the target would have to re-use the DH512 private key, which is not recommended anyway. Also applications directly using the low level API BN_mod_exp may be affected if they use BN_FLG_CONSTTIME. Fixed in OpenSSL 1.1.1e-dev (Affected 1.1.1-1.1.1d). Fixed in OpenSSL 1.0.2u-dev (Affected 1.0.2-1.0.2t). (CVE-2019-1551) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2u。因此，它受到1.0.2u建议中提到的漏洞的影响。-x64_64 Montgomery平方过程中存在溢出错误，该过程用于512位模的幂运算。没有EC算法受到影响。分析表明，由于该缺陷，对2-prime RSA1024、3-prime RSA1536和DSA1024的攻击将非常难以执行，而且据信不太可能。针对DH512的攻击被认为是可行的。但是，对于攻击，目标必须重新使用DH512私钥，无论如何都不建议这样做。此外，如果直接使用低级API BN_mod_exp的应用程序使用BN_FLG_CONSTTIME，可能会受到影响。在OpenSSL 1.1.1e-dev中修复（受影响1.1.1-1.1.1d）。在OpenSSL 1.0.2u-dev中修复（受影响1.0.2-1.0.2t）。（CVE-2019-1551）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2u or later.",
        "solution_cn": "升级至OpenSSL 1.0.2u或更高版本。",
        "cve": "CVE-2019-1551",
        "plugin_id": "132726"
    },
    "135290": {
        "name_en": "Apache 2.4.x < 2.4.42 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4.x < 2.4.42 多种漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.42. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.42 advisory. - In Apache HTTP Server 2.4.0 to 2.4.41, mod_proxy_ftp may use uninitialized memory when proxying to a malicious FTP server. (CVE-2020-1934) - In Apache HTTP Server 2.4.0 to 2.4.41, redirects configured with mod_rewrite that were intended to be self-referential might be fooled by encoded newlines and redirect instead to an unexpected URL within the request URL. (CVE-2020-1927) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本在2.4.42之前。因此，它受到2.4.42咨询中提到的多个漏洞的影响。-在Apache HTTP服务器2.4.0到2.4.41,mod_proxy_ftp可能使用未初始化的内存当代理到一个恶意的FTP服务器。在Apache HTTP Server 2.4.0到2.4.41中，用mod_rewrite配置的意图是自引用的重定向可能会被编码的新行所欺骗，而重定向到请求URL中一个意外的URL。(CVE-2020-1927)请注意，Nessus没有对此问题进行测试，而是只依赖于应用程序自己报告的版本号。",
        "solution_en": "Upgrade to Apache version 2.4.42 or later.",
        "solution_cn": "升级到Apache 2.4.42或更高版本。",
        "cve": "CVE-2020-1927",
        "plugin_id": "135290"
    },
    "139574": {
        "name_en": "Apache 2.4.x < 2.4.46 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4.x<2.4.46多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.46. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.46 advisory. - Apache HTTP server 2.4.32 to 2.4.44 mod_proxy_uwsgi info disclosure and possible RCE (CVE-2020-11984) - Apache HTTP Server versions 2.4.20 to 2.4.43 When trace/debug was enabled for the HTTP/2 module and on certain traffic edge patterns, logging statements were made on the wrong connection, causing concurrent use of memory pools. Configuring the LogLevel of mod_http2 above info will mitigate this vulnerability for unpatched servers. (CVE-2020-11993) - Apache HTTP Server versions 2.4.20 to 2.4.43. A specially crafted value for the 'Cache-Digest' header in a HTTP/2 request would result in a crash when the server actually tries to HTTP/2 PUSH a resource afterwards. Configuring the HTTP/2 feature via H2Push off will mitigate this vulnerability for unpatched servers. (CVE-2020-9490) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的Apache httpd版本早于2.4.46。因此，它受到2.4.46建议中提到的多个漏洞的影响Apache HTTP server 2.4.32至2.4.44 mod_proxy_uwsgi info disclosure and possible RCE（CVE-2020-11984）-Apache HTTP server版本2.4.20至2.4.43当对HTTP/2模块和某些流量边缘模式启用跟踪/调试时，在错误连接上执行日志语句，导致内存池的并发使用。配置mod_http2的LogLevel over info将缓解未修补服务器的此漏洞(CVE-2020-11993）-Apache HTTP服务器版本2.4.20至2.4.43。在HTTP/2请求中，为“Cache Digest”头精心编制的值将导致在服务器实际尝试HTTP/2之后推送资源时崩溃。通过H2Push-off配置HTTP/2功能将缓解未修补服务器的此漏洞(（CVE-2020-9490）请注意，Nessus尚未对此问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.46 or later.",
        "solution_cn": "升级至Apache 2.4.46或更高版本。",
        "cve": "CVE-2020-11984",
        "plugin_id": "139574"
    },
    "142591": {
        "name_en": "PHP < 7.3.24 Multiple Vulnerabilities",
        "name_cn": "PHP<7.3.24多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "According to its self-reported version number, the version of PHP running on the remote web server is prior to 7.3.24. It is, therefore affected by multiple vulnerabilities",
        "describe_cn": "根据其自报的版本号，在远程web服务器上运行的PHP版本早于7.3.24。因此，它受到多个漏洞的影响",
        "solution_en": "Upgrade to PHP version 7.3.24 or later.",
        "solution_cn": "升级至PHP版本7.3.24或更高版本。",
        "cve": "",
        "plugin_id": "142591"
    },
    "144053": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2x Null Pointer Dereference Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2x空指针解引用漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of tested product installed on the remote host is prior to tested version. It is, therefore, affected by a vulnerability as referenced in the 1.0.2x advisory. - The X.509 GeneralName type is a generic type for representing different types of names. One of those name types is known as EDIPartyName. OpenSSL provides a function GENERAL_NAME_cmp which compares different instances of a GENERAL_NAME to see if they are equal or not. This function behaves incorrectly when both GENERAL_NAMEs contain an EDIPARTYNAME. A NULL pointer dereference and a crash may occur leading to a possible denial of service attack. OpenSSL itself uses the GENERAL_NAME_cmp function for two purposes: 1) Comparing CRL distribution point names between an available CRL and a CRL distribution point embedded in an X509 certificate 2) When verifying that a timestamp response token signer matches the timestamp authority name (exposed via the API functions TS_RESP_verify_response and TS_RESP_verify_token) If an attacker can control both items being compared then that attacker could trigger a crash. For example if the attacker can trick a client or server into checking a malicious certificate against a malicious CRL then this may occur. Note that some applications automatically download CRLs based on a URL embedded in a certificate. This checking happens prior to the signatures on the certificate and CRL being verified. OpenSSL's s_server, s_client and verify tools have support for the -crl_download option which implements automatic CRL downloading and this attack has been demonstrated to work against those tools. Note that an unrelated bug means that affected versions of OpenSSL cannot parse or construct correct encodings of EDIPARTYNAME. However it is possible to construct a malformed EDIPARTYNAME that OpenSSL's parser will accept and hence trigger this attack. All OpenSSL 1.1.1 and 1.0.2 versions are affected by this issue. Other OpenSSL releases are out of support and have not been checked. Fixed in OpenSSL 1.1.1i (Affected 1.1.1-1.1.1h). Fixed in OpenSSL 1.0.2x (Affected 1.0.2-1.0.2w). (CVE-2020-1971) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的测试产品版本早于测试版本。因此，它受到1.0.2x建议中提到的漏洞的影响。-X.509 GeneralName类型是一种泛型类型，用于表示不同类型的名称。其中一种名称类型称为EdPartyName。OpenSSL提供了一个函数GENERAL_NAME_cmp，它比较GENERAL_NAME的不同实例，看看它们是否相等。当两个通用名称都包含EDIPARTYNAME时，此函数的行为不正确。可能会发生空指针解引用和崩溃，从而导致可能的拒绝服务攻击。OpenSSL本身使用GENERAL_NAME_cmp函数有两个目的：1）比较可用CRL和X509证书中嵌入的CRL分发点之间的CRL分发点名称2）验证时间戳响应令牌签名者是否与时间戳权限名称匹配（通过API函数TS_RESP_verify_response和TS_RESP_verify_token公开）如果攻击者可以控制正在比较的两个项目，则攻击者可能会触发崩溃。例如，如果攻击者可以诱使客户端或服务器根据恶意CRL检查恶意证书，则可能会发生这种情况。请注意，有些应用程序会根据证书中嵌入的URL自动下载CRL。该检查在验证证书和CRL上的签名之前进行。OpenSSL的_服务器、s_客户端和验证工具都支持-crl_下载选项，该选项实现了自动crl下载，并且已证明该攻击可针对这些工具。请注意，一个不相关的错误意味着受影响的OpenSSL版本无法解析或构造正确的EDIPARTYNAME编码。然而，有可能构造一个格式错误的ePartyName，OpenSSL的解析器将接受它，从而触发此攻击。所有OpenSSL 1.1.1和1.0.2版本都受此问题影响。其他OpenSSL版本不受支持，尚未检查。在OpenSSL 1.1.1i中修复（受1.1.1-1.1.1h影响）。在OpenSSL 1.0.2x中修复（受影响1.0.2-1.0.2w）。（CVE-2020-1971）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2x or later.",
        "solution_cn": "升级至OpenSSL 1.0.2x或更高版本。",
        "cve": "CVE-2020-1971",
        "plugin_id": "144053"
    },
    "146374": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2w Information Disclosure",
        "name_cn": "OpenSSL 1.0.2<1.0.2w信息披露",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The version of OpenSSL installed on the remote host is 1.0.2 prior to 1.0.2w. It is, therefore, affected by a vulnerability as referenced in the 1.0.2w advisory. The Raccoon attack exploits a flaw in the TLS specification which can lead to an attacker being able to compute the pre-master secret in connections which have used a Diffie-Hellman (DH) based ciphersuite. In such a case this would result in the attacker being able to eavesdrop on all encrypted communications sent over that TLS connection. The attack can only be exploited if an implementation re-uses a DH secret across multiple TLS connections. Note that this issue only impacts DH ciphersuites and not ECDH ciphersuites. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本是1.0.2之前的1.0.2w。因此，它受到1.0.2w建议中提到的漏洞的影响。浣熊攻击利用TLS规范中的一个漏洞，该漏洞可能导致攻击者能够在使用基于Diffie Hellman（DH）的密码套件的连接中计算主密钥前的秘密。在这种情况下，这将导致攻击者能够窃听通过该TLS连接发送的所有加密通信。只有在实现跨多个TLS连接重新使用DH机密时，才能利用该攻击。请注意，此问题仅影响DH ciphersuites，而不影响ECDH ciphersuites。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2w or later.",
        "solution_cn": "升级至OpenSSL版本1.0.2w或更高版本。",
        "cve": "CVE-2020-1968",
        "plugin_id": "146374"
    },
    "146591": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2y Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2<1.0.2y多个漏洞",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The version of tested product installed on the remote host is prior to tested version. It is, therefore, affected by multiple vulnerabilities as referenced in the 1.0.2y advisory. - The OpenSSL public API function X509_issuer_and_serial_hash() attempts to create a unique hash value based on the issuer and serial number data contained within an X509 certificate. However it fails to correctly handle any errors that may occur while parsing the issuer field (which might occur if the issuer field is maliciously constructed). This may subsequently result in a NULL pointer deref and a crash leading to a potential denial of service attack. The function X509_issuer_and_serial_hash() is never directly called by OpenSSL itself so applications are only vulnerable if they use this function directly and they use it on certificates that may have been obtained from untrusted sources. OpenSSL versions 1.1.1i and below are affected by this issue. Users of these versions should upgrade to OpenSSL 1.1.1j. OpenSSL versions 1.0.2x and below are affected by this issue. However OpenSSL 1.0.2 is out of support and no longer receiving public updates. Premium support customers of OpenSSL 1.0.2 should upgrade to 1.0.2y. Other users should upgrade to 1.1.1j. Fixed in OpenSSL 1.1.1j (Affected 1.1.1-1.1.1i). Fixed in OpenSSL 1.0.2y (Affected 1.0.2-1.0.2x). (CVE-2021-23841) - Calls to EVP_CipherUpdate, EVP_EncryptUpdate and EVP_DecryptUpdate may overflow the output length argument in some cases where the input length is close to the maximum permissable length for an integer on the platform. In such cases the return value from the function call will be 1 (indicating success), but the output length value will be negative. This could cause applications to behave incorrectly or crash. OpenSSL versions 1.1.1i and below are affected by this issue. Users of these versions should upgrade to OpenSSL 1.1.1j. OpenSSL versions 1.0.2x and below are affected by this issue. However OpenSSL 1.0.2 is out of support and no longer receiving public updates. Premium support customers of OpenSSL 1.0.2 should upgrade to 1.0.2y. Other users should upgrade to 1.1.1j. Fixed in OpenSSL 1.1.1j (Affected 1.1.1-1.1.1i). Fixed in OpenSSL 1.0.2y (Affected 1.0.2-1.0.2x). (CVE-2021-23840) - OpenSSL 1.0.2 supports SSLv2. If a client attempts to negotiate SSLv2 with a server that is configured to support both SSLv2 and more recent SSL and TLS versions then a check is made for a version rollback attack when unpadding an RSA signature. Clients that support SSL or TLS versions greater than SSLv2 are supposed to use a special form of padding. A server that supports greater than SSLv2 is supposed to reject connection attempts from a client where this special form of padding is present, because this indicates that a version rollback has occurred (i.e. both client and server support greater than SSLv2, and yet this is the version that is being requested). The implementation of this padding check inverted the logic so that the connection attempt is accepted if the padding is present, and rejected if it is absent. This means that such as server will accept a connection if a version rollback attack has occurred. Further the server will erroneously reject a connection if a normal SSLv2 connection attempt is made. Only OpenSSL 1.0.2 servers from version 1.0.2s to 1.0.2x are affected by this issue. In order to be vulnerable a 1.0.2 server must: 1) have configured SSLv2 support at compile time (this is off by default), 2) have configured SSLv2 support at runtime (this is off by default), 3) have configured SSLv2 ciphersuites (these are not in the default ciphersuite list) OpenSSL 1.1.1 does not have SSLv2 support and therefore is not vulnerable to this issue. The underlying error is in the implementation of the RSA_padding_check_SSLv23() function. This also affects the RSA_SSLV23_PADDING padding mode used by various other functions. Although 1.1.1 does not support SSLv2 the RSA_padding_check_SSLv23() function still exists, as does the RSA_SSLV23_PADDING padding mode. Applications that directly call that function or use that padding mode will encounter this issue. However since there is no support for the SSLv2 protocol in 1.1.1 this is considered a bug and not a security issue in that version. OpenSSL 1.0.2 is out of support and no longer receiving public updates. Premium support customers of OpenSSL 1.0.2 should upgrade to 1.0.2y. Other users should upgrade to 1.1.1j. Fixed in OpenSSL 1.0.2y (Affected 1.0.2s-1.0.2x). (CVE-2021-23839) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的测试产品版本早于测试版本。因此，它受到1.0.2y咨询中提到的多个漏洞的影响。-OpenSSL公共API函数X509_issuer_和_serial_hash（）尝试基于X509证书中包含的颁发者和序列号数据创建唯一的哈希值。但是，它无法正确处理解析issuer字段时可能发生的任何错误（如果issuer字段是恶意构造的，则可能会发生错误）。这可能会导致空指针失效和崩溃，从而导致潜在的拒绝服务攻击。OpenSSL本身从未直接调用函数X509_issuer_和_serial_hash（），因此只有当应用程序直接使用该函数，并在可能从不受信任的来源获取的证书上使用该函数时，应用程序才会受到攻击。OpenSSL版本1.1.1i及以下版本受此问题影响。这些版本的用户应该升级到OpenSSL 1.1.1j。OpenSSL 1.0.2x及以下版本受此问题影响。然而，OpenSSL 1.0.2已不受支持，不再接收公共更新。OpenSSL 1.0.2的高级支持客户应升级到1.0.2y。其他用户应升级至1.1.1j。在OpenSSL 1.1.1j中修复（受1.1.1-1.1.1i影响）。在OpenSSL 1.0.2y中修复（受影响1.0.2-1.0.2x）。（CVE-2021-23841）-在某些情况下，对EVP_CipherUpdate、EVP_EncryptUpdate和EVP_DecryptUpdate的调用可能会使输出长度参数溢出，其中输入长度接近平台上整数的最大允许长度。在这种情况下，函数调用的返回值将为1（表示成功），但输出长度值将为负值。这可能会导致应用程序行为不正确或崩溃。OpenSSL版本1.1.1i及以下版本受此问题影响。这些版本的用户应该升级到OpenSSL 1.1.1j。OpenSSL 1.0.2x及以下版本受此问题影响。然而，OpenSSL 1.0.2已不受支持，不再接收公共更新。OpenSSL 1.0.2的高级支持客户应升级到1.0.2y。其他用户应升级至1.1.1j。在OpenSSL 1.1.1j中修复（受1.1.1-1.1.1i影响）。在OpenSSL 1.0.2y中修复（受影响1.0.2-1.0.2x）。（CVE-2021-23840）-OpenSSL 1.0.2支持SSLv2。如果客户机试图与配置为同时支持SSLv2和更新的SSL和TLS版本的服务器协商SSLv2，则在添加RSA签名时会检查版本回滚攻击。支持SSL或TLS版本大于SSLv2的客户端应该使用特殊形式的填充。支持大于SSLv2的服务器应该拒绝来自存在这种特殊填充形式的客户端的连接尝试，因为这表明发生了版本回滚（即客户端和服务器都支持大于SSLv2的版本，但这是被请求的版本）。这种填充检查的实现颠倒了逻辑，因此，如果存在填充，连接尝试将被接受，如果不存在填充，连接尝试将被拒绝。这意味着，如果发生版本回滚攻击，例如服务器将接受连接。此外，如果尝试正常的SSLv2连接，服务器将错误地拒绝连接。只有版本1.0.2s到1.0.2x的OpenSSL 1.0.2服务器受此问题影响。为了使1.0.2服务器易受攻击，必须：1）在编译时配置了SSLv2支持（默认为关闭），2）在运行时配置了SSLv2支持（默认为关闭），3）已配置SSLv2密码套件（这些不在默认密码套件列表中）OpenSSL 1.1.1不支持SSLv2，因此不易受到此问题的攻击。基本错误是在RSA_padding_check_SSLv23（）函数的实现中。这也会影响其他各种函数使用的RSA_SSLV23_填充模式。尽管1.1.1不支持SSLv2，但RSA_padding_check_SSLv23（）函数仍然存在，RSA_SSLv23_padding模式也是如此。直接调用该函数或使用该填充模式的应用程序将遇到此问题。但是，由于1.1.1中不支持SSLv2协议，因此在该版本中，这被视为一个错误，而不是安全问题。OpenSSL 1.0.2已不受支持，不再接收公共更新。OpenSSL 1.0.2的高级支持客户应升级到1.0.2y。其他用户应升级至1.1.1j。在OpenSSL 1.0.2y中修复（受影响1.0.2s-1.0.2x）。（CVE-2021-23839）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2y or later.",
        "solution_cn": "升级至OpenSSL版本1.0.2y或更高版本。",
        "cve": "CVE-2021-23839",
        "plugin_id": "146591"
    },
    "150280": {
        "name_en": "Apache 2.4.x < 2.4.47 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4。x<2.4.47多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.47. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.47 changelog: - Unexpected <Location> section matching with 'MergeSlashes OFF' (CVE-2021-30641) - mod_auth_digest: possible stack overflow by one nul byte while validating the Digest nonce. (CVE-2020-35452) - mod_session: Fix possible crash due to NULL pointer dereference, which could be used to cause a Denial of Service with a malicious backend server and SessionHeader. (CVE-2021-26691) - mod_session: Fix possible crash due to NULL pointer dereference, which could be used to cause a Denial of Service. (CVE-2021-26690) - mod_proxy_http: Fix possible crash due to NULL pointer dereference, which could be used to cause a Denial of Service. (CVE-2020-13950) - Windows: Prevent local users from stopping the httpd process (CVE-2020-13938) - mod_proxy_wstunnel, mod_proxy_http: Handle Upgradable protocols end-to-end negotiation. (CVE-2019-17567) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.47。因此，它受到2.4.47变更日志中引用的多个漏洞的影响：-与“MergeSlashes OFF”（CVE-2021-30641）匹配的意外<Location>部分-mod_auth_digest:验证摘要nonce时，堆栈可能溢出一个nul字节。（CVE-2020-35452）-mod_session：修复由于空指针解引用导致的可能崩溃，该故障可用于导致恶意后端服务器和SessionHeader的拒绝服务。（CVE-2021-26691）-mod_会话：修复可能由于空指针解引用而导致的崩溃，这可能会导致拒绝服务。（CVE-2021-26690）-mod_proxy_http：修复可能因空指针解引用而导致的崩溃，该故障可用于导致拒绝服务。（CVE-2020-13950）-Windows：防止本地用户停止httpd进程（CVE-2020-13938）-mod_proxy_wstunnel，mod_proxy_http：处理可升级的协议端到端协商。（CVE-2019-17567）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.47 or later.",
        "solution_cn": "升级至Apache 2.4.47或更高版本。",
        "cve": "CVE-2019-17567",
        "plugin_id": "150280"
    },
    "152780": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2za Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2za漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2za. It is, therefore, affected by a vulnerability as referenced in the 1.0.2za advisory. - ASN.1 strings are represented internally within OpenSSL as an ASN1_STRING structure which contains a buffer holding the string data and a field holding the buffer length. This contrasts with normal C strings which are repesented as a buffer for the string data which is terminated with a NUL (0) byte. Although not a strict requirement, ASN.1 strings that are parsed using OpenSSL's own d2i functions (and other similar parsing functions) as well as any string whose value has been set with the ASN1_STRING_set() function will additionally NUL terminate the byte array in the ASN1_STRING structure. However, it is possible for applications to directly construct valid ASN1_STRING structures which do not NUL terminate the byte array by directly setting the data and length fields in the ASN1_STRING array. This can also happen by using the ASN1_STRING_set0() function. Numerous OpenSSL functions that print ASN.1 data have been found to assume that the ASN1_STRING byte array will be NUL terminated, even though this is not guaranteed for strings that have been directly constructed. Where an application requests an ASN.1 structure to be printed, and where that ASN.1 structure contains ASN1_STRINGs that have been directly constructed by the application without NUL terminating the data field, then a read buffer overrun can occur. The same thing can also occur during name constraints processing of certificates (for example if a certificate has been directly constructed by the application instead of loading it via the OpenSSL parsing functions, and the certificate contains non NUL terminated ASN1_STRING structures). It can also occur in the X509_get1_email(), X509_REQ_get1_email() and X509_get1_ocsp() functions. If a malicious actor can cause an application to directly construct an ASN1_STRING and then process it through one of the affected OpenSSL functions then this issue could be hit. This might result in a crash (causing a Denial of Service attack). It could also result in the disclosure of private memory contents (such as private keys, or sensitive plaintext). Fixed in OpenSSL 1.0.2za (Affected 1.0.2-1.0.2y). (CVE-2021-3712) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2za。因此，它受到1.0.2za建议中提到的漏洞的影响。-ASN。1字符串在OpenSSL内部表示为ASN1_字符串结构，其中包含一个保存字符串数据的缓冲区和一个保存缓冲区长度的字段。这与普通的C字符串形成对比，后者作为字符串数据的缓冲区，以NUL（0）字节结尾。虽然不是严格的要求，ASN。1使用OpenSSL自己的d2i函数（和其他类似的解析函数）解析的字符串，以及使用ASN1_string_set（）函数设置值的任何字符串，将额外NUL终止ASN1_字符串结构中的字节数组。但是，应用程序可以通过直接设置ASN1_字符串数组中的数据和长度字段，直接构造有效的ASN1_字符串结构，而不会以NUL终止字节数组。这也可以通过使用ASN1_STRING_set0（）函数实现。许多打印ASN的OpenSSL函数。1已发现数据假设ASN1_字符串字节数组将以NUL结尾，尽管直接构造的字符串不能保证这一点。其中应用程序请求ASN。1要打印的结构，以及ASN的位置。1结构包含由应用程序直接构造的ASN1_字符串，无需NUL终止数据字段，则可能发生读取缓冲区溢出。在证书的名称约束处理过程中也可能发生同样的情况（例如，如果证书是由应用程序直接构造的，而不是通过OpenSSL解析函数加载的，并且证书包含以非NUL结尾的ASN1_字符串结构）。它也可以出现在X509_get1_email（）、X509_REQ_get1_email（）和X509_get1_ocsp（）函数中。如果恶意参与者可以导致应用程序直接构造ASN1_字符串，然后通过受影响的OpenSSL函数之一对其进行处理，那么这个问题可能会受到影响。这可能会导致崩溃（导致拒绝服务攻击）。它还可能导致私密内存内容（如私钥或敏感明文）的泄露。在OpenSSL 1.0.2za中修复（受影响1.0.2-1.0.2y）。（CVE-2021-3712）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2za or later.",
        "solution_cn": "升级至OpenSSL 1.0.2za或更高版本。",
        "cve": "CVE-2021-3712",
        "plugin_id": "152780"
    },
    "152853": {
        "name_en": "PHP < 7.3.28 Email Header Injection",
        "name_cn": "PHP<7.3.28电子邮件头插入",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "According to its self-reported version number, the version of PHP running on the remote web server is prior to 7.3.28. It is, therefore affected by an email header injection vulnerability, due to a failure to properly handle CR-LF sequences in header fields. An unauthenticated, remote attacker can exploit this, by inserting line feed characters into email headers, to gain full control of email header content.",
        "describe_cn": "根据其自我报告的版本号，在远程web服务器上运行的PHP版本早于7.3.28。因此，由于未能正确处理标头字段中的CR-LF序列，它会受到电子邮件标头注入漏洞的影响。未经验证的远程攻击者可以通过在电子邮件头中插入换行符来利用此漏洞，以获得对电子邮件头内容的完全控制。",
        "solution_en": "Upgrade to PHP version 7.3.28 or later.",
        "solution_cn": "升级至PHP 7.3.28或更高版本。",
        "cve": "",
        "plugin_id": "152853"
    },
    "153583": {
        "name_en": "Apache < 2.4.49 Multiple Vulnerabilities",
        "name_cn": "Apache<2.4.49多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.49. It is, therefore, affected by a vulnerability as referenced in the 2.4.49 changelog. - A crafted request uri-path can cause mod_proxy to forward the request to an origin server choosen by the remote user. (CVE-2021-40438) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.49。因此，它受到2.4.49变更日志中引用的漏洞的影响。-精心编制的请求uri路径可能会导致mod_proxy将请求转发到远程用户选择的源服务器。（CVE-2021-40438）请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.49 or later.",
        "solution_cn": "升级至Apache 2.4.49或更高版本。",
        "cve": "CVE-2021-40438",
        "plugin_id": "153583"
    },
    "153584": {
        "name_en": "Apache < 2.4.49 Multiple Vulnerabilities",
        "name_cn": "Apache<2.4.49多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.49. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.49 changelog. - ap_escape_quotes() may write beyond the end of a buffer when given malicious input. No included modules pass untrusted data to these functions, but third-party / external modules may. (CVE-2021-39275) - Malformed requests may cause the server to dereference a NULL pointer. (CVE-2021-34798) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.49。因此，它受到2.4.49变更日志中引用的多个漏洞的影响。-当给定恶意输入时，ap_escape_quotes（）可能会写入缓冲区之外的内容。没有包含的模块将不受信任的数据传递给这些功能，但第三方/外部模块可能会。（CVE-2021-39275）-格式错误的请求可能会导致服务器取消对空指针的引用。（CVE-2021-34798）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.49 or later.",
        "solution_cn": "升级至Apache 2.4.49或更高版本。",
        "cve": "CVE-2021-34798",
        "plugin_id": "153584"
    },
    "153585": {
        "name_en": "Apache >= 2.4.17 < 2.4.49 mod_http2",
        "name_cn": "Apache>=2.4.17<2.4.49 mod_http2",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of Apache httpd installed on the remote host is greater than 2.4.17 and prior to 2.4.49. It is, therefore, affected by a vulnerability as referenced in the 2.4.49 changelog. A crafted method sent through HTTP/2 will bypass validation and be forwarded by mod_proxy, which can lead to request splitting or cache poisoning. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "安装在远程主机上的Apache httpd版本高于2.4.17，低于2.4.49。因此，它受到2.4.49变更日志中引用的漏洞的影响。通过HTTP/2发送的特制方法将绕过验证，并由mod_代理转发，这可能会导致请求拆分或缓存中毒。请注意，Nessus没有针对这个问题进行测试，而是只依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.49 or later.",
        "solution_cn": "升级至Apache 2.4.49或更高版本。",
        "cve": "CVE-2021-33193",
        "plugin_id": "153585"
    },
    "156255": {
        "name_en": "Apache 2.4.x < 2.4.52 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4。x<2.4.52多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is equal to or greater than 2.4.7 and prior to 2.4.52. It is, therefore, affected by a flaw related to acting as a forward proxy. A crafted URI sent to httpd configured as a forward proxy (ProxyRequests on) can cause a crash (NULL pointer dereference) or, for configurations mixing forward and reverse proxy declarations, can allow for requests to be directed to a declared Unix Domain Socket endpoint (Server Side Request Forgery). Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.52。因此，它受到2.4.52建议中提到的多个漏洞的影响。-发送到配置为转发代理（ProxyRequests on）的httpd的精心编制的URI可能会导致崩溃（空指针取消引用），或者，对于混合了转发和反向代理声明的配置，可以允许将请求定向到已声明的Unix域套接字端点（服务器端请求伪造）。此问题影响Apache HTTP服务器2.4.7至2.4.51（包括）。（CVE-2021-44224）-精心编制的请求正文可能会导致mod_lua多部分解析器中的缓冲区溢出（从lua脚本调用r:parsebody（））。Apache httpd团队不知道有人利用该漏洞进行攻击，尽管可能会设计一个漏洞。此问题影响Apache HTTP Server 2.4.51及更早版本。（CVE-2021-44790）请注意，Nessus没有针对该问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.52 or later.",
        "solution_cn": "升级至Apache 2.4.52或更高版本。",
        "cve": "CVE-2021-44224",
        "plugin_id": "156255"
    },
    "157231": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2zc-dev Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2zc-dev漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2zc-dev. It is, therefore, affected by a vulnerability as referenced in the 1.0.2zc-dev advisory. - There is a carry propagation bug in the MIPS32 and MIPS64 squaring procedure. Many EC algorithms are affected, including some of the TLS 1.3 default curves. Impact was not analyzed in detail, because the pre-requisites for attack are considered unlikely and include reusing private keys. Analysis suggests that attacks against RSA and DSA as a result of this defect would be very difficult to perform and are not believed likely. Attacks against DH are considered just feasible (although very difficult) because most of the work necessary to deduce information about a private key may be performed offline. The amount of resources required for such an attack would be significant. However, for an attack on TLS to be meaningful, the server would have to share the DH private key among multiple clients, which is no longer an option since CVE-2016-0701. This issue affects OpenSSL versions 1.0.2, 1.1.1 and 3.0.0. It was addressed in the releases of 1.1.1m and 3.0.1 on the 15th of December 2021. For the 1.0.2 release it is addressed in git commit 6fc1aaaf3 that is available to premium support customers only. It will be made available in 1.0.2zc when it is released. The issue only affects OpenSSL on MIPS platforms. Fixed in OpenSSL 3.0.1 (Affected 3.0.0). Fixed in OpenSSL 1.1.1m (Affected 1.1.1-1.1.1l). Fixed in OpenSSL 1.0.2zc- dev (Affected 1.0.2-1.0.2zb). (CVE-2021-4160) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2zc-dev。因此，它受到1.0.2zx-dev建议中提到的漏洞的影响。-MIPS32和MIPS64平方过程中存在进位传播错误。许多EC算法都受到影响，包括一些TLS 1.3默认曲线。没有详细分析影响，因为攻击的先决条件被认为不太可能，包括重用私钥。分析表明，由于该缺陷而对RSA和DSA进行的攻击将非常难以执行，而且据信不太可能。对DH的攻击被认为是可行的（尽管非常困难），因为推断关于私钥的信息所需的大部分工作可以离线执行。这种攻击所需的资源量将是巨大的。然而，要使TLS攻击有意义，服务器必须在多个客户端之间共享DH私钥，这在CVE-2016-0701之后不再是一个选项。此问题影响OpenSSL 1.0.2、1.1.1和3.0.0版本。2021 12月15日发布的1.1.1万和3.01万版本中解决了这一问题。对于1.0.2版本，它是在gitcommit 6fc1aaf3中解决的，该版本仅适用于高级支持客户。它将在1.0.2zc中发布。该问题仅影响MIPS平台上的OpenSSL。在OpenSSL 3.0.1中修复（受影响的3.0.0）。在OpenSSL 1.1.1m中修复（受到影响的1.1.1-1.1l）。在OpenSSL 1.0.2zc-dev中修复了（受影响1.0.2-1.0.2zb）。（CVE-221-4160）请注意，Nessus尚未测试此问题，但只依赖于应用程序的自报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2zc-dev or later.",
        "solution_cn": "升级至OpenSSL 1.0.2zc-dev或更高版本。",
        "cve": "CVE-2021-4160",
        "plugin_id": "157231"
    },
    "158900": {
        "name_en": "Apache 2.4.x < 2.4.53 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4.x<2.4.53多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.53. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.53 advisory. - mod_lua Use of uninitialized value of in r:parsebody: A carefully crafted request body can cause a read to a random memory area which could cause the process to crash. This issue affects Apache HTTP Server 2.4.52 and earlier. Acknowledgements: Chamal De Silva (CVE-2022-22719) - HTTP request smuggling: Apache HTTP Server 2.4.52 and earlier fails to close inbound connection when errors are encountered discarding the request body, exposing the server to HTTP Request Smuggling Acknowledgements: James Kettle <james.kettle portswigger.net> (CVE-2022-22720) - Possible buffer overflow with very large or unlimited LimitXMLRequestBody in core: If LimitXMLRequestBody is set to allow request bodies larger than 350MB (defaults to 1M) on 32 bit systems an integer overflow happens which later causes out of bounds writes. This issue affects Apache HTTP Server 2.4.52 and earlier. Acknowledgements: Anonymous working with Trend Micro Zero Day Initiative (CVE-2022-22721) - Read/write beyond bounds in mod_sed: Out-of-bounds Write vulnerability in mod_sed of Apache HTTP Server allows an attacker to overwrite heap memory with possibly attacker provided data. This issue affects Apache HTTP Server 2.4 version 2.4.52 and prior versions. Acknowledgements: Ronald Crane (Zippenhop LLC) (CVE-2022-23943) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.53。因此，它受到2.4.53咨询中提到的多个漏洞的影响mod_lua在r:parsebody中使用未初始化的值：精心设计的请求体可能会导致对随机内存区域的读取，从而导致进程崩溃。此问题影响Apache HTTP Server 2.4.52和更早版本。确认：Chamal De Silva（CVE-2022-22719）-HTTP请求走私：当遇到错误时，Apache HTTP Server 2.4.52和更早版本无法关闭入站连接，丢弃请求主体，将服务器暴露于HTTP请求走私确认：James Kettle<James.kett portswigger.net>（CVE-2022-22720）-内核中可能存在非常大或无限的LimitXMLRequestBody缓冲区溢出：如果LimitXMLRequest Body设置为允许32位系统上的请求体大于350MB（默认值为1M），则会发生整数溢出，随后会导致越界写入。此问题影响Apache HTTP Server 2.4.52和更早版本。确认：匿名使用Trend Micro Zero Day Initiative（CVE-2022-22721）-mod_sed中的读/写超出界限：Apache HTTP服务器mod_sed的写漏洞允许攻击者使用攻击者提供的数据覆盖堆内存。此问题会影响Apache HTTP Server 2.4版本2.4.52和以前的版本。致谢：Ronald Crane（Zippenhop LLC）（CVE-2022-23943）请注意，Nessus尚未对此问题进行测试，而是仅依赖于应用程序的自报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.53 or later.",
        "solution_cn": "升级至Apache 2.4.53或更高版本。",
        "cve": "CVE-2022-22719",
        "plugin_id": "158900"
    },
    "158973": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2zd Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2zd漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2zd. It is, therefore, affected by a vulnerability as referenced in the 1.0.2zd advisory. - The BN_mod_sqrt() function, which computes a modular square root, contains a bug that can cause it to loop forever for non-prime moduli. Internally this function is used when parsing certificates that contain elliptic curve public keys in compressed form or explicit elliptic curve parameters with a base point encoded in compressed form. It is possible to trigger the infinite loop by crafting a certificate that has invalid explicit curve parameters. Since certificate parsing happens prior to verification of the certificate signature, any process that parses an externally supplied certificate may thus be subject to a denial of service attack. The infinite loop can also be reached when parsing crafted private keys as they can contain explicit elliptic curve parameters. Thus vulnerable situations include: - TLS clients consuming server certificates - TLS servers consuming client certificates - Hosting providers taking certificates or private keys from customers - Certificate authorities parsing certification requests from subscribers - Anything else which parses ASN.1 elliptic curve parameters Also any other applications that use the BN_mod_sqrt() where the attacker can control the parameter values are vulnerable to this DoS issue. In the OpenSSL 1.0.2 version the public key is not parsed during initial parsing of the certificate which makes it slightly harder to trigger the infinite loop. However any operation which requires the public key from the certificate will trigger the infinite loop. In particular the attacker can use a self- signed certificate to trigger the loop during verification of the certificate signature. This issue affects OpenSSL versions 1.0.2, 1.1.1 and 3.0. It was addressed in the releases of 1.1.1n and 3.0.2 on the 15th March 2022. Fixed in OpenSSL 3.0.2 (Affected 3.0.0,3.0.1). Fixed in OpenSSL 1.1.1n (Affected 1.1.1-1.1.1m). Fixed in OpenSSL 1.0.2zd (Affected 1.0.2-1.0.2zc). (CVE-2022-0778) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2zd。因此，它受到1.0.2zd建议中提到的漏洞的影响。-计算模平方根的BN_mod_sqrt（）函数包含一个错误，它可能导致非素模永远循环。在内部，当解析包含压缩形式的椭圆曲线公钥或以压缩形式编码的基点的显式椭圆曲线参数的证书时，使用此函数。通过制作具有无效显式曲线参数的凭证，可以触发无限循环。由于证书解析发生在验证证书签名之前，因此解析外部提供的证书的任何进程都可能受到拒绝服务攻击。解析特制的私钥时也可以到达无限循环，因为它们可以包含显式椭圆曲线参数。因此，易受攻击的情况包括：-TLS客户端使用服务器证书-TLS服务器使用客户端证书-托管提供商从客户处获取证书或私钥-证书颁发机构解析来自订户的证书请求-解析ASN.1椭圆曲线参数的任何其他应用程序还有任何使用BN_mod_sqrt（）的应用程序，其中攻击者可以控制参数值，因此易受此DoS问题的影响。在OpenSSL 1.0.2版本中，公钥在证书的初始解析过程中不被解析，这使得触发无限循环稍微困难一些。然而，任何需要证书公钥的操作都将触发无限循环。特别是，攻击者可以在验证证书签名期间使用自签名证书来触发循环。此问题影响OpenSSL版本1.0.2、1.1.1和3.0。在2022年3月15日发布的1.1.1n和3.0.2版本中解决了这一问题。已在OpenSSL 3.0.2中修复（受影响的3.0.0,3.0.1）。已在OpenSSL1.1.1n中修复（受到影响的1.1.1-1.1.1m）。在OpenSSL 1.0.2zd中修复（被影响的1.0.2-1.0.2zc）。（CVE-2022-0778）请注意，Nessus尚未对此问题进行测试，而是仅依赖于应用程序的自报版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2zd or later.",
        "solution_cn": "升级至OpenSSL 1.0.2zd或更高版本。",
        "cve": "CVE-2022-0778",
        "plugin_id": "158973"
    },
    "160480": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2ze Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2ze漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2ze. It is, therefore, affected by a vulnerability as referenced in the 1.0.2ze advisory. - The c_rehash script does not properly sanitise shell metacharacters to prevent command injection. This script is distributed by some operating systems in a manner where it is automatically executed. On such operating systems, an attacker could execute arbitrary commands with the privileges of the script. Use of the c_rehash script is considered obsolete and should be replaced by the OpenSSL rehash command line tool. Fixed in OpenSSL 3.0.3 (Affected 3.0.0,3.0.1,3.0.2). Fixed in OpenSSL 1.1.1o (Affected 1.1.1-1.1.1n). Fixed in OpenSSL 1.0.2ze (Affected 1.0.2-1.0.2zd). (CVE-2022-1292) Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2ze。因此，它受到1.0.2ze建议中提到的漏洞的影响。-c_rehash脚本未正确清除shell元字符以防止命令注入。此脚本由某些操作系统以自动执行的方式分发。在这样的操作系统上，攻击者可以使用脚本的权限执行任意命令。c_rehash脚本的使用被认为是过时的，应该用OpenSSL rehash命令行工具代替。已在OpenSSL 3.0.3中修复（受影响的3.0.0、3.0.1、3.0.2）。在OpenSSL 1.1.1o中修复（受到影响的1.1.1-1.1.1n）。在OpenSL 1.0.2ze中修复（被影响的1.0.2-1.0.2zd）。（CVE-2022-1292）请注意，Nessus尚未对此问题进行测试，而是仅依赖于应用程序的自报版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2ze or later.",
        "solution_cn": "升级至OpenSSL 1.0.2ze或更高版本。",
        "cve": "CVE-2022-1292",
        "plugin_id": "160480"
    },
    "161454": {
        "name_en": "Apache 2.4.x < 2.4.52 mod_lua Buffer Overflow",
        "name_cn": "Apache 2.4.x<2.4.52 mod_lua缓冲区溢出",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.52. It is, therefore, affected by a flaw related to mod_lua when handling multipart content. A carefully crafted request body can cause a buffer overflow in the mod_lua multipart parser (r:parsebody() called from Lua scripts). The Apache httpd team is not aware of an exploit for the vulnerability though it might be possible to craft one. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.52。因此，在处理多部分内容时，它受到与mod_lua相关的缺陷的影响。精心制作的请求体可能会导致mod_lua多部分解析器（从lua脚本调用的r:parsebody（））中的缓冲区溢出。Apache httpd团队没有意识到该漏洞的漏洞，尽管可能会精心设计一个漏洞。请注意，Nessus没有对此问题进行测试，而是仅依赖于应用程序的自报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.52 or later.",
        "solution_cn": "升级至Apache 2.4.52或更高版本。",
        "cve": "CVE-2021-44790",
        "plugin_id": "161454"
    },
    "161948": {
        "name_en": "Apache 2.4.x < 2.4.54 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4.x<2.4.54多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.54. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.54 advisory. - Possible request smuggling in mod_proxy_ajp: Inconsistent Interpretation of HTTP Requests ('HTTP Request Smuggling') vulnerability in mod_proxy_ajp of Apache HTTP Server allows an attacker to smuggle requests to the AJP server it forwards requests to. This issue affects Apache HTTP Server Apache HTTP Server 2.4 version 2.4.53 and prior versions. Acknowledgements: Ricter Z @ 360 Noah Lab (CVE-2022-26377) - Read beyond bounds in mod_isapi: Apache HTTP Server 2.4.53 and earlier on Windows may read beyond bounds when configured to process requests with the mod_isapi module. Acknowledgements: The Apache HTTP Server project would like to thank Ronald Crane (Zippenhop LLC) for reporting this issue (CVE-2022-28330) - Read beyond bounds via ap_rwrite(): The ap_rwrite() function in Apache HTTP Server 2.4.53 and earlier may read unintended memory if an attacker can cause the server to reflect very large input using ap_rwrite() or ap_rputs(), such as with mod_luas r:puts() function. Acknowledgements: The Apache HTTP Server project would like to thank Ronald Crane (Zippenhop LLC) for reporting this issue (CVE-2022-28614) - Read beyond bounds in ap_strcmp_match(): Apache HTTP Server 2.4.53 and earlier may crash or disclose information due to a read beyond bounds in ap_strcmp_match() when provided with an extremely large input buffer. While no code distributed with the server can be coerced into such a call, third-party modules or lua scripts that use ap_strcmp_match() may hypothetically be affected. Acknowledgements: The Apache HTTP Server project would like to thank Ronald Crane (Zippenhop LLC) for reporting this issue (CVE-2022-28615) - Denial of service in mod_lua r:parsebody: In Apache HTTP Server 2.4.53 and earlier, a malicious request to a lua script that calls r:parsebody(0) may cause a denial of service due to no default limit on possible input size. Acknowledgements: The Apache HTTP Server project would like to thank Ronald Crane (Zippenhop LLC) for reporting this issue (CVE-2022-29404) - Denial of Service mod_sed: If Apache HTTP Server 2.4.53 is configured to do transformations with mod_sed in contexts where the input to mod_sed may be very large, mod_sed may make excessively large memory allocations and trigger an abort. Acknowledgements: This issue was found by Brian Moussalli from the JFrog Security Research team (CVE-2022-30522) - Information Disclosure in mod_lua with websockets: Apache HTTP Server 2.4.53 and earlier may return lengths to applications calling r:wsread() that point past the end of the storage allocated for the buffer. Acknowledgements: The Apache HTTP Server project would like to thank Ronald Crane (Zippenhop LLC) for reporting this issue (CVE-2022-30556) - X-Forwarded-For dropped by hop-by-hop mechanism in mod_proxy: Apache HTTP Server 2.4.53 and earlier may not send the X-Forwarded-* headers to the origin server based on client side Connection header hop-by-hop mechanism. This may be used to bypass IP based authentication on the origin server/application. Acknowledgements: The Apache HTTP Server project would like to thank Gaetan Ferry (Synacktiv) for reporting this issue (CVE-2022-31813) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.54。因此，它受到2.4.54咨询中提到的多个漏洞的影响mod_proxy_ajp中可能存在请求走私：Apache HTTP Server mod_proxy-ajp中的HTTP请求解释不一致（“HTTP请求走私”）漏洞允许攻击者将请求走私到其转发请求的ajp服务器。此问题会影响Apache HTTP Server Apache HTTP Server 2.4 2.4.53版和更早版本。确认：Ricter Z@360 Noah Lab（CVE-2022-26377）-在mod_isapi中读取超出界限：Windows上的Apache HTTP Server 2.4.53和更早版本在配置为使用mod_isap模块处理请求时可能读取超出界限。致谢：Apache HTTP Server项目要感谢Ronald Crane（Zippenhop LLC）报告了此问题（CVE-2022-28330）-通过ap_rwrite（）读取超出界限：如果攻击者可以使用ap_rwrite（）或ap_rputs（）导致服务器反映非常大的输入，Apache HTTP Server 2.4.53和更早版本中的ap_rrite（）函数可能会读取非预期内存，例如使用mod_luas r:puts（）函数。致谢：Apache HTTP Server项目要感谢Ronald Crane（Zippenhop LLC）报告了这个问题（CVE-2022-28614）-ap_strcmp_match（）中的读取超出界限：如果提供了非常大的输入缓冲区，Apache HTTP Server 2.4.53和更早版本可能会崩溃或泄露信息，因为ap_strcmp_match（（）中存在读取超出界限。虽然没有随服务器分发的代码可以强制执行这样的调用，但使用ap_strcmp_match（）的第三方模块或lua脚本可能会受到影响。致谢：Apache HTTP Server项目感谢Ronald Crane（Zippenhop LLC）报告了这个问题（CVE-2022-28615）——mod_lua r:parsebody中的拒绝服务：在Apache HTTP Server 2.4.53和更早版本中，对调用r:parsebody（0）的lua脚本的恶意请求可能会导致拒绝服务，因为可能的输入大小没有默认限制。致谢：Apache HTTP Server项目要感谢Ronald Crane（Zippenhop LLC）报告了这个问题（CVE-2022-29404）-拒绝服务mod_sed：如果Apache HTTP Server 2.4.53配置为在mod_sed的输入可能非常大的上下文中使用mod_sed进行转换，mod_sed可能会进行过大的内存分配并触发中止。确认：此问题由JFrog安全研究团队（CVE-2022-30522）的Brian Moussalli发现-使用websockets:Apache HTTP Server 2.4.53和更早版本的mod_lua中的信息泄漏可能会向调用r:wsread（）的应用程序返回超过为缓冲区分配的存储末尾的长度。致谢：Apache HTTP Server项目要感谢Ronald Crane（Zippenhop LLC）报告了此问题（CVE-2022-30556）-X-Forwarded-for mod_proxy中逐跳丢弃机制：Apache HTTP服务器2.4.53和更早版本可能不会基于客户端连接头逐跳机制将X-Forwarded-*头发送到源服务器。这可用于绕过源服务器/应用程序上基于IP的身份验证。致谢：Apache HTTP Server项目要感谢Gaetan Ferry（Synacktiv）报告了这个问题（CVE-2022-31813）。请注意，Nessus没有针对这些问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.54 or later.",
        "solution_cn": "升级至Apache 2.4.54或更高版本。",
        "cve": "CVE-2022-26377",
        "plugin_id": "161948"
    },
    "162419": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2zf Vulnerability",
        "name_cn": "OpenSSL 1.0.2<1.0.2zf漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2zf. It is, therefore, affected by a vulnerability as referenced in the 1.0.2zf advisory. Note that Nessus has not tested for this issue but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2zf。因此，它受到1.0.2zf建议中提到的漏洞的影响。请注意，Nessus没有对此问题进行测试，而是仅依赖于应用程序的自报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2zf or later.",
        "solution_cn": "升级至OpenSSL 1.0.2zf或更高版本。",
        "cve": "CVE-2022-2068",
        "plugin_id": "162419"
    },
    "170113": {
        "name_en": "Apache 2.4.x < 2.4.55 Multiple Vulnerabilities",
        "name_cn": "Apache 2.4.x<2.4.55多个漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The version of Apache httpd installed on the remote host is prior to 2.4.55. It is, therefore, affected by multiple vulnerabilities as referenced in the 2.4.55 advisory. - A carefully crafted If: request header can cause a memory read, or write of a single zero byte, in a pool (heap) memory location beyond the header value sent. This could cause the process to crash. This issue affects Apache HTTP Server 2.4.54 and earlier. (CVE-2006-20001) - Inconsistent Interpretation of HTTP Requests ('HTTP Request Smuggling') vulnerability in mod_proxy_ajp of Apache HTTP Server allows an attacker to smuggle requests to the AJP server it forwards requests to. This issue affects Apache HTTP Server Apache HTTP Server 2.4 version 2.4.54 and prior versions. (CVE-2022-36760) - Prior to Apache HTTP Server 2.4.55, a malicious backend can cause the response headers to be truncated early, resulting in some headers being incorporated into the response body. If the later headers have any security purpose, they will not be interpreted by the client. (CVE-2022-37436) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的Apache httpd版本早于2.4.55。因此，它受到2.4.55咨询中提到的多个漏洞的影响精心制作的If：request标头可能会导致池（堆）内存位置中超出发送的标头值的单个零字节的内存读取或写入。这可能会导致进程崩溃。此问题影响Apache HTTP Server 2.4.54和更早版本。（CVE-2006-20001）-Apache HTTP Server mod_proxy_ajp中的HTTP请求解释不一致（“HTTP请求走私”）漏洞允许攻击者将请求走私到其转发请求的ajp服务器。此问题影响Apache HTTP Server Apache HTTP Server 2.4 2.4.54版及更早版本。（CVE-2022-36760）-在Apache HTTP Server 2.4.55之前，恶意后端可能会导致响应标头提前被截断，从而导致一些标头被合并到响应主体中。如果后面的标头有任何安全目的，客户端将不会解释它们。（CVE-2022-37436）请注意，Nessus没有针对这些问题进行测试，而是仅依赖于应用程序的自我报告版本号。",
        "solution_en": "Upgrade to Apache version 2.4.55 or later.",
        "solution_cn": "升级至Apache 2.4.55或更高版本。",
        "cve": "CVE-2006-20001",
        "plugin_id": "170113"
    },
    "171080": {
        "name_en": "OpenSSL 1.0.2 < 1.0.2zg Multiple Vulnerabilities",
        "name_cn": "OpenSSL 1.0.2<1.0.2zg多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The version of OpenSSL installed on the remote host is prior to 1.0.2zg. It is, therefore, affected by multiple vulnerabilities as referenced in the 1.0.2zg advisory. - There is a type confusion vulnerability relating to X.400 address processing inside an X.509 GeneralName. X.400 addresses were parsed as an ASN1_STRING but the public structure definition for GENERAL_NAME incorrectly specified the type of the x400Address field as ASN1_TYPE. This field is subsequently interpreted by the OpenSSL function GENERAL_NAME_cmp as an ASN1_TYPE rather than an ASN1_STRING. When CRL checking is enabled (i.e. the application sets the X509_V_FLAG_CRL_CHECK flag), this vulnerability may allow an attacker to pass arbitrary pointers to a memcmp call, enabling them to read memory contents or enact a denial of service. In most cases, the attack requires the attacker to provide both the certificate chain and CRL, neither of which need to have a valid signature. If the attacker only controls one of these inputs, the other input must already contain an X.400 address as a CRL distribution point, which is uncommon. As such, this vulnerability is most likely to only affect applications which have implemented their own functionality for retrieving CRLs over a network. Thanks to David Benjamin (Google). Fix developed by Hugo Landau. Fixed in OpenSSL 1.0.2zg (Affected since 1.0.2). (CVE-2023-0286) - The public API function BIO_new_NDEF is a helper function used for streaming ASN.1 data via a BIO. It is primarily used internally to OpenSSL to support the SMIME, CMS and PKCS7 streaming capabilities, but may also be called directly by end user applications. The function receives a BIO from the caller, prepends a new BIO_f_asn1 filter BIO onto the front of it to form a BIO chain, and then returns the new head of the BIO chain to the caller. Under certain conditions, for example if a CMS recipient public key is invalid, the new filter BIO is freed and the function returns a NULL result indicating a failure. However, in this case, the BIO chain is not properly cleaned up and the BIO passed by the caller still retains internal pointers to the previously freed filter BIO. If the caller then goes on to call BIO_pop() on the BIO then a use-after-free will occur. This will most likely result in a crash. This scenario occurs directly in the internal function B64_write_ASN1() which may cause BIO_new_NDEF() to be called and will subsequently call BIO_pop() on the BIO. This internal function is in turn called by the public API functions PEM_write_bio_ASN1_stream, PEM_write_bio_CMS_stream, PEM_write_bio_PKCS7_stream, SMIME_write_ASN1, SMIME_write_CMS and SMIME_write_PKCS7. Other public API functions that may be impacted by this include i2d_ASN1_bio_stream, BIO_new_CMS, BIO_new_PKCS7, i2d_CMS_bio_stream and i2d_PKCS7_bio_stream. The OpenSSL cms and smime command line applications are similarly affected. Thanks to Octavio Galland (Max Planck Institute for Security and Privacy). Thanks to Marcel Bhme (Max Planck Institute for Security and Privacy). Fix developed by Viktor Dukhovni. Fix developed by Matt Caswell. Fixed in OpenSSL 1.0.2zg (Affected since 1.0.2). (CVE-2023-0215) - A timing based side channel exists in the OpenSSL RSA Decryption implementation which could be sufficient to recover a plaintext across a network in a Bleichenbacher style attack. To achieve a successful decryption an attacker would have to be able to send a very large number of trial messages for decryption. The vulnerability affects all RSA padding modes: PKCS#1 v1.5, RSA-OEAP and RSASVE. For example, in a TLS connection, RSA is commonly used by a client to send an encrypted pre-master secret to the server. An attacker that had observed a genuine connection between a client and a server could use this flaw to send trial messages to the server and record the time taken to process them. After a sufficiently large number of messages the attacker could recover the pre-master secret used for the original connection and thus be able to decrypt the application data sent over that connection. Fixed in OpenSSL 1.0.2zg (Affected since 1.0.2). (CVE-2022-4304) Note that Nessus has not tested for these issues but has instead relied only on the application's self-reported version number.",
        "describe_cn": "远程主机上安装的OpenSSL版本早于1.0.2zg。因此，它受到1.0.2zg建议中提到的多个漏洞的影响。-X.509 GeneralName中存在与X.400地址处理相关的类型混淆漏洞。X.400地址被解析为ASN1_STRING，但GENERAL_NAME的公共结构定义错误地将x400Address字段的类型指定为ASN1_type。随后，OpenSSL函数GENERAL_NAME_cmp将此字段解释为ASN1_TYPE，而不是ASN1_STRING。启用CRL检查时（即应用程序设置X509_V_FLAG_CRL_CHECK标志），此漏洞可能允许攻击者向memcmp调用传递任意指针，使其能够读取内存内容或执行拒绝服务。在大多数情况下，攻击要求攻击者同时提供证书链和CRL，两者都不需要有效签名。如果攻击者只控制其中一个输入，则另一个输入必须已经包含X.400地址作为CRL分发点，这是不常见的。因此，此漏洞很可能只影响已实现自己的功能以通过网络检索CRL的应用程序。感谢David Benjamin（谷歌）。由Hugo Landau开发的Fix。已在OpenSSL 1.0.2zg中修复（自1.0.2起受影响）。（CVE-2023-0286）-公共API函数BIO_new_NDEF是用于通过BIO流式传输ASN.1数据的助手函数。它主要用于OpenSSL内部，以支持SMIME、CMS和PKCS7流式传输功能，但也可由最终用户应用程序直接调用。该函数从调用方接收BIO，在其前面准备一个新的BIO_f_asn1过滤器BIO以形成BIO链，然后将BIO链的新头返回给调用方。在某些情况下，例如，如果CMS接收方公钥无效，则释放新的筛选器BIO，函数返回NULL结果，表示失败。但是，在这种情况下，BIO链没有被正确清理，调用方传递的BIO仍然保留指向先前释放的筛选器BIO的内部指针。如果调用方随后继续在BIO上调用BIO_pop（），则将发生释放后使用。这很可能导致撞车。这种情况直接发生在内部函数B64_write_ASN1（）中，这可能会导致BIO_new_NDEF（）被调用，随后将在BIO上调用BIO_pop（）。该内部函数依次由公共API函数PEM_write_BIO_ASN1_stream、PEM_write_BIO_CMS_stream、PEM_write_BIO_PKCS7_stream，SMIME_write_ASN1、SMIME_write_CMS和SMIME_white_PKCS7调用。可能受此影响的其他公共API函数包括i2d_ASN1_bio_stream、bio_new_CMS、bio_news_PKCS7、i2d_CMS_bio_strea和i2d_PKCS7_bio_stream。OpenSSL cms和smime命令行应用程序也受到类似的影响。感谢Octavio Galland（马克斯·普朗克安全与隐私研究所）。感谢Marcel Bhme（马克斯·普朗克安全与隐私研究所）。由Viktor Dukhovni开发的修复程序。修复由Matt Caswell开发。已在OpenSSL 1.0.2zg中修复（自1.0.2起受影响）。（CVE-2023-0215）-OpenSSL RSA解密实现中存在基于时间的侧信道，这足以在Bleichenbacher式攻击中恢复网络上的明文。为了成功解密，攻击者必须能够发送大量的尝试消息进行解密。该漏洞影响所有RSA填充模式：PKCS#1 v1.5、RSA-OEAP和RSASVE。例如，在TLS连接中，客户端通常使用RSA向服务器发送加密的预主密钥。观察到客户端和服务器之间存在真实连接的攻击者可以利用此漏洞向服务器发送试用消息，并记录处理这些消息所需的时间。在足够多的消息之后，攻击者可以恢复用于原始连接的预主密钥，从而能够解密通过该连接发送的应用程序数据。已在OpenSSL 1.0.2zg中修复（自1.0.2起受影响）。（CVE-2022-4304）请注意，Nessus没有针对这些问题进行测试，而是仅依赖于应用程序的自报告版本号。",
        "solution_en": "Upgrade to OpenSSL version 1.0.2zg or later.",
        "solution_cn": "升级至OpenSSL 1.0.2zg或更高版本。",
        "cve": "CVE-2022-4304",
        "plugin_id": "171080"
    }
}