{
    "18405": {
        "name_en": "Microsoft Windows Remote Desktop Protocol Server Man-in-the-Middle Weakness",
        "name_cn": "微软Windows远程桌面协议服务器中间人攻击漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote version of the Remote Desktop Protocol Server (Terminal Service) is vulnerable to a man-in-the-middle (MiTM) attack. The RDP client makes no effort to validate the identity of the server when setting up encryption. An attacker with the ability to intercept traffic from the RDP server can establish encryption with the client and server without being detected. A MiTM attack of this nature would allow the attacker to obtain any sensitive information transmitted, including authentication credentials. This flaw exists because the RDP server stores a hard-coded RSA private key in the mstlsapi.dll library. Any local user with access to this file (on any Windows system) can retrieve the key and use it for this attack.",
        "describe_cn": "Microsoft Windows远程桌面协议的实现在处理密钥的交换时存在漏洞，远程攻击者可能利用此漏洞窃取服务器的加密密钥。 起因是尽管通过网络传输的信息已经过加密，但在建立会话的加密密钥时没有核实服务器的身份，导致攻击者可以获得密钥，计算出有效的签名，然后发动中间人攻击。成功利用这个漏洞的攻击者可以完全控制连接在服务器上的客户端。",
        "solution_en": "- Force the use of SSL as a transport layer for this service if supported, or/and - Select the 'Allow connections only from computers running Remote Desktop with Network Level Authentication' setting if it is available.",
        "solution_cn": "[1]如果支持的话，RDP使用SSL作为传输层 [2]“只允许使用网络级身份验证的电脑运行远程桌面建立连接”设置为启用",
        "cve": "",
        "plugin_id": "18405"
    },
    "30218": {
        "name_en": "Terminal Services Encryption Level is not FIPS-140 Compliant",
        "name_cn": "终端服务加密级别不符合FIPS-140",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The encryption setting used by the remote Terminal Services service is not FIPS-140 compliant.",
        "describe_cn": "远程终端服务使用的加密设置不符合FIPS-140。",
        "solution_en": "Change RDP encryption level to : 4. FIPS Compliant",
        "solution_cn": "将RDP加密级别更改为：4.FIPS兼容",
        "cve": "",
        "plugin_id": "30218"
    },
    "35291": {
        "name_en": "SSL Certificate Signed using Weak Hashing Algorithm",
        "name_cn": "SSL证书签名使用弱强度的哈希算法",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote service uses an SSL certificate chain that has been signed using a cryptographically weak hashing algorithm (e.g. MD2, MD4, MD5, or SHA1). These signature algorithms are known to be vulnerable to collision attacks. An attacker can exploit this to generate another certificate with the same digital signature, allowing an attacker to masquerade as the affected service. Note that this plugin reports all SSL certificate chains signed with SHA-1 that expire after January 1, 2017 as vulnerable. This is in accordance with Google's gradual sunsetting of the SHA-1 cryptographic hash algorithm. Note that certificates in the chain that are contained in the Nessus CA database (known_CA.inc) have been ignored.",
        "describe_cn": "远程服务器的SSL证书签名使用弱强度的哈希加密算法，例如MD2、MD4或者MD5。这些签名算法显示容易遭到破解。",
        "solution_en": "Contact the Certificate Authority to have the certificate reissued.",
        "solution_cn": "联系证书认证机构发布新的证书。 如果服务器使用自签名证书，则可自己",
        "cve": "",
        "plugin_id": "35291"
    },
    "42873": {
        "name_en": "SSL Medium Strength Cipher Suites Supported",
        "name_cn": "允许SSL采用中强度加密",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host supports the use of SSL ciphers that offer medium strength encryption. Nessus regards medium strength as any encryption that uses key lengths at least 64 bits and less than 112 bits, or else that uses the 3DES encryption suite. Note that it is considerably easier to circumvent medium strength encryption if the attacker is on the same physical network.",
        "describe_cn": "远程主机支持SSL使用的密码采用中强度解密，即使用的KEY解密长度至少64位，但少于112位。注意：如果攻击者在同一个物理网段，密码很容易暴露。",
        "solution_en": "Reconfigure the affected application if possible to avoid use of medium strength ciphers.",
        "solution_cn": "重新设置受影响的应用程序，可能的话，避免使用中强度加密，改为强度较高的加密算法。",
        "cve": "",
        "plugin_id": "42873"
    },
    "51192": {
        "name_en": "SSL Certificate Cannot Be Trusted",
        "name_cn": "SSL证书不被信任",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The server's X.509 certificate cannot be trusted. This situation can occur in three different ways, in which the chain of trust can be broken, as stated below : - First, the top of the certificate chain sent by the server might not be descended from a known public certificate authority. This can occur either when the top of the chain is an unrecognized, self-signed certificate, or when intermediate certificates are missing that would connect the top of the certificate chain to a known public certificate authority. - Second, the certificate chain may contain a certificate that is not valid at the time of the scan. This can occur either when the scan occurs before one of the certificate's 'notBefore' dates, or after one of the certificate's 'notAfter' dates. - Third, the certificate chain may contain a signature that either didn't match the certificate's information or could not be verified. Bad signatures can be fixed by getting the certificate with the bad signature to be re-signed by its issuer. Signatures that could not be verified are the result of the certificate's issuer using a signing algorithm that Nessus either does not support or does not recognize. If the remote host is a public host in production, any break in the chain makes it more difficult for users to verify the authenticity and identity of the web server. This could make it easier to carry out man-in-the-middle attacks against the remote host.",
        "describe_cn": "此项服务的SSL证书不被信任。",
        "solution_en": "Purchase or generate a proper certificate for this service.",
        "solution_cn": "为此项服务购买或生成合适的证书",
        "cve": "",
        "plugin_id": "51192"
    },
    "57582": {
        "name_en": "SSL Self-Signed Certificate",
        "name_cn": "SSL自签名证书",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The X.509 certificate chain for this service is not signed by a recognized certificate authority. If the remote host is a public host in production, this nullifies the use of SSL as anyone could establish a man-in-the-middle attack against the remote host. Note that this plugin does not check for certificate chains that end in a certificate that is not self-signed, but is signed by an unrecognized certificate authority.",
        "describe_cn": "服务器所使用的X.509签署的证书链不是权威的证书颁发机构所颁发的。这削弱了使用SSL的效果，因为任何人都可以建立一个中间人攻击远程主机。",
        "solution_en": "Purchase or generate a proper certificate for this service.",
        "solution_cn": "购买或者生成被认可的证书",
        "cve": "",
        "plugin_id": "57582"
    },
    "57608": {
        "name_en": "SMB Signing Required",
        "name_cn": "SMB数字签名通信禁用",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "Signing is not required on the remote SMB server. An unauthenticated, remote attacker can exploit this to conduct man-in-the-middle attacks against the SMB server.",
        "describe_cn": "SMB 协议为 Microsoft 文件和打印共享以及许多其他网络操作（例如远程 Windows 管理）提供基础。为了防止在传输过程中修改 SMB 数据包的拦截攻击，SMB 协议支持对 SMB 数据包的数字签名。 主机禁用了SMB数字签名通信，这可能导致潜在攻击者针对SMB通信服务进行中间人攻击。",
        "solution_en": "Enforce message signing in the host's configuration. On Windows, this is found in the policy setting 'Microsoft network server: Digitally sign communications (always)'. On Samba, the setting is called 'server signing'. See the 'see also' links for further details.",
        "solution_cn": "在本地策略中--安全选项设置如下： Microsoft 网络客户端：对通信进行数字签名（若服务器同意）（启用） Microsoft 网络服务器：对通信进行数字签名（若客户同意）（启用）",
        "cve": "",
        "plugin_id": "57608"
    },
    "57690": {
        "name_en": "Terminal Services Encryption Level is Medium or Low",
        "name_cn": "终端服务加密级别是中等或低",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote Terminal Services service is not configured to use strong cryptography. Using weak cryptography with this service may allow an attacker to eavesdrop on the communications more easily and obtain screenshots and/or keystrokes.",
        "describe_cn": "远程终端服务加密级别不够强，会降低攻击者窃听通信（包含获取截图和键盘记录）的难度。",
        "solution_en": "Change RDP encryption level to one of : 3. High 4. FIPS Compliant",
        "solution_cn": "组策略--计算机配置--管理模板--远程桌面服务--设置客户端连接加密级别： 修改RDP加密级别为“高”或者“FIPS兼容”",
        "cve": "",
        "plugin_id": "57690"
    },
    "58453": {
        "name_en": "Terminal Services Doesn't Use Network Level Authentication",
        "name_cn": "终端服务未使用网络级别身份验证(NLA)",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote Terminal Services is not configured to use Network Level Authentication (NLA) only. NLA uses the Credential Security Support Provider (CredSSP) protocol to perform strong server authentication either through TLS/SSL or Kerberos mechanisms, which protect against man-in-the-middle attacks. In addition to improving authentication, NLA also helps protect the remote computer from malicious users and software by completing user authentication before a full RDP connection is established.",
        "describe_cn": "远程终端服务未配置采用网络级别身份验证(NLA)。NLA使用凭据安全支持提供者(CredSSP)协议通过TLS/ SSL或Kerberos机制来执行强大的服务器身份验证，这能有效防止中间人攻击。除了优化认证,NLA也有助于防止恶意用户在一个完整的RDP连接建立之前，完成用户身份验证。",
        "solution_en": "Enable Network Level Authentication (NLA) on the remote RDP server. This is generally done on the 'Remote' tab of the 'System' settings on Windows.",
        "solution_cn": "在“系统”设置的“远程”选项卡-- 启用网络级身份验证(NLA) 注意：如果客户端不支持“网络级身份验证”，将无法连接服务器远程管理服务。远程管理客户端版本需大于等于6.0",
        "cve": "",
        "plugin_id": "58453"
    },
    "65821": {
        "name_en": "SSL RC4 Cipher Suites Supported",
        "name_cn": "远程主机支持SSL RC4加密套件",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote host supports the use of RC4 in one or more cipher suites. The RC4 cipher is flawed in its generation of a pseudo-random stream of bytes so that a wide variety of small biases are introduced into the stream, decreasing its randomness. If plaintext is repeatedly encrypted (e.g., HTTP cookies), and an attacker is able to obtain many (i.e., tens of millions) ciphertexts, the attacker may be able to derive the plaintext.",
        "describe_cn": "远程主机在一个或多个支持使用RC4密码套件，RC4密码是有缺陷的生成伪随机流的字节数, 如果明文重复加密(如HTTP cookie),攻击者能够获得许多(即数以百万计)明文密文配对,攻击者可以获得密文后，对比获得明文。",
        "solution_en": "Reconfigure the affected application, if possible, to avoid use of RC4 ciphers. Consider using TLS 1.2 with AES-GCM suites subject to browser and web server support.",
        "solution_cn": "重新设置受影响的应用程序，可能的话，避免使用RC4密钥算法，可以考虑给浏览器或WEB服务支持的带有AES-GCM 的TLS 1.2，相关链接： http://www.nessus.org/u?217a3666 http://cr.yp.to/talks/2013.03.12/slides.pdf http://www.isg.rhul.ac.uk/tls/ http://www.imperva.com/docs/HII_Attacking_SSL_when_using_RC4.pdf",
        "cve": "",
        "plugin_id": "65821"
    },
    "79638": {
        "name_en": "MS14-066: Vulnerability in Schannel Could Allow Remote Code Execution (2992611) (uncredentialed check)",
        "name_cn": "MS14-066：Schannel 远程代码执行漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The remote Windows host is affected by a remote code execution vulnerability due to improper processing of packets by the Secure Channel (Schannel) security package. An attacker can exploit this issue by sending specially crafted packets to a Windows server. Note that this plugin sends a client Certificate TLS handshake message followed by a CertificateVerify message. Some Windows hosts will close the connection upon receiving a client certificate for which it did not ask for with a CertificateRequest message. In this case, the plugin cannot proceed to detect the vulnerability as the CertificateVerify message cannot be sent.",
        "describe_cn": "MS14-066 (CVE-2014-6321) 是存在于Microsoft的schannel.dll中的TLS堆缓冲区溢出漏洞。",
        "solution_en": "Microsoft has released a set of patches for Windows 2003, Vista, 2008, 7, 2008 R2, 8, 2012, 8.1, and 2012 R2.",
        "solution_cn": "目前厂商已经发布了升级补丁以修复此安全问题，补丁获取链接： https://technet.microsoft.com/library/security/ms14-066",
        "cve": "",
        "plugin_id": "79638"
    },
    "90510": {
        "name_en": "MS16-047: Security Update for SAM and LSAD Remote Protocols (3148527) (Badlock) (uncredentialed check)",
        "name_cn": "Windows SAM 和 LSAD 降级漏洞",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote Windows host is affected by an elevation of privilege vulnerability in the Security Account Manager (SAM) and Local Security Authority (Domain Policy) (LSAD) protocols due to improper authentication level negotiation over Remote Procedure Call (RPC) channels. A man-in-the-middle attacker able to intercept communications between a client and a server hosting a SAM database can exploit this to force the authentication level to downgrade, allowing the attacker to impersonate an authenticated user and access the SAM database.",
        "describe_cn": "当安全帐户管理器 (SAM) 和本地安全机构（域策略）(LSAD) 远程协议接受不充分保护它们的验证级别时，它们中会存在一个特权提升漏洞。此漏洞是由 SAM 和 LSAD 远程协议建立远程过程调用 (RPC) 通道的方式导致的。成功利用此漏洞的攻击者可以获得对 SAM 数据库的访问权限。",
        "solution_en": "Microsoft has released a set of patches for Windows Vista, 2008, 7, 2008 R2, 2012, 8.1, RT 8.1, 2012 R2, and 10.",
        "solution_cn": "请选择合适的版本的补丁进行Windows 更新https://technet.microsoft.com/zh-cn/library/security/ms16-047.aspx#ID0EPOAC",
        "cve": "",
        "plugin_id": "90510"
    },
    "97833": {
        "name_en": "MS17-010: Security Update for Microsoft Windows SMB Server (4013389) (uncredentialed check)",
        "name_cn": "Windows SMB 远程代码执行漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The remote Windows host is affected by the following vulnerabilities : - Multiple remote code execution vulnerabilities exist in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of certain requests. An unauthenticated, remote attacker can exploit these vulnerabilities, via a specially crafted packet, to execute arbitrary code. (CVE-2017-0143, CVE-2017-0144, CVE-2017-0145, CVE-2017-0146, CVE-2017-0148) - An information disclosure vulnerability exists in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of certain requests. An unauthenticated, remote attacker can exploit this, via a specially crafted packet, to disclose sensitive information. (CVE-2017-0147) ETERNALBLUE, ETERNALCHAMPION, ETERNALROMANCE, and ETERNALSYNERGY are four of multiple Equation Group vulnerabilities and exploits disclosed on 2017/04/14 by a group known as the Shadow Brokers. WannaCry / WannaCrypt is a ransomware program utilizing the ETERNALBLUE exploit, and EternalRocks is a worm that utilizes seven Equation Group vulnerabilities. Petya is a ransomware program that first utilizes CVE-2017-0199, a vulnerability in Microsoft Office, and then spreads via ETERNALBLUE.",
        "describe_cn": "当 Microsoft 服务器消息块 1.0 (SMBv1) 服务器处理某些请求时，存在多个远程执行代码漏洞。成功利用这些漏洞的攻击者可以获取在目标系统上执行代码的能力。 为了利用此漏洞，在多数情况下，未经身份验证的攻击者可能向目标 SMBv1 服务器发送经特殊设计的数据包",
        "solution_en": "Microsoft has released a set of patches for Windows Vista, 2008, 7, 2008 R2, 2012, 8.1, RT 8.1, 2012 R2, 10, and 2016. Microsoft has also released emergency patches for Windows operating systems that are no longer supported, including Windows XP, 2003, and 8. For unsupported Windows operating systems, e.g. Windows XP, Microsoft recommends that users discontinue the use of SMBv1. SMBv1 lacks security features that were included in later SMB versions. SMBv1 can be disabled by following the vendor instructions provided in Microsoft KB2696547. Additionally, US-CERT recommends that users block SMB directly by blocking TCP port 445 on all network boundary devices. For SMB over the NetBIOS API, block TCP ports 137 / 139 and UDP ports 137 / 138 on all network boundary devices.",
        "solution_cn": "微软已发布官方补丁，具体参考： https://technet.microsoft.com/zh-cn/library/security/MS17-010",
        "cve": "",
        "plugin_id": "97833"
    },
    "100464": {
        "name_en": "Microsoft Windows SMBv1 Multiple Vulnerabilities",
        "name_cn": "Microsoft Windows SMBv1多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The remote Windows host has Microsoft Server Message Block 1.0 (SMBv1) enabled. It is, therefore, affected by multiple vulnerabilities : - Multiple information disclosure vulnerabilities exist in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of SMBv1 packets. An unauthenticated, remote attacker can exploit these vulnerabilities, via a specially crafted SMBv1 packet, to disclose sensitive information. (CVE-2017-0267, CVE-2017-0268, CVE-2017-0270, CVE-2017-0271, CVE-2017-0274, CVE-2017-0275, CVE-2017-0276) - Multiple denial of service vulnerabilities exist in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of requests. An unauthenticated, remote attacker can exploit these vulnerabilities, via a specially crafted SMB request, to cause the system to stop responding. (CVE-2017-0269, CVE-2017-0273, CVE-2017-0280) - Multiple remote code execution vulnerabilities exist in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of SMBv1 packets. An unauthenticated, remote attacker can exploit these vulnerabilities, via a specially crafted SMBv1 packet, to execute arbitrary code. (CVE-2017-0272, CVE-2017-0277, CVE-2017-0278, CVE-2017-0279) Depending on the host's security policy configuration, this plugin cannot always correctly determine if the Windows host is vulnerable if the host is running a later Windows version (i.e., Windows 8.1, 10, 2012, 2012 R2, and 2016) specifically that named pipes and shares are allowed to be accessed remotely and anonymously. Tenable does not recommend this configuration, and the hosts should be checked locally for patches with one of the following plugins, depending on the Windows version : 100054, 100055, 100057, 100059, 100060, or 100061.",
        "describe_cn": "Microsoft Windows SMB中存在安全更新。如果攻击者将特制数 据包发送到Microsoft Server Message Block 1.0（SMBv1）服务 器，则最严重的漏洞可能允许远程执行代码。",
        "solution_en": "Apply the applicable security update for your Windows version : - Windows Server 2008 : KB4018466 - Windows 7 : KB4019264 - Windows Server 2008 R2 : KB4019264 - Windows Server 2012 : KB4019216 - Windows 8.1 / RT 8.1. : KB4019215 - Windows Server 2012 R2 : KB4019215 - Windows 10 : KB4019474 - Windows 10 Version 1511 : KB4019473 - Windows 10 Version 1607 : KB4019472 - Windows 10 Version 1703 : KB4016871 - Windows Server 2016 : KB4019472",
        "solution_cn": "厂商已发布升级程序修复该漏洞，请及时下载更新： https://support.microsoft.com/zh-cn/help/4025687/microsoft-security-advisory-4025685-guidance-for-older-platforms",
        "cve": "",
        "plugin_id": "100464"
    },
    "104743": {
        "name_en": "TLS Version 1.0 Protocol Detection",
        "name_cn": "TLS版本1.0协议检测",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote service accepts connections encrypted using TLS 1.0. TLS 1.0 has a number of cryptographic design flaws. Modern implementations of TLS 1.0 mitigate these problems, but newer versions of TLS like 1.2 and 1.3 are designed against these flaws and should be used whenever possible. As of March 31, 2020, Endpoints that arenât enabled for TLS 1.2 and higher will no longer function properly with major web browsers and major vendors. PCI DSS v3.2 requires that TLS 1.0 be disabled entirely by June 30, 2018, except for POS POI terminals (and the SSL/TLS termination points to which they connect) that can be verified as not being susceptible to any known exploits.",
        "describe_cn": "远程服务接受使用TLS 1.0加密的连接。TLS 1.0有许多密码设计缺陷。TLS 1.0的现代实现减轻了这些问题，但是像1.2和1.3这样的TLS的新版本是针对这些缺陷而设计的，应该尽可能使用。截至2020年3月31日，为TLS 1.2及更高版本启用的终结点将不再与主要web浏览器和主要供应商正常工作。PCI DSS v3.2要求在2018年6月30日之前完全禁用TLS 1.0，但POS POI终端（及其连接的SSL/TLS终端点）除外，这些终端可以被验证为不易受任何已知漏洞攻击。",
        "solution_en": "Enable support for TLS 1.2 and 1.3, and disable support for TLS 1.0.",
        "solution_cn": "启用对TLS 1.2和1.3的支持，并禁用对TLS 1.0的支持。",
        "cve": "",
        "plugin_id": "104743"
    },
    "125313": {
        "name_en": "Microsoft RDP RCE (CVE-2019-0708) (BlueKeep) (uncredentialed check)",
        "name_cn": "Microsoft Remote Desktop Services 输入验证错误漏洞",
        "risk_en": "Critical",
        "risk_cn": "紧急",
        "describe_en": "The remote host is affected by a remote code execution vulnerability in Remote Desktop Protocol (RDP). An unauthenticated, remote attacker can exploit this, via a series of specially crafted requests, to execute arbitrary code.",
        "describe_cn": "Windows系列服务器于2019年5月15号，被爆出高危漏洞，该漏洞影响范围较广，windows2003、windows2008、windows2008 R2、windows xp * 系统都会遭到攻击，该服务器漏洞利用方式是通过远程桌面端口3389，RDP协议进行攻击的 。CVE-2019-0708漏洞是通过检查用户的身份认证，导致可以绕过认证，不用任何的交互，直接通过rdp协议进行连接发送恶意代码执行命令到服务器中去。这个漏洞是今年来说危害严重性最大的漏洞，换句话说，该漏洞是“可传播的”，这意味着任何利用该漏洞的恶意软件都可能从受影响的计算机传播到受影响的计算机，就像2017年WannaCry恶意软件在全球蔓延一样，跟之前的勒索，永恒之蓝病毒差不多。 *备注：微软不在对 windows-Xp 和windows 2003 提供安全更新（对windows10和8无影响）",
        "solution_en": "Microsoft has released a set of patches for Windows XP, 2003, 2008, 7, and 2008 R2.",
        "solution_cn": "目前厂商已发布升级补丁以修复漏洞，补丁获取链接： https://portal.msrc.microsoft.com/zh-CN/security-guidance/advisory/CVE-2019-0708",
        "cve": "",
        "plugin_id": "125313"
    },
    "999999": {
        "name_en": "Microsoft Windows SMBv1 Multiple Vulnerabilities",
        "name_cn": "Microsoft Windows SMBv1多个漏洞",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The remote Windows host has Microsoft Server Message Block 1.0 (SMBv1) enabled. It is, therefore, affected by multiple vulnerabilities : - Multiple information disclosure vulnerabilities exist in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of SMBv1 packets. An unauthenticated, remote attacker can exploit these vulnerabilities, via a specially crafted SMBv1 packet, to disclose sensitive information. (CVE-2017-0267, CVE-2017-0268, CVE-2017-0270, CVE-2017-0271, CVE-2017-0274, CVE-2017-0275, CVE-2017-0276) - Multiple denial of service vulnerabilities exist in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of requests. An unauthenticated, remote attacker can exploit these vulnerabilities, via a specially crafted SMB request, to cause the system to stop responding. (CVE-2017-0269, CVE-2017-0273, CVE-2017-0280) - Multiple remote code execution vulnerabilities exist in Microsoft Server Message Block 1.0 (SMBv1) due to improper handling of SMBv1 packets. An unauthenticated, remote attacker can exploit these vulnerabilities, via a specially crafted SMBv1 packet, to execute arbitrary code. (CVE-2017-0272, CVE-2017-0277, CVE-2017-0278, CVE-2017-0279) Depending on the host's security policy configuration, this plugin cannot always correctly determine if the Windows host is vulnerable if the host is running a later Windows version (i.e., Windows 8.1, 10, 2012, 2012 R2, and 2016) specifically that named pipes and shares are allowed to be accessed remotely and anonymously. Tenable does not recommend this configuration, and the hosts should be checked locally for patches with one of the following plugins, depending on the Windows version : 100054, 100055, 100057, 100059, 100060, or 100061.",
        "describe_cn": "远程Windows主机已启用Microsoft Server Message Block 1.0（SMBv1）。因此，它受到多个漏洞的影响：-由于不正确处理SMBv1数据包，Microsoft Server Message Block 1.0（SMBv1）中存在多个信息泄漏漏洞。未经验证的远程攻击者可以通过巧尽心思构建的SMBv1数据包利用这些漏洞来泄露敏感信息(CVE-2017-0267、CVE-2017-0268、CVE-2017-0270、CVE-2017-0271、CVE-2017-0274、CVE-2017-0275、CVE-2017-0276）-由于请求处理不当，Microsoft Server Message Block 1.0（SMBv1）中存在多个拒绝服务漏洞。未经验证的远程攻击者可以通过巧尽心思构建的SMB请求利用这些漏洞，使系统停止响应(CVE-2017-0269、CVE-2017-0273、CVE-2017-0280）-由于不正确处理SMBv1数据包，Microsoft Server Message Block 1.0（SMBv1）中存在多个远程代码执行漏洞。未经验证的远程攻击者可以通过巧尽心思构建的SMBv1数据包利用这些漏洞执行任意代码(CVE-2017-0272、CVE-2017-0277、CVE-2017-0278、CVE-2017-0279）根据主机的安全策略配置，如果主机运行的是更高版本的Windows（即Windows 8.1、10、2012、2012 R2，特别是允许远程匿名访问命名管道和共享。Tenable不建议使用此配置，应在本地检查主机是否有以下插件之一的修补程序，具体取决于Windows版本：100054、100055、100057、100059、100060或100061。",
        "solution_en": "Apply the applicable security update for your Windows version : - Windows Server 2008 : KB4018466 - Windows 7 : KB4019264 - Windows Server 2008 R2 : KB4019264 - Windows Server 2012 : KB4019216 - Windows 8.1 / RT 8.1. : KB4019215 - Windows Server 2012 R2 : KB4019215 - Windows 10 : KB4019474 - Windows 10 Version 1511 : KB4019473 - Windows 10 Version 1607 : KB4019472 - Windows 10 Version 1703 : KB4016871 - Windows Server 2016 : KB4019472",
        "solution_cn": "为您的Windows版本应用适用的安全更新：-Windows Server 2008:KB4018466-Windows 7:KB4019264-Windows Server 2008 R2:KB4019264-Windows Server 2012:KB4019216-Windows 8.1/RT 8.1.：KB4019264KB4019215-Windows Server 2012 R2:KB4019215-Windows 10:KB4019474-Windows 10版本1511:KB4019473-Windows 10版本1607:KB4019472-Windows 10版本1703:KB4016871-Windows Server 2016:KB4019472",
        "cve": "CVE-2017-0279",
        "plugin_id": "999999"
    }
}