{
    "153953": {
        "name_en": "SSH Weak Key Exchange Algorithms Enabled",
        "name_cn": "启用SSH弱密钥交换算法",
        "risk_en": "Low",
        "risk_cn": "低危",
        "describe_en": "The remote SSH server is configured to allow key exchange algorithms which are considered weak. This is based on the IETF draft document Key Exchange (KEX) Method Updates and Recommendations for Secure Shell (SSH) draft-ietf-curdle-ssh-kex-sha2-20. Section 4 lists guidance on key exchange algorithms that SHOULD NOT and MUST NOT be enabled. This includes: diffie-hellman-group-exchange-sha1 diffie-hellman-group1-sha1 gss-gex-sha1-* gss-group1-sha1-* gss-group14-sha1-* rsa1024-sha1 Note that this plugin only checks for the options of the SSH server, and it does not check for vulnerable software versions.",
        "describe_cn": "远程SSH服务器被配置为允许密钥交换算法被认为很弱。这是基于IETF草稿文档密钥交换（KEX）方法更新和安全Shell（SSH）建议草稿-IETF-curdle-SSH-KEX-sha2-20。第4节列出了不应该也不应该启用的密钥交换算法指南。这包括：diffie-hellman-group-exchange-sha1 diffie-hellman-group1-sha1 gss-gex-sha1-*gss-group1-sha1-*gss-group14-sha1-*rsa1024-sha1请注意，此插件只检查SSH服务器的选项，不检查易受攻击的软件版本。",
        "solution_en": "Contact the vendor or consult product documentation to disable the weak algorithms.",
        "solution_cn": "联系供应商或查阅产品文档以禁用弱算法。",
        "cve": ""
    },
    "10922": {
        "name_en": "CVS (Web-Based) Entries File Information Disclosure",
        "name_cn": "CVS（基于Web的）条目文件信息披露",
        "risk_en": "Medium",
        "risk_cn": "中危",
        "describe_en": "The remote web server allows access to a 'CVS/Entries' file and thereby exposes file names in the associated repository.",
        "describe_cn": "远程web服务器允许访问“CVS/Entries”文件，从而在关联的存储库中公开文件名。",
        "solution_en": "Configure permissions for the affected web server to deny access to the reported file as well other related ones, such as 'CVS/Repository' and 'CVS/Root'.",
        "solution_cn": "为受影响的web服务器配置权限，以拒绝访问报告的文件以及其他相关文件，如“CVS/Repository”和“CVS/Root”。",
        "cve": ""
    },
    "156016": {
        "name_en": "Apache Log4Shell RCE detection via Path Enumeration (Direct Check HTTP)",
        "name_cn": "通过路径枚举进行Apache Log4Shell RCE检测（直接检查HTTP）",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "The remote web server is affected by a remote code execution vulnerability via a flaw in the Apache Log4j library. The vulnerability is due to the processing of unsanitized input sent to a logging function. A remote, unauthenticated attacker can explolit this, via a web request to execute arbitrary code with the permission level of the running Java process.",
        "describe_cn": "通过Apache Log4j库中的漏洞，远程web服务器受到远程代码执行漏洞的影响。该漏洞是由于处理发送给日志功能的未初始化输入造成的。未经身份验证的远程攻击者可以通过web请求以运行Java进程的权限级别执行任意代码来破解此漏洞。",
        "solution_en": "Upgrade to Apache Log4j version 2.15.0 or later, or apply the vendor mitigation. Upgrading to the latest versions for Apache Log4j is highly recommended as intermediate versions / patches have known high severity vulnerabilities and the vendor is updating their advisories often as new research and knowledge about the impact of Log4j is discovered. Refer to https://logging.apache.org/log4j/2.x/security.html for the latest versions.",
        "solution_cn": "升级到Apache Log4j 2.15.0或更高版本，或应用供应商缓解措施。强烈建议升级到Apache Log4j的最新版本，因为中间版本/修补程序具有已知的高严重性漏洞，并且供应商经常在发现有关Log4j影响的新研究和知识时更新其建议。提到https://logging.apache.org/log4j/2.x/security.html获取最新版本。",
        "cve": "CVE-2021-44228"
    },
    "156014": {
        "name_en": "Apache Log4Shell RCE detection via callback correlation (Direct Check HTTP)",
        "name_cn": "通过回调关联（直接检查HTTP）检测Apache Log4Shell RCE",
        "risk_en": "High",
        "risk_cn": "高危",
        "describe_en": "A remote code execution vulnerability exists in Apache Log4j < 2.15.0 due to insufficient protections on message lookup substitutions when dealing with user controlled input. A remote, unauthenticated attacker can explolit this, via a web request to execute arbitrary code with the permission level of the running Java process. This plugin requires that both the scanner and target machine have internet access.",
        "describe_cn": "Apache Log4j<2.15.0中存在一个远程代码执行漏洞，原因是在处理用户控制的输入时，对消息查找替换的保护不足。未经身份验证的远程攻击者可以通过web请求以运行Java进程的权限级别执行任意代码来破解此漏洞。此插件要求扫描仪和目标机器都可以访问internet。",
        "solution_en": "Upgrade to Apache Log4j version 2.15.0 or later, or apply the vendor mitigation. Upgrading to the latest versions for Apache Log4j is highly recommended as intermediate versions / patches have known high severity vulnerabilities and the vendor is updating their advisories often as new research and knowledge about the impact of Log4j is discovered. Refer to https://logging.apache.org/log4j/2.x/security.html for the latest versions.",
        "solution_cn": "升级到Apache Log4j 2.15.0或更高版本，或应用供应商缓解措施。强烈建议升级到Apache Log4j的最新版本，因为中间版本/修补程序具有已知的高严重性漏洞，并且供应商经常在发现有关Log4j影响的新研究和知识时更新其建议。提到https://logging.apache.org/log4j/2.x/security.html获取最新版本。",
        "cve": "CVE-2021-44228"
    }
}
